

'''
– #Артур 4800 / 4 (8, 15, 22, 1, 8) ✅
– #Максим 2000 / 1 (18)  +   2000 руб ✅
– #Ефим 8000 / 4 (14, 21, 28, 7, 14) +  10000 руб ✅
– #Михаил 4800 / 4 (21, 28, 7, 14) + 4800 руб ✅
– #Тимур 8000 / 4 (10, 17, 3, 10) + 8000 руб
– #Славик 10200 / 8 (1, 8, 15, 22, 29, 5, 11) + 9450 руб ✅
– #Кирилл 12600 / 7 (17, 21, 24, 28, 3, 7, 10, 14) + 14400 руб ✅
– #Egor 14400 / 8 (15, 19, 22, 26, 1, 5, 8, 12) + 14400 руб ✅
– #Kirill 3600 / 4 (18, 25, 4, 11, 18, 25) + 4800 руб ✅
– #Захар 3600 / 4 (18, 25, 4, 11, 18, 25) + 4800 руб
– #Ярослав 7700 / 7 (31, 7, 14, 21, 28, 7, 14) + 8400 руб ✅
– #Роман 14400 / 8 (11, 18, 25, 4, 11, 18, 25, 1) + 12600 руб
– #Валерия 8000 / 4 (12, 15, 17, 1) + 8000 руб ✅ (оплатили 12000)
– #Alexey 8000 / 4 (17, 24, 3, 10) перенесем 24 + 8000 руб ✅
– #Александр 8800 / 8  (8, 15, 15, 18, 1, 4, 8, 11) + 8800 руб ✅
'''
result_15 = 2000 + 10000 + 4800 + 8000 + 9450 + 14400*2 + 4800*2 + 8400 + 12600 + 8000 + 12000 + 8800
itogo = 4800 + 10000 + 8400 + 8800 + 9450 + 14400 + 12000 + 4800 + 2000 + 14400 + 8000



'''
- 2100 Оплата работы Иры ✅
- 1800 Оплата работы Толик ✅
- 2500 Оплата работы Рита ✅
- 500*8 Оплата работы Саша ✅
- 1000 Оплата Консультаций ✅

- 13000 Вернуть маме ✅
- 6664 Вернуть налоги ✅

- 500 Стрижка 
- 100 Букмейт 
- 950 Эпл подписка 
- 250 МТС
- 1400 Корм кошкам ✅
- 1400 Заказать воду
'''

minus = 500 + 950 + 250 + 100 + 1400
print(f'Теоретически должно прийти: {result_15}')
print(f'Сумма, которую уже перевели: {itogo}')
print(f'Еще должны мне перевести: {result_15 - itogo}')
print(f'Минус расходы на обязательные: {minus}')


# 1 Марта
# print(14400 + 7700 + 12600 + 2400 + 6000 + 8800 + 6000 + 8800 + 7000 + 12600 + 16200 + 2400 + 6000)


