


'''
a = 5  # int (integer) - целочисленные значения

b = 5.0  # float (чсило с плавающей точкой) - вещественные значения (дроби)


print(7 / 2)  # 3.5 - обыкновенное вещественное деление (всегда float)
print(7 // 2)  # 3 - взятие только целой части от деления (всегда int)
print(7 % 2)  # 1 - взятие остатка от деления (всегда int)


n = 1234
print(n // 10)  # 123
print(n % 10)  # 4

print(n // 100)  # 12
print(n % 100)  # 34

print(n // 1000)  # 1
print(n % 1000)  # 234


print('Возвести число 2 в степерь 4:', 2 ** 4)
print(f'Возвести число 2 в степерь 4: {2 ** 4}')

print(f'Взять квадртаный корень от числа 16: {16 ** (1/2)}')
print(f'Взять кубический корень от числа 27: {27 ** (1/3)}')


name = 'Сергей'
age = 17
print(f'Пользователь: {name} с возрастом: {age}')



n = int(input())
if n > 0:
    print('Число положительное')
elif n < 0:
    print('Число отрицательное')
else:
    print('Равно нулю')
'''












