# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************





# Универсальная функция перевода в различные системы счисления #шпора

'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

print(alp[:2])  # ['0', '1']
print(alp[:8])  # ['0', '1', '2', '3', '4', '5', '6', '7']

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

# print(convert(16, 3))  # 121
print(convert(1000, 16))  # 3E8
print(int('3E8', 16))  # 1000
'''

# Встроенный функции перевода в 2, 8, 16-ю системы счисления
'''
n = 10000
print(bin(n))  # 0b10011100010000
print(bin(n)[2:])  # 10011100010000
print(oct(n)[2:])  # 23420
print(hex(n)[2:])  # 2710
print(int('2710', 16))  # 10000

print(f'{n:b}')  # 10011100010000
print(f'{n:x}')  # 2710
print(f'{n:o}')  # 23420
print(int('23420', 8))  # 10000
'''


# Тип 10 №37487
# Переведите двоичное число 1010110 в десятичную систему счисления.
'''
print(int('1010110', 2))  # 86
'''


# Тип 10 №43864
# Вычислите значение арифметического выражения:
# 11011111_2 + 1011_8 − 111_16.
# В ответе запишите десятичное число, основание системы счисления указывать не нужно.
'''
print(int('11011111', 2) + int('1011', 8) - int('111', 16))  # 471
'''


# Тип 10 №37240
# Переведите число 199 из десятичной системы счисления в двоичную систему счисления.
'''
print(bin(199)[2:])  # 11000111
'''

# Тип 10 №18249
# Среди приведенных ниже трех чисел, записанных в десятичной системе
# счисления, найдите число, сумма цифр которого в восьмеричной записи
# наименьшая. В ответе запишите сумму цифр в восьмеричной записи
# этого числа: 55, 83, 91.
'''
print(sum([int(x) for x in oct(55)[2:]]))  # 67  -  13
print(sum([int(x) for x in oct(83)[2:]]))  # 123 - 6
print(sum([int(x) for x in oct(91)[2:]]))  # 133 - 7
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [4, 9, 10]
# на следующем уроке: