# region Домашка: ******************************************************************

'''
x = int(input())
a = x // 10000
b = (x // 1000) % 10
c = (x // 100) % 10
d = (x % 100) // 10
e = x % 10
# print(a, b, c, d, e)
print(a * b * c * d * e)
print(a + b + c + d + e)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Условные операторы: if, elif, else

# x, y = int(input('x: ')), int(input('y: '))
'''
x, y = 0, 2

if x > 0 and y > 0:  # if - если
    print('Первая четверть')
elif x < 0 and y > 0:
    print('Вторая четверть')
elif x < 0 and y < 0:
    print('Третья четверть')
elif x > 0 and y < 0:
    print('Четвертая четверть')
else:  # - иначе
    print('Лежит на осях')
print('the end')
'''


# Каскадные условные операторы
'''
x, y = int(input('x: ')), int(input('y: '))

if x > 0:  
    if y > 0:  # x > 0, y > 0
        print('Первая четверть')
    else:  # x > 0, y <= 0
        print('Четвертая четверть')
else:
    if y > 0:  # x <= 0, y > 0
        print('Вторая четверть')
    else:  # x <= 0, y <= 0
        print('Третья четверть')
'''

# Логические связки: not, and, or, ^, ==, !=
'''
a, b = 7, 0
if a > 0 and b > 0:  # and - гарантирует, что оба условия должны выполняться
    print('YES 1')
if a > 0 or b > 0:  # or - говорит, что хотя бы одно выполняется
    print('YES 2')
if (a > 0) ^ (b > 0):  # ^ - гарантирует, что только одно выполняется
    print('YES 3')
if (a > 0) != (b > 0):
    print('YES 4')
'''


'''
flag = True
print(not flag)  # False
print(not(not flag))  # True
'''

# Напишите программу, которая принимает три числа.
# Считает и выводит сумму только тех чисел, которые кратны 5,
# но не кратны 20 или если число кратно 160.
'''
a = int(input())
b = int(input())
c = int(input())
summa = 0
for x in (a, b, c):
    if (x % 5 == 0 and x % 20 != 0) or x % 160 == 0:
        summa += x
print(summa)
'''


'''
x = 5
# x = x - 1
x -= 1
print(x)

y = 4
# y = y * 3
y *= 3
print(y)

z = 12
# z = z // 3
z //= 3
print(z)
'''

'''
a = int(input())
if 99 < a < 1000 and (a % 5 == 0 or a % 13 == 0):
    print('Да')
else:
    print('Нет')
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
