# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 1 бит - минимальная единица измерения
# 1 байт = 8 бит = 2**3 бит
# 1 Кбайт = 1024 байт = 2**10 байт = 2**13 бит
# 1 Мбайт = 1024 Кбайт = 2**20 байт = 2**23 бит
# 1 Гбайт = 1024 Мбайт = 2**30 байт = 2**33 бит


# № 17524 Основная волна 07.06.24 (Уровень: Средний)
'''
# V = symbols * i
alphabet = 10 + 52 + 458  # 520
i = 10

print((276 * 2**10) / 862)  # 327.87006960
print(327 * 8)  # 2616 бит
print(2616 / i)  # 261.6
'''

# КЕГЭ № 5247 (Уровень: Базовый)
# https://stepik.org/lesson/1038609/step/13?unit=1062783
'''
pixels = 4044 * 1028
V = 16 * 2 ** 23  # бит
I = V / pixels
print(I)  # 32.28535910432

i = 16  # colors = 2 ** i
i = 32 - 16  # mirror = 2 ** i
print(2**16)  # 65536
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
