# region Домашка: ************************************************************


# endregion Домашка: *********************************************************
# #
# #
# region Урок: ************************************************************

# Задание 1 https://education.yandex.ru/ege/task/725728d8-0f30-46a3-aa73-4de824b76530
'''
from itertools import *
table = '14 15 16 18 23 24 25 26 27 29 32 35 41 42 46 47 49 51 52 53 56 59 61 62 64 65 68 72 74 81 86 92 94 95'
graph = 'МР РМ МН НМ НР РН РП ПР ПН НП НС СН СП ПС СК КС КР РК КЛ ЛК КВ ВК ЛВ ВЛ ВР РВ СВ ВС ВН НВ НТ ТН ТС СТ'
print('1 2 3 4 5 6 7 8 9')
for p in permutations('МРПСНКЛТВ'):
    # ('В', 'Т', 'Л', 'К', 'Н', 'С', 'Р', 'М', 'П')
    new_table = table
    for i in range(1, 9+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''
# 1 2 3 4 5 6 7 8 9
# К Н М С Р В Т Л П
# К Н Т Р С В М Л П


# Задание 1 https://education.yandex.ru/ege/task/ec7525ac-28c3-46ad-b08e-3dd50971a444
'''
from itertools import *
table = '13 14 15 23 25 31 32 38 41 45 46 51 52 54 64 67 68 76 78 83 86 87'
graph = 'АБ БА БВ ВБ АВ ВА БД ДБ ДГ ГД ГВ ВГ АЗ ЗА ЗЖ ЖЗ ЖЕ ЕЖ ЗЕ ЕЗ ЕД ДЕ'
print('1 2 3 4 5 6 7 8')
for p in permutations('АБВГДЕЖЗ'):
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
        print(''.join(p))
'''
# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# ФИПИ = [1, 2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ = []
# на следующем уроке:
