# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# todo Разобраться через ods
'''
cnt = 0
for s in open('files/9.csv'):
    print(s)
    M = [int(x) for x in s.split(';')]
    copied = [x for x in M if M.count(x) == 2]
    if len(copied) == 4:
        print(M, sum(set(M)))
        cnt += 1
print(cnt)
'''

'''
pixels = 2560 * 1440
V_200 = 1 * 2 ** 33
V_1 = V_200 / 200
i = V_1 / pixels
print(i)  # 11.650844 -> i = 11
print(2**11)
'''

'''
s = open('files/24.txt').readline()
print(len(s))
print(s.count('FSRQ'))

from ipaddress import *
net = ip_network('218.194.82.148/255.255.255.192', 0)
for ip in net:
    print(ip)
'''

# 19254
'''
s = open('files/24.txt').readline()
s = s.split('FSRQ')
maxi = 0
for i in range(len(s)-80):
    r = 'SRQ' + 'FSRQ'.join(s[i:i+81]) + 'FSR'
    maxi = max(maxi, len(r))
print(maxi)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [8, 14, 15]
# на следующем уроке:

# Первый пробник 21.12.24:
# 24/25 -> 88 вторичных баллов +[1, 3-25] -[2]

