# region Домашка: ******************************************************************

'''
from functools import *
import sys
sys.setrecursionlimit(200000)

@lru_cache(None)
def f(n):
    if n > 10000:
        return n - 10000
    if 1 <= n <= 10000:
        return f(n + 1) + f(n + 2)


for i in range(12000, 1, -1):
    f(i)

print(f(12345) * (f(10) - f(12)) // f(11) + f(10101))


# (f(10) - f(12)) // f(11)
# (f(11) + F(12) - f(12)) // f(11)
# (f(11) + 0) // f(11)
# f(11) // f(11)
# 1
print(f(12345) * 1 + f(10101))
'''


#
# № 18140 (Уровень: Базовый)
'''
def F(x, y, A):
    return (x - y >= 39) or (y <= x) or (y >= A - 20)

for A in range(1, 1000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        print(A)
'''


#
# № 18266 (Уровень: Базовый)
'''
def F(x, A):
    return (x & 57 == 0) or ((x & 23 == 0) <= (x & A != 0))


for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


#
# № 18595 (Уровень: Базовый)
'''
def F(x, a1, a2):
    C = 48 <= x <= 94
    J = 83 <= x <= 100
    A = a1 <= x <= a2
    return (not(C or J)) <= (not A)


R = []
M = [x / 4 for x in range(40 * 4, 120 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(max(R))
'''
'''
def f(x, a1, a2):
    p = 15 <= x <= 40
    q = 21 <= x <= 63
    a = a1 <= x <= a2
    return p <= ((q and (not a)) <= (not p))


R = []
N = [x / 4 for x in range(10 * 4, 70 * 4)]
for a1 in N:
    for a2 in N:
        if all(f(x, a1, a2) for x in N):
            R.append(a2 - a1)
print(min(R))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: ********************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 14, 15, 16, 22, 23]
# на следующем уроке: 17, 9, 24


# Первый пробник 21.12.24:
# Александр 19/25 -> 75 вторичных баллов +[1-5, 7, 9-10, 12, 14-16, 18-22, 24, 25] -[6, 8, 11, 13, 17, 23]
# Саша
