# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 19751 (Уровень: Сложный)

from re import *
s = open('0. files/24.txt').readline()
num = r'([1-9]+)'
reg = rf'A{num}([+]{num})*'

m = [x.group() for x in finditer(reg, s)]
maxi = 0
for x in m:
    print(x)
    maxi = max(maxi, eval(x[1:]))
print(maxi)

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [8, 14, 15, 23]
# на следующем уроке:

# Первый пробник 21.12.24:
# 24/25 -> 88 вторичных баллов +[1, 3-25] -[2]

# Второй пробник 10.02.25:
# 23/25 -> 86 вторичных баллов +[1-9, 11-23, 25] -[10, 24]
