# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 21404
'''
R = []
for n in range(0, 1000):
    s = f'{n:b}'
    if s.count('1') % 2 == 0:
        s = '10' + s[2:] + '0'
    else:
        s = '11' + s[2:] + '1'
    r = int(s, 2)
    if r > 480:
        R.append(n)
print(min(R))
'''


# 21411
'''
R = []
for n in range(4, 1000):
    s = '3' + '1' * n
    while '31' in s or '211' in s or '1111' in s:
        if '31' in s:
            s = s.replace('31', '1', 1)
        if '211' in s:
            s = s.replace('211', '13', 1)
        if '1111' in s:
            s = s.replace('1111', '2', 1)
    summa = sum([int(x) for x in s])
    if summa == 15:
        R.append(n)
print(min(R))
'''


# 21422
'''
def div(x):
    divi = []
    for i in range(2, int(x ** 0.5) + 1):
        if x % i == 0:
            divi += [i, x // i]
    return sorted(set(divi))

print(div(24))

cnt = 0
for s in range(1125000, 10 ** 9):
    d = [i for i in div(s) if i % 10 == 7 and i != 7]
    if len(d) > 0:
        R = min(d)
        if R % 10 == 7 and R != 7:
            print(s, R)
            cnt += 1
            if cnt == 5:
                break
'''

'''
R=[]
for n in range(1,1000):
    s=f'{n:b}'
    if n%3==0:
        s=s+s[-3:]
    else:
        dei=(n%3)*3
        s=s+f'{dei:b}'
    r=int(s,2)
    if r>=76:
        R.append(n)
print(min(R))
'''


ster=2
chat=64*1000
bit=24
m=220 * 2**23
t= m / (ster*chat*bit)
print(t/60)


# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: ********************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = [5, 9, 14, 15, 16, 17, 22, 23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Александр 19/25 -> 75 вторичных баллов +[1-5, 7, 9-10, 12, 14-16, 18-22, 24, 25] -[6, 8, 11, 13, 17, 23]

# Второй пробник 28.02.25:
# Александр 24/25 -> 88 вторичных баллов +[1-10, 12-25] -[11]
# Саша 10/25 -> 51 вторичных баллов +[1, 2, 4, 12, 14-16, 19, 23, 25] -[3, 5, 6-10, 11, 13, 17, 18, 20-22, 24]
