# region Домашка: ************************************************************


# endregion Домашка: *********************************************************
# #
# #
# region Урок: ************************************************************

# № 21420 Досрочная волна 2024 (Уровень: Базовый)
'''
def F(a, b):
    if a >= b or a == 35:
        return a == b
    return F(a+1, b) + F(a+2, b) + F(a*2, b)

print(F(7, 13) * F(13, 15) * F(15, 51))
'''


# № 21422 Досрочная волна 2025 (Уровень: Базовый)

def divisors(x):
    div = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            div += [j, x // j]
    return sorted(set(div))


cnt = 0
for x in range(1_125_000+1, 10**10):
    # оканчивающийся на цифру 7 и не равный ни самому числу, ни числу 7
    d = [j for j in divisors(x) if j != x and j != 7 and j % 10 == 7]
    if len(d) > 0:
        print(x, min(d))
        cnt += 1
        if cnt == 5:
            break


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = [5, 8]
# на следующем уроке:

# Второй пробник 10.02.25:
# 7/29 -> 42 вторичных баллов +[1, 4, 6, 12, 14, 15, 16] -[3, 5, 8, 23, 25]
