# region Домашка: ************************************************************

# № 6779 (Уровень: Базовый)
'''
R = []
for n in range(1, 10000):
    s = bin(n)[2:]
    if s.count('1') % 2 == 0:
        s = s + '0'
        s = '101' + s[3:]
        # s = '101' + s[3:] + '0'
    else:
        s = s + '11'
        s = '10' + s[2:]
        # s = '10' + s[2:] + '11'
    r = int(s, 2)
    if r > 68:
        R.append(n)
print(min(R))
'''


# № 6588 Пробник ИМЦ СПб (Уровень: Средний)
'''
R = []
for n in range(1, 256):
    s = bin(n)[2:]
    s = s.replace('0', '*')
    s = s.replace('1', '0')
    s = s.replace('*', '1')
    s = '1' + s
    if s.count('1') % 2 != 0:
        s = s + '1'
    else:
        s = s + '0'
    r = int(s, 2)
    if r > 180:
        R.append(n)

print(min(R))
'''

# endregion Домашка: *********************************************************
#
# #
# region Урок: ************************************************************


# Тип 14 №35472
# Значение выражения 729**7 + 3**16 - 18 записали в системе счисления с основанием 9.
# Сколько раз в этой записи встречается цифра 0?
'''
n = 729**7 + 3**16 - 18
b = 9
M = []
while n > 0:
    M.append(n % b)
    n //= b  # n = n // b
M.reverse()
print(M.count(0))
'''


# № 17869 Демоверсия 2025 (Уровень: Базовый)
'''
n = 3 * 3125**8 + 2 * 625**7 - 4 * 625**6 + 3*125**5 - 2*25**4 - 2025
b = 25
M = []
while n > 0:
    M.append(n % b)
    n //= b
M.reverse()
print(M.count(0))
'''


# № 17870 Демоверсия 2025 (Уровень: Базовый)
'''
for x in range(2030+1):
    n = 7**170 + 7**100 - x
    b = 7
    M = []
    while n > 0:
        M.append(n % b)
        n //= b
    M.reverse()
    if M.count(0) == 71:
        print(x)
'''
# Определите наибольшее значение x: 2029


# № 16380 ЕГКР 27.04.24 (Уровень: Базовый)
'''
n = 4 * 3125**2019 + 3*625**2020 - 2 * 125**2021 + 25**2022 - 4 * 5**2023 - 2024
b = 25
M = []
while n > 0:
    M.append(n % b)
    n //= b
M.reverse()
print(len([x for x in M if x > 10]))
'''


# № 17868 Демоверсия 2025 (Уровень: Базовый)
'''
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:19]:
    A = int(f'98897{x}21', 19)
    B = int(f'2{x}923', 19)
    if (A + B) % 18 == 0:
        print((A + B) // 18)
'''


# Тип 14 №48387

alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:11]:
    for y in alphabet[:11]:
        A = int(f'{x}341{y}', 11)
        B = int(f'56{x}1{y}', 19)
        if (A + B) % 305 == 0:
            print((A + B) // 305)


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# ФИПИ = [2, 5, 6, 14]
# КЕГЭ = []
# на следующем уроке:
