# region Домашка: ************************************************************


# endregion Домашка: *********************************************************
# #
# #
# region Урок: ************************************************************

'''
sym = 119
byte = (23 * 1024 * 1024) / 125_300  # 192.476
byte = 193
bit = byte * 8
print(bit/119)  # 12.97
i = 13   # alp[2**12+1 : 2**13]


print(2**12 + 1)
i = 4  # alp = [9, 10, 11, 12, 13, 14, 15, 16]
print(2**3+1)
'''


'''
from ipaddress import *
net = ip_network('11.92.135.56/255.224.0.0', 0)
for ip in net:
    print(ip)

'''


'''
R = []
for x in range(1, 3000+1):
    n = 4**210 + 4**110 - x
    M = []
    while n > 0:
        M.append(n % 4)
        n //= 4
    M.reverse()
    R.append([M.count(0), x])
    if M.count(0) == 105:
        print(x)
print(max(R))
'''


from fnmatch import *
for x in range(0, 1010, 7993):
    if fnmatch(str(x), '4*4736*1'):
        print(x, x // 7793)


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = [5, 8]
# на следующем уроке: сложные 11 и 7 номера


# Второй пробник 10.02.25:
# 7/29 -> 42 вторичных баллов +[1, 4, 6, 12, 14, 15, 16] -[3, 5, 8, 23, 25]
