# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# В начальный момент Черепаха находится в начале координат, её голова направлена
# вдоль положительного направления оси ординат, хвост опущен.

# Черепахе был дан для исполнения следующий алгоритм:
# Повтори 4 [Вперёд 12 Направо 90]
# Повтори 3 [Вперёд 12 Направо 120].
'''
import turtle as t  # переименовали библиотеку на t
t.screensize(-10000, 10000)
t.tracer(0)
t.left(90)
l = 50

# Тут пишем псевдокод
for i in range(4):
    t.forward(12 * l)
    t.right(90)

for i in range(3):
    t.fd(12 * l)
    t.rt(120)

t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x*l, y*l)
        t.dot(2, 'red')

t.done()
'''


# Черепахе был дан для исполнения следующий алгоритм:
# Повтори 2 [Вперёд 10 Направо 90 Вперёд 18 Направо 90]
# Поднять хвост
# Вперёд 5 Направо 90 Вперёд 7 Налево 90
# Опустить хвост
# Повтори 2 [Вперёд 10 Направо 90 Вперёд 7 Направо 90].
'''
import turtle as t
t.screensize(-10000, 10000)
t.tracer(0)
t.left(90)
l = 20

# Тут пишем псевдокод
for i in range(2):
    t.fd(10 * l)
    t.rt(90)
    t.fd(18 * l)
    t.rt(90)
t.up()
t.fd(5 * l)
t.rt(90)
t.fd(7 * l)
t.lt(90)
t.down()
for i in range(2):
    t.fd(10 * l)
    t.rt(90)
    t.fd(7 * l)
    t.rt(90)


t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x*l, y*l)
        t.dot(2, 'red')

t.done()
'''

# Чертёжнику был дан для исполнения алгоритм:
#
# Повтори 10 [
#   Сместиться на (60, 156)
#   Сместиться на (140, -153)
#   Сместиться в (71, 80)
#   Сместиться на (-111, 77)
# ]


import turtle as t
t.screensize(-10000, 10000)
t.tracer(0)
t.left(90)
l = 20

x, y = 0, 0
for i in range(10):
    x += 60
    y += 156
    t.goto(x * l, y * l)

    x += 140
    y += -153
    t.goto(x * l, y * l)

    x += 71
    y += 80
    t.goto(x * l, y * l)

    x += -111
    y += 77
    t.goto(x * l, y * l)

t.up()
for a in range(-50, 50):
    for b in range(-50, 50):
        t.goto(a*l, b*l)
        t.dot(2, 'red')

t.update()
t.done()
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 14]
# КЕГЭ  = []
# на следующем уроке:
