# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 15 №33485
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ДЕЛ(120, A) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 18) → ¬ДЕЛ(x, 24)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
# Вариант 1
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


R = []
for A in range(1, 10000):
    flag = True
    for x in range(1, 10000):
        if not F(x, A):
            flag = False
            break
    if flag:
        R.append(A)

print(max(R))


# Вариант 2
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


R = []
for A in range(1, 10000):
    k = 0
    for x in range(1, 10000):
        if F(x, A):
            k += 1
    if k == 9999:
        R.append(A)

print(max(R))
'''

# Вариант 3
'''
def F(x, A):
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))

R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))


# Вариант 4

print(max([A for A in range(1, 10000) if all(((120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))) for x in range(1, 10000))]))
'''


# Тип 15 №14277
# На числовой прямой даны два отрезка: P=[17, 40] и Q=[20, 57].
# Отрезок A таков, что приведённая ниже формула истинна при любом значении переменной х:
# ¬(x ∈ A) →(((x ∈ P) ⋀ (x ∈ Q)) → (x ∈ A))
# Какова наименьшая возможная длина отрезка A?

def F(a1, a2, x):
    P = 17 <= x <= 40
    Q = 20 <= x <= 57
    A = a1 <= x <= a2
    return (not A) <= ((P and Q) <= A)


R = []
M = [x / 4 for x in range(10 * 4, 60 * 4)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(a1, a2, x) for x in M):
            R.append(a2 - a1)
print(min(R))  # 20.0 -> 20


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:

