# region Домашка: ******************************************************************
from zoneinfo import reset_tzpath


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21716 ЕГКР 19.04.25 (Уровень: Базовый)
# A. Прибавь 3
# B. Прибавь 7
# C. Умножь на 3
# Сколько существует таких программ, которые исходное число 12 преобразуют в 89,
# и при этом траектория вычислений программы содержит числа 40 и 72 и не содержит 56?
'''
def F(a, b):
    if a >= b or a == 56:
        return a == b
    return F(a+3, b) + F(a+7, b) + F(a*3, b)

print(F(12, 40) * F(40, 72) * F(72, 89))


def F(a, b):
    if a >= b or a == 56:
        return a == b
    h = [F(a+3, b), F(a+7, b), F(a*3, b)]
    return sum(h)

print(F(12, 40) * F(40, 72) * F(72, 89))
'''


# № 19784 (Уровень: Базовый)
'''
def F(a, b):
    if a <= b or a == 28:
        return a == b
    h = [F(a-2, b)]
    if a % 2 == 0:
        h += [F(a / 2, b)]
    else:
        h += [F(a - 3, b)]
    return sum(h)

print(F(98, 1))


def F(a, b):
    if a <= b or a == 28:
        return a == b
    summa = 0
    summa += F(a - 2, b)
    if a % 2 == 0:
        summa += F(a / 2, b)
    else:
        summa += F(a - 3, b)
    return summa

print(F(98, 1))
'''


# № 18267 (Уровень: Средний)
# А. Прибавить 2
# В. Прибавить 5
# С. Возвести в квадрат
# Сколько существует программ, для которых при исходном числе 4 результатом
# является число 36, при этом последняя в них команда — не C?
'''
def F(a, b, c):
    if a >= b:
        return a == b and c[-1] != 'C'
    return F(a+2, b, c+'A') + F(a+5, b, c+'B') + F(a**2, b, c+'C')


print(F(4, 36, ''))
'''
'''
def f(a,b,c):
    if a<=b:
        return a==b and c not in 'AA' and c not in 'BB' and c not in 'CC'
    p=[f(a-2,b,c+'A')]
    if a%2==0:
        p+=[f(a/2,b,c+'B')]
    else:
        p+=[f(a-7,b,c+'C')]
    return sum(p)
print(f(40, 1, ''))
'''


def f(a, b, c):
    if a > b + 1 or 'AA' in c:
        return 0
    if a == b:
        return 1
    return f(a - 1, b, c + 'A') + f(a * 2, b, c + 'B') + f(a * 3, b, c + 'C')


print(f(3, 15, ''))

# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: ********************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = [5, 9, 14, 15, 16, 17, 22, 23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Александр 19/25 -> 75 вторичных баллов +[1-5, 7, 9-10, 12, 14-16, 18-22, 24, 25] -[6, 8, 11, 13, 17, 23]

# Второй пробник 28.02.25:
# Александр 24/25 -> 88 вторичных баллов +[1-10, 12-25] -[11]
# Саша 10/25 -> 51 вторичных баллов +[1, 2, 4, 12, 14-16, 19, 23, 25] -[3, 5, 6-10, 11, 13, 17, 18, 20-22, 24]
