# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 21412 Досрочная волна 2025 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('143.168.72.213/255.255.255.240', 0)
for ip in net:
    print(ip)

# 143.168.72.222
# 14316872222
'''


# № 20909 Апробация 05.03.25 (Уровень: Средний)
'''
s = open('0. files/24.txt').readline()
s = s.split('AB')
maxi = 0
for i in range(len(s)-100):
    r = 'B' + 'AB'.join(s[i:i+101]) + 'A'
    maxi = max(maxi, len(r))
print(maxi)
'''



'''
s=open('0. files/24.txt').readline()
s=s.split('WWF')
maxi=0
for i in range(len(s)-120):
    e='WF'+'WWF'.join(s[i:i+121])+'FW'
    e = e.replace('WSFWW', 'WSFW SFWW').split()
    for x in e:
        maxi=max(maxi,len(x))
print(maxi)
'''

# https://education.yandex.ru/ege/task/0f1bb8de-fe34-40c1-a82e-8d012e8519dc
'''
cnt=0
for s in open('0. files/9.csv'):
    M=sorted([int(x)for x in s.split(';')])
    if (M[-1]+M[0])**2>(M[1]**2+M[2]**2+M[3]**2):
        cnt+=1
print(cnt)
'''


cnt=0
for s in open('0. files/9.csv'):
    M=sorted([int(x)for x in s.split(';')])
    povt=[x for x in M if M.count(x)==3]
    nepov=[x for x in M if M.count(x)==1]
    if len(povt) == 3 and len(nepov) == 3:
        if ((povt[0]**2)*3 > nepov[0]**2 + nepov[1]**2 + nepov[2]**2):
            cnt+=1
print(cnt)


# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: ********************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = [5, 9, 14, 15, 16, 17, 22, 23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Александр 19/25 -> 75 вторичных баллов +[1-5, 7, 9-10, 12, 14-16, 18-22, 24, 25] -[6, 8, 11, 13, 17, 23]

# Второй пробник 28.02.25:
# Александр 24/25 -> 88 вторичных баллов +[1-10, 12-25] -[11]
# Саша 10/25 -> 51 вторичных баллов +[1, 2, 4, 12, 14-16, 19, 23, 25] -[3, 5, 6-10, 11, 13, 17, 18, 20-22, 24]
