# region Домашка: ******************************************************************
from zoneinfo import reset_tzpath


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 11953 (Уровень: Средний)
# Сколько существует программ, для которых при исходном
# числе 2 результатом является число 680, при этом
# траектория вычислений содержит число 68 и
# не содержит числа 100?
'''
from functools import *
@lru_cache(None)
def F(a, b):
    if a >= b or a == 100:
        return a == b
    summa = 0
    if (a%10) != 0:
        summa += F(a + (a % 10), b)
    if (a % 68) != 0:
        summa += F(a + (a % 68), b)
    if a**2 != 0:
        summa += F(a**2, b)
    return summa

print(F(2, 68) * F(68, 680))
'''

# № 4500 (Уровень: Сложный)
'''
from functools import *
@lru_cache(None)
def f(a, b, c):
    if a >= b or a == 23:
        return a == b and 'AA' not in c
    return f(a + 1, b, c + 'A') + f(a + 2, b, c + 'B') + f(a * 2, b, c + 'C')


# print(f(3, 11, ''))
print(f(11, 79, ''))
'''

# № 16335 Открытый вариант 2024 (Уровень: Базовый)
'''
file = open('0. files/26.txt')
N = file.readline()
M = sorted([int(x) for x in file])[::-1]

flag = M[0]
A = [flag]
for x in M:
    if flag - x >= 4:
        A.append(x)
        flag = x
print(len(A))
print(min(A))
'''
# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: ********************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = [5, 9, 14, 15, 16, 17, 22, 23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Александр 19/25 -> 75 вторичных баллов +[1-5, 7, 9-10, 12, 14-16, 18-22, 24, 25] -[6, 8, 11, 13, 17, 23]

# Второй пробник 28.02.25:
# Александр 24/25 -> 88 вторичных баллов +[1-10, 12-25] -[11]
# Саша 10/25 -> 51 вторичных баллов +[1, 2, 4, 12, 14-16, 19, 23, 25] -[3, 5, 6-10, 11, 13, 17, 18, 20-22, 24]
