# region Домашка: ******************************************************************

# № 6884 OpenFIPI (Уровень: Базовый)
'''
R = []
for n in range(1, 10000):
    b = bin(n)[2:]
    if n % 2 == 0:
        b = '1' + b + '0'
    else:
        b = '11' + b + '11'
    r = int(b, 2)
    if r > 225:
        R.append(r)
print(min(R))
'''


# № 6903 (Уровень: Базовый)
'''
R = []
for n in range(1, 10000):
    b = bin(n)[2:]
    for i in range(2):
        if b.count('1') % 2 == 0:
            b = '11' + b[2:] + '00'
        else:
            b = '10' + b[2:] + '11'
    r = int(b, 2)
    if n < 100:
        R += [r]
print(max(R))
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
def F(x, A):
    return (x & A != 0) <= ((x & 698 == 0) <= (x & 321 != 0))

for A in range(1, 2000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''
# Ответ: 1019


# Адрес сети = Узел сети & Маска сети

# № 21412 Досрочная волна 2025 (Уровень: Базовый)
# Сеть задана IP-адресом одного из входящих в неё
# узлов 143.168.72.213 и сетевой маской 255.255.255.240.

# Определите наибольший IP-адрес данной сети, который может быть присвоен компьютеру.
# В ответе укажите найденный IP-адрес без разделителей.
'''
from ipaddress import *
net = ip_network('143.168.72.213/255.255.255.240', 0)
for ip in net:
    print(ip)
'''
# 143.168.72.222 -> 14316872222


# № 20902 Апробация 05.03.25 (Уровень: Базовый)
# Сеть задана IP-адресом 172.16.80.0 и маской сети 255.255.248.0.
#
# Сколько в этой сети IP-адресов, для которых количество
# единиц в двоичной записи IP-адреса не кратно 2?
'''
from ipaddress import *
net = ip_network('72.16.80.0/255.255.248.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 2 != 0:
        cnt += 1
print(cnt)
'''


# № 18928 Новогодний вариант 2025 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('192.168.248.176/255.255.255.240', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') == b.count('0'):
        cnt += 1
print(cnt)
'''


print(bin(240)[2:])

# 255.255.255.240
# 11111111.11111111.11111111.11110000

# № 18159 (Уровень: Базовый)
# Для узла с IP-адресом 205.154.212.20 адрес сети равен 205.154.192.0.
# Чему равно наибольшее возможное значение третьего слева байта маски?
# Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'205.154.212.20/{mask}', 0)
    if '205.154.192.0' in str(net):
        print(net, mask, net.netmask)
        # 205.154.192.0/18 18 255.255.192.0
        # 205.154.192.0/19 19 255.255.224.0
'''


#
# № 14359 (Уровень: Базовый)
# Два узла, находящиеся в разных подсетях, имеют
# IP-адреса 157.127.172.56 и 157.127.191.78.
# Известно, что в масках обеих подсетей содержится одинаковое количество единиц.
# Определите наименьшее возможное количество единиц в масках этих подсетей.
'''
from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'157.127.172.56/{mask}', 0)
    net2 = ip_network(f'157.127.191.78/{mask}', 0)
    if net1 != net2:
        print(mask, 32-mask)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 11, 13, 15, 16, 23, 19-21]
# КЕГЭ  = []
# на следующем уроке: 7, 8, 9, 25

# Первый пробник 21.12.24:
# Анастасия 9/29 -> 48 вторичных баллов +[1, 2, 4, 12, 16, 14, 15, 23, 20-21] -[3, 8, 10, 11, 18, 19]
