# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 3691 (Уровень: Базовый)
'''
k = 0
for x in range(320_400+1, 10**10):
    if all(x % y == 0 for y in [10, 12, 14, 16, 18]):  #  1?
        print(x, x // 18)
        k += 1
        if k == 5:
            break
'''


# № 3901 (Уровень: Базовый) 🌶
'''
from fnmatch import *
k = 0
for x in range(13, 10**10, 13):
    if x > 700_011:
        if not fnmatch(str(x), '*0??3*'):
            if not fnmatch(str(x), '*4??2'):
                if not fnmatch(str(x), '*1*'):
                    print(x, sum(map(int, str(x))))
                    k += 1
                    if k == 5:
                        break
'''


# № 2588 (Уровень: Базовый)
'''
def divisors(x):
    div = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


for x in range(190201, 190260+1):
    d = [j for j in divisors(x) if j % 2 == 0]
    if len(d) == 4:
        print(d[-1], d[-2])
'''

# № 7897 (Уровень: Базовый) 🌶
'''
from fnmatch import *

R = []
for x in range(11071, 10 ** 10, 11071):
    if fnmatch(str(x), '?136*1'):
        if str(x)[0] in '13579' and str(x)[-2] in '02468':
            R.append([x, x // 11071])

print(*R[-5])
print(*R[-4])
print(*R[-3])
print(*R[-2])
print(*R[-1])
'''


'''
from re import *

R = []
for x in range(11071, 10 ** 10, 11071):
    if fullmatch('[13579]136[0-9]*[02468]1', str(x)):
        R.append([x, x // 11071])

print(*R[-5])
print(*R[-4])
print(*R[-3])
print(*R[-2])
print(*R[-1])
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 11, 13, 15, 16, 23, 19-21]
# КЕГЭ  = []
# на следующем уроке: 7, 8, 9, 25

# Первый пробник 21.12.24:
# Анастасия 9/29 -> 48 вторичных баллов +[1, 2, 4, 12, 16, 14, 15, 23, 20-21] -[3, 8, 10, 11, 18, 19]


# Второй пробник 21.05.25:
# Анастасия 16/29 -> 67 вторичных баллов
# +[1, 2, 4, 6, 10, 13, 14, 15, 16, 18, 19-21, 22, 23, 23] -[3, 5, 7, 8, 9, 11, 17]
