# region Домашка: ******************************************************************

# № 6884 OpenFIPI (Уровень: Базовый)
'''
R = []
for n in range(1, 10000):
    b = bin(n)[2:]
    if n % 2 == 0:
        b = '1' + b + '0'
    else:
        b = '11' + b + '11'
    r = int(b, 2)
    if r > 225:
        R.append(r)
print(min(R))
'''


# № 6903 (Уровень: Базовый)
'''
R = []
for n in range(1, 10000):
    b = bin(n)[2:]
    for i in range(2):
        if b.count('1') % 2 == 0:
            b = '11' + b[2:] + '00'
        else:
            b = '10' + b[2:] + '11'
    r = int(b, 2)
    if n < 100:
        R += [r]
print(max(R))
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# https://education.yandex.ru/ege/task/8cdef5ec-7247-4ed7-aa24-502481f2a4c8
'''
# from math import ceil
sym = 163
alp = 1510  # alp = 2 ** i
i = 11  # 2**11 >= 1510, i - это кол-во бит на один символ
bit = sym * i  # бит на один пароль

print(bit / 8)  # 224.125
byte = 225
# byte = ceil(bit / 8)

print((65536 * byte) / 2**10)  
'''


# Единицы измерения информации
# 1 бит - минимальная единица измерения
# 1 байт = 8 бит = 2**3 бит
# 1 Кбайт = 1024 байт = 2**10 байт = 2**13 бит
# 1 Мбайт = 1024 Кбайт = 2**20 байт = 2**23 бит
# 1 Гбайт = 1024 Мбайт = 2**30 байт = 2**33 бит

# https://education.yandex.ru/ege/task/a4132687-04dc-4ed6-85e0-76ebd94d668a

sym = 197
# alp - ?
# i - ?
# bit = sym * i
# i = bit / sym

# Округляем вверх - Отведено более 25 Мбайт
# Округляем вниз - Отведено не более 25 Мбайт
# Округляем вниз - Отведено 25 Мбайт

byte = 25 * 2**20 / 178_080  # байт выделено на один серийный номер
print(byte)  # 147.205 -> 148
byte = 148
bit = byte * 8
i = bit / sym
print(i)  # 6.0101 -> 7

# Минимальная мощность алфавита при i = 7 равна 65 (2**6+1)
# i = 7 - alp = 2 ** i = 128 - максимальная мощность алфавита при i = 7
# alp = 129 - i = 8 - минимальная мощность алфавита при i = 8

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 11, 15, 16, 23, 19-21]
# КЕГЭ  = []
# на следующем уроке: 7, 8, 9, 13, 25

# Первый пробник 21.12.24:
# Анастасия 9/29 -> 48 вторичных баллов +[1, 2, 4, 12, 16, 14, 15, 23, 20-21] -[3, 8, 10, 11, 18, 19]
