# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
x = 5  # пременная - это способ быстрого доступа к данным через какое-то имя переменной

# Типы данных переменных

a = 5  # int (integer) - целочисленные значения
print(type(a))  # <class 'int'>

b = 5.0  # float (число с плавающей точкой) - вещественное значение
print(7 / 2)  # 3.5

c = '5'  # str (string) - строковый тип данных, хранит в себе символы, слова, и тд
print(a * 4, c * 4)  # 20 5555
print('Hello' * 4)  # HelloHelloHelloHello

d1 = True  # bool (Boolean) - Булева алгебра (Математическая логика)
d0 = False

print(4 > 10)  # False

n = int(input('ВЕДИТЕ ЧИСЛО N: '))
if n % 2 == 0:
    print('Четное')
else:
    print('Нечетное')
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
