# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

'''
A = [1, 2, 3]
A[0] = 5
print(A)  # [5, 2, 3]
print(type(A))  # <class 'list'>

B = (1, 2, 3)
print(type(B))  # <class 'tuple'>
# В кортеже нельзя изменять элементы списка
'''
from runpy import run_path

'''
R = []
for x in [2, 3, 123, 124,21,412,321,321,3,12,4,324]:
    R.append(x)
print(R)  # [324]
print(min(R), max(R))
'''

'''
s = '1000'
print(int(s))  # 1000 - целое число
print(int(s, 2))  # 8 - перевод из 2-ой системы в 10-ю
print(int(s, 16))  # 4096 - перевод из 16-ой системы в 10-ю
'''


'''
R = []
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alphabet[:15])  # ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F']
for x in alphabet[:15]:
    a = int(f'97531{x}19', 15) + int(f'3{x}519', 15)
    if a % 11 == 0:  # число a делится на 11 / a кратно 11
        R.append(a // 11)
print(min(R))


alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:15]:
    a = int(f'97531{x}19', 15) + int(f'3{x}519', 15)
    if a % 11 == 0:
        print(a // 11)
 
        # 147416793
        # 147420393
'''

'''
M = [1, 1, 2, '1', 3, 4, 5]
print(M.count(1))  # 2
print(M.count('1'))  # 1

s = '1121345'
print(s.count('1'))  # 3

r = 1121345
'''


for n in range(4, 100):  # [4, 100)
    pass

# № 20486 (Уровень: Базовый)
'''
R = []
for n in range(4, 10000):
    b = bin(n)[2:]
    if n % 2 == 0:
        b = b + b[:3]  # b[-3:]
    else:
        b = '1' + b + '01'
    r = int(b, 2)  # перевод из 2-й в 10-ю
    if r > 600:
        R.append(r)
print(min(R))
'''

#        i   0123456
b = '101' + '0001111'[3:]
b = '101' + '0001111'

# № 20278 (Уровень: Средний)
'''
R = []
for n in range(1, 10000):
    b = bin(n)[2:]
    if b.count('1') % 2 == 0:
        b = '101' + b[3:] + '01'
    else:
        b = '111' + b[3:] + '10'
    r = int(b, 2)
    if r < 385:
        R.append(n)
print(max(R))
'''

'''
def f(n):
    s = ''
    while n > 0:
        s = str(n % 3) + s
        n //= 3
    return s


R = []
for n in range(10, 10000):
    s = f(n)
    if n % 4 == 0:
        s = s + s[-3:]
    else:
        s = '1' + s + '20'
    r = int(s, 3)
    if r > 423:
        R.append(r)
print(min(R))
'''


# № 19551 (Уровень: Базовый)
'''
def f(n):
    s = ''
    while n > 0:
        s = str(n % 3) + s
        n //= 3
    return s


R = []
for n in range(10, 10000):
    s = f(n)
    s = s.replace('2', '*')  # старые единица заменили
    s = s.replace('0', '2')
    s = s.replace('*', '0')
    r = int(s, 3)
    if abs(r - n) == 378:
        print(n)
        break
'''

# 10011011100101
# s = s.replace('0', '1')
# 11111111111111
# s = s.replace('1', '0')
# 00000000000000


# 10011011100101
# s = s.replace('0', '*')
# 1**11*111**1*1
# s = s.replace('1', '0')
# 0**00*000**0*0
# s = s.replace('*', '1')
# 01100100011010

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 10, 11, 12, 13, 19-21]
# КЕГЭ = []
# на следующем уроке: 5, 22, 13, 17, 9, 10, 18, 19-21


# Первый пробник 7.03.25:
# Арина 12/29 -> 56 вторичных баллов +[1, 2, 3, 4, 5, 8, 9, 11, 12, 14, 15, 23] -[7, 13, 17, 19-21, 18, 25]
