# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# № 16372 ЕГКР 27.04.24 (Уровень: Базовый)
# В начальный момент Черепаха находится в начале координат, её голова
# направлена вдоль положительного направления оси ординат, хвост опущен.
'''
print(28 * 24 + 33 * 27 - 17 * 22)  # 1189


import turtle as t  # Способ подключения библиотеки с коротким именем t
t.screensize(-2000, 2000)  # Для ползунков масштаба
s = 20  # Переменная для масштаба отрисовки
t.down()  # хвост опущен
t.left(90)  # По условию нужно повернуть голову наверх
t.tracer(0)  # Отключаем анимацию отрисовки - мгновенная отрисовка

# Тут пишем псевдокод:
for i in range(2):
    t.forward(23*s)  # Вперед 23
    t.left(90)
    t.backward(27*s)  # Назад 27
    t.left(90)
t.up()  # Поднять хвост
t.backward(5*s)
t.right(90)
t.forward(11*s)
t.left(90)
t.down()
for i in range(2):
    t.fd(26*s)
    t.rt(90)
    t.fd(32*s)
    t.rt(90)

# Тут перебираем точки
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * s, y * s)  # Прыгаем в координату x, y
        t.dot(3, 'red')  # Рисуем точку (толщина, цвет)

t.update()  # Для корректной работы функции t.tracer(0)
t.done()  # Фиксируем окно отрисовки, чтобы оно не закрывалось
'''

'''
import turtle as t
t.screensize(-2000, 2000)
s = 20
t.down()
t.left(90)
t.tracer(0)

# Тут пишем псевдокод:
t.left(180)
for i in range(3):
    t.right(45)
    t.forward(12*s)
    t.right(45)
t.left(315)
t.forward(12*s)
for i in range(2):
    t.right(90)
    t.forward(12*s)


# Тут перебираем точки
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * s, y * s)
        t.dot(3, 'red')

t.update()
t.done()
'''

#
'''
import turtle as t
t.screensize(-2000, 2000)
s = 30
t.down()
t.left(90)
t.tracer(0)

# Тут пишем псевдокод:
t.right(30)
for i in range(3):
    t.right(150)
    t.forward(6*s)
    t.right(30)
    t.forward(12*s)
# Тут перебираем точки
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * s, y * s)
        t.dot(3, 'red')

t.update()
t.done()
'''
# Точки на линии учитывать не следует.


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 10, 11, 12, 13, 16, 18, 19-21]
# КЕГЭ = []
# на следующем уроке: 6, 2, 13, 17, 9


# Первый пробник 7.03.25:
# Арина 12/29 -> 56 вторичных баллов +[1, 2, 3, 4, 5, 8, 9, 11, 12, 14, 15, 23] -[7, 13, 17, 19-21, 18, 25]
