# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# Метод .replace()

# во1 просто так строку изменить нельзя
'''
# i  0  1  2
M = [1, 2, 3]
M[0] = 11
print(M)  # [11, 2, 3]

# i  012
s = '123'
s = '11' + s[1:]
print(s)  # 1123


s = '123'
s = s.replace('1', '11')
print(s)  #  1123
'''
from runpy import run_path

'''
s = '31289732891738192'

s = s.replace('1', '**')  # сразу все '1' заменились на '**'
print(s)  # 3**28973289**738**92

s = s.replace('2', '+', 1)
print(s)  # 3**+8973+89**738**92


print('Привет, я сегодня читал "Война и мир"')

'''


# № 7351 (Уровень: Средний)
# ПОКА нашлось(7777) ИЛИ нашлось(1111)
#   ЕСЛИ нашлось(7777)
#     ТО заменить(7777,1)
#   ИНАЧЕ заменить(1111,7)
'''
cnt = 0
s = '7' * 512
while '7777' in s or '1111' in s:
    if '7777' in s:
        s = s.replace('7777', '1', 1)
        cnt += 1
    else:
        s = s.replace('1111', '7', 1)
        cnt += 1
print(s)  # 77
print(cnt)  # 170
'''


# Сумма цифр строки:
'''
s = '122333444455555'  # 55

# Вариант 1
summa1 = s.count('1') + s.count('2') * 2 + s.count('3') * 3 + s.count('4') * 4 + s.count('5') * 5
print(summa1)

# Вариант 2
s = '122333444455555'
summa2 = 0
for x in s:
    summa2 += int(x)
print(summa2)

# Вариант 3
s = '122333444455555'
summa3 = sum([int(x) for x in s])
print(summa3)

# Вариант 4
s = '122333444455555'
summa4 = sum(map(int, s))
print(summa4)
'''


'''
s = '122333444455555'
M = [int(x) for x in s]
print(M)  # [1, 2, 2, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 5]


s = '122333444455555'
M = [int(x) for x in s if x in '02468']
print(M)  # [2, 2, 4, 4, 4, 4]
'''


# № 7591 Досрочная волна 2023 (Уровень: Базовый)
'''
for n in range(4, 1000):
    s = '3' + '5' * n

    while '25' in s or '355' in s or '555' in s:
        if '25' in s:
            s = s.replace('25', '3', 1)
        if '355' in s:
            s = s.replace('355', '52', 1)
        if '555' in s:
            s = s.replace('555', '23', 1)

    summa = sum(map(int, s))
    if summa == 27:
        print(n)
        break
'''


# переменная - это удобный способ взаимодействия с памятью
# x = 5
# print(x)  # 5
# x += 4
# print(x)  # 9


# Типы данных переменных
'''
a = 5  # int (integer) - целочисленные данные
print(type(a))  # <class 'int'>

b = 5.0  # float (число с плавающей точкой) дроби
print(4 / 2, type(4 / 2))  # 2.0 <class 'float'>

c = '5'  # str (string) - строковый тип данных, в котором хранятся слова, символы, предложения - текст
print(a, c)  # 5 5
print(a * 4, c * 4)  # 20 5555

print('Hello ' * 4)  # Hello Hello Hello Hello

w1 = 'Hello, '
w2 = 'world!'
print(w1 + w2)  # Hello, world!
# Это называется конкатенация строк (склеивание)

d1 = True
d0 = False  # bool (Boolean) - Булевые переменные из Булевой алгебры
# Основы математической логики

# True - 1
# False - 0

print(True + True + True + False)  # 3


print(4 < 10)  # True

n = 4
if n % 2 == 0:
    print('YES')  # YES
else:
    print('NO')
'''


# Типы данных коллекций (последовательностей) - массив
'''
A = [1, 2, 3]  # list (список)
# 1. Может хранить в себе неограниченное кол-во переменных/данных
# 2. Могут хранить в себе различные типа данных
# 3. Каждый элемент списка имеет свой порядковый номер - индекс
# 4. Индексы считаются слева-направо начиная с 0 или справа-налево начиная с - 1
# 5. Элементы списка можно изменять в отличие от строки и кортежа

M = [1, 2, 3]
M[0] = '11'
print(M)  # ['11', 2, 3]

# i   0    1    2    3    4
B = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

print(B[0])  # a - Первый элемент списка
print(B[-1])  # e - Последний элемент списка


M = [3, '4', 5.0, 4 < 10, [1, 2, 3]]
for x in M:
    print(type(x), x)
    # <class 'int'> 3
    # <class 'str'> 4
    # <class 'float'> 5.0
    # <class 'bool'> True
    # <class 'list'> [1, 2, 3]


S = {1, 1, 2, 2, 2, 3}  # set (множество)
# 1. Не могут содержать копии элементов
print(S)  # {1, 2, 3} - копии удалились 

# Множество простых чисел - которое делится только на 1 и на само себя
# P = {2, 3, 5, 7, 11, 13, 17, 19, 23}

# Множество составных чисел - противоположные простым
# C = {4, 6, 8, 9, 10, 12, ...}

# Множество Натуральных - бесконечное
# N = {1, 2, 3, ..., +inf}

# Множество Целых - бесконечное (N лежат внутри Z)
# Z = {-int, ..., -3, -2, -1, 0, 1, 2, 3, ..., +inf}

# N лежат внутри Z

# (Q) Рациональные - это красивые дроби: 1/2, 0/5, 3/4

# (I) Иррациональные - это некрасивые дроби: 3.333(3), pi = 3.14....

# Вещественные/Действительные: N + Z + Q + I
'''



# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 10, 11, 12, 13, 16, 18, 19-21]
# КЕГЭ = []
# на следующем уроке: 2, 13, 17, 9, 5


# Первый пробник 7.03.25:
# Арина 12/29 -> 56 вторичных баллов +[1, 2, 3, 4, 5, 8, 9, 11, 12, 14, 15, 23] -[7, 13, 17, 19-21, 18, 25]
