# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# № 21413 Досрочная волна 2025 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
# print(alp[:2])
# print(alp[:8])
# print(alp[:21])
for x in alp[:21]:
    A = int(f'82934{x}2', 21)
    B = int(f'2924{x}{x}7', 21)
    C = int(f'67564{x}8', 21)
    if (A + B + C) % 20 == 0:
        print(x, (A + B + C) // 20)
'''
# 72450445


# № 12246 ЕГКР 16.12.23 (Уровень: Базовый)
'''
n = 2*729**333 + 2*243**334 - 81**335 + 2*27**336 -2*9**337 - 338
R = []
while n > 0:
    R.append(n % 9)
    n //= 9
R.reverse()
print(R)
print(len(R) - R.count(0))
'''

'''
R = [0, 0, '0', '1', '0', 0, 0]
print(R.count(0))  # 4
print(R.count('0'))  # 2
'''


# № 17555 Основная волна 08.06.24 (Уровень: Базовый)
'''
for x in range(1, 2030):
    n = 7**91 + 7**160 - x
    R = []
    while n > 0:
        R.append(n % 7)
        n //= 7
    R.reverse()
    if R.count(0) == 70:
        print(x)
'''

# № 17527 Основная волна 07.06.24 (Уровень: Базовый)
'''
for x in range(1, 2030):
    n = 3**100 - x
    R = []
    while n > 0:
        R.append(n % 3)
        n //= 3
    R = R[::-1]
    if R.count(0) == 5:
        print(x)
'''


# № 20808 Апробация 05.03.25 (Уровень: Средний)
'''
M = []
for x in range(1, 2030):
    n = 7**170 + 7**100 - x
    R = []
    while n > 0:
        R.append(n % 7)
        n //= 7
    R.reverse()
    if R.count(0) == 73:
        print(x, R.count(0))
    M.append(R.count(0))

print(max(M))
'''

'''
M = []
for x in range(1, 2005):
    n=5**150+5**98-x
    p=[]
    while n>0:
        p.append(n%5)
        n=n//5
    p.reverse()
    M.append(p.count(0))
print(max(M))
'''

'''
for x in '01234567':
    for y in '01234567':
        a=int(f'{y}04{x}5', 11)+int(f'253{x}{y}', 8)
        if a%117==0:
            print(a//117)
'''
# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 22, 16 номера руками


# Первый пробник 7.03.25:
# Арина 12/29 -> 56 вторичных баллов +[1, 2, 3, 4, 5, 8, 9, 11, 12, 14, 15, 23] -[7, 13, 17, 19-21, 18, 25]
