# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Прототипы 13 номера
# 1. Есть узел и маска - надо найти адрес сети и кол-во айпи адресов
# 1.1 Есть узел и маска - надо найти адрес сети и наибольший айпи адрес
# 2. Есть узел и адрес сети - надо найти маску сети
# 3. Есть два узла и надо найти маску сети


# Адрес сети = Узел сети & Маска сети
# for ip in Адрес сети - пробегаем айпи адреса сети
# & - побитовая конъюнкция
'''
print(f'{14:b}')
print(f'{5:b}')

print(14 & 5)  # 4
'''

# байт  1   1   1  1
#      192.168.12.207       0 <= x <= 255
# бит   8   8   8  8 = 32

# Примерная схема работы с библиотекой
'''
from ipaddress import *
Адрес сети = ip_network('Узел/Маска', 0)
for ip in Адрес сети:
'''


# Маска сети имеет длину 32 бита и вид: 1111111....0000
# 255.255.192.0
# 11111111.11111111.11000000.00000000
# mask = 18 (целое число - кол-во единиц)


# Варианты маски сети:
# [Единиц: 0, Нулей: 32] 000000....000
# [Единиц: 1, Нулей: 31] 100000....000
# [Единиц: 2, Нулей: 30] 110000....000
# [Единиц: 3, Нулей: 29] 111000....000
# [Единиц: 4, Нулей: 28] 111100....000
# [Единиц: 5, Нулей: 27] 111110....000
# ....
# [Единиц: 31, Нулей: 1] 111111....110
# [Единиц: 32, Нулей: 0] 111111....111

# for mask in range(0, 32+1):
#     print(mask)


# № 16324 Открытый вариант 2024 (Уровень: Базовый)
# Сеть задана IP-адресом 122.159.136.144
# и сетевой маской 255.255.255.248.
# Сколько в этой сети IP-адресов, для которых
# количество единиц в двоичной записи IP-адреса кратно 4?
'''
from ipaddress import *
net = ip_network('122.159.136.144/255.255.255.248', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 4 != 0:
        cnt += 1
print(cnt)

print(net.num_addresses)
'''


# № 10579 (Уровень: Средний)
'''
from ipaddress import *
net = ip_network('192.168.240.0/255.255.255.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') == s.count('0'):
        cnt += 1
print(cnt)
'''


# № 11662 (Уровень: Базовый)
# Сеть задана IP-адресом 123.222.111.192
# и маской сети 255.255.255.248.
# Сколько в этой сети IP-адресов, для которых
# сумма единиц в двоичной записи четвёртого
# байта IP-адреса не делится без остатка на 3?
'''
from ipaddress import *
net = ip_network('123.222.111.192/255.255.255.248', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s[24:].count('1') % 3 != 0:
        cnt += 1
print(cnt)
'''
'''
print(s)
print(s[:8], s[8:16], s[16:24], s[24:])
# 01111011110111100110111111000111
# 01111011 11011110 01101111 11000111
'''




# № 21412 Досрочная волна 2025 (Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут
# быть использованы для адресации сетевых устройств.

# Сеть задана IP-адресом одного из входящих в
# неё узлов 143.168.72.213 и сетевой маской 255.255.255.240.
# Определите наибольший IP-адрес данной сети,
# который может быть присвоен компьютеру.
# В ответе укажите найденный IP-адрес без разделителей.
'''
from ipaddress import *
net = ip_network('143.168.72.213/255.255.255.240', 0)
for ip in net:
    print(ip)  # 143.168.72.222 -> 14316872222
'''


# 15326
'''
from ipaddress import *
net = ip_network('105.224.200.224/255.255.255.224', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 4 == 0:
        cnt += 1
print(cnt)
'''


# 17709
'''
from ipaddress import *
net = ip_network('235.53.0.0/255.255.224.0', 0)
s = 0
for ip in net:
    b = f'{ip:b}'
    if (b.count('1') % 5 == 0) and (b[-3:] == '110'):
        s += 1
print(s)
'''


# 14358
'''
from ipaddress import *
net = ip_network('192.168.32.64/255.255.255.192', 0)
s = 0
for ip in net:
    b = f'{ip:b}'
    if b[-3:] == '101':
        s += 1
print(s)
'''


# № 17710 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('214.187.224.0/255.255.224.0')
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 6 != 0:
        if s[-4:] == '1000':
            cnt += 1
print(cnt)
'''



# № 12947 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('0') % 3 == 0:
        if '111' in s and '000' in s:
            cnt += 1
print(cnt)
'''


# № 10150 (Уровень: Базовый)
# Для узла с IP-адресом 145.192.94.230 адрес сети равен 145.192.80.0.
# Чему равен третий слева байт маски?

'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'145.192.94.230/{mask}', 0)
    if '145.192.80.0' in str(net):
        print(net, net.netmask)  # 145.192.80.0/20 255.255.240.0
'''


# № 16260 Джобс 03.05.24 (Уровень: Средний)
# Известно два узла с IP-адресами 123.20.103.136 и 123.20.103.151
# принадлежат разным сетям с одинаковой маской.
# Определите значение 4 байта маски в этих сетях.

from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'123.20.103.136/{mask}', 0)
    net2 = ip_network(f'123.20.103.151/{mask}', 0)
    if net1 != net2:
        print(net1.netmask)
        # 255.255.255.240
        # 255.255.255.248
        # 255.255.255.252
        # 255.255.255.254
        # 255.255.255.255


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 13, 14]
# КЕГЭ  = []
# на следующем уроке:
