# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Способы открытия файла 17.txt
'''
file = open('files/17.txt', mode='r')
M = []
for x in file:
    M.append(int(x))
print(M)
file.close()


with open('files/17.txt', mode='r') as file:
    M = [int(x) for x in file]
    print(M)
# Здесь файл считается закрытым

# Чтение файла для 17 номера
M = [int(x) for x in open('files/17.txt')]
print(M)
'''


# Три типа 17 номеров:
'''
# i  0  1  2  3  4
M = [1, 2, 3, 4, 5]

# 1. Под парой подразумевается два идущих подряд элемента последовательности.
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# IndexError: list index out of range

# 2. Под тройкой подразумевается три идущих подряд элемента последовательности.
# 123 234 345
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]

# 3. Под парой подразумевается два различных элемента последовательности.
# 12 13 14 15
# 23 24 25
# 34 35
# 45
for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]
        print(f'{x}{y}', end=' ')
    print()
'''


# № 25356 ЕГКР 13.12.25 (Уровень: Базовый)
# В которых ни один из трёх элементов не является четырёхзначным числом
# А сумма элементов тройки больше максимального элемента последовательности, оканчивающегося на 30.
'''
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in M if abs(x) % 100 == 30]
R = []
for i in range(len(M) - 2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 0:
        if (x + y + z) > max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''
# 1. Выучить шаблоны для открытия и чтения файла
# 2. Повторить генераторы списков
# 3. Понять принцип работы условий () + () + () == 0/1/2/3


# № 21712 ЕГКР 19.04.25 (Уровень: Базовый)
# Ровно один элемент является четырёхзначным числом и оканчивается на 6
# А сумма элементов тройки не больше минимального положительного элемента последовательности,
# являющегося четырёхзначным числом, которое оканчивается на 6.
'''
M = [int(x) for x in open('files/17.txt')]  # 893748, -20492, 3456, 6546, -5456, -2346, -5, 235, 0
A = [x for x in M if len(str(abs(x))) == 4 and abs(x) % 10 == 6]  # 3456, 6546, -5456, -2346
B = [x for x in A if x > 0]  # 3456, 6546
R = []
for i in range(len(M) - 2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 1:
        if (x + y + z) <= min(B):
            R.append(x + y + z)
print(len(R), max(R))
'''


# № 23201 Основная волна 10.06.25 (Уровень: Базовый)
'''
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 3]
B = [x for x in A if abs(x) % 10 == 7]
R = []
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) % min(B) == 0:
            R.append(x + y)
print(len(R), min(R))
'''


# № 17558 Основная волна 08.06.24 (Уровень: Базовый)
'''
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if abs(x) % 32 == 0]
R = []
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]
    if (x < 0) + (y < 0) >= 1:
        if (x + y) < len(A):
            R.append(x + y)
print(len(R), max(R))
'''


# № 17530 Основная волна 07.06.24 (Уровень: Базовый)

M = [int(x) for x in open('files/17.txt')]
R = []
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]
    if (x % 55 == min(M)) or (y % 55 == min(M)):
        R.append(x + y)
print(len(R), min(R))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 7, 8, 11, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 9, 27
