# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


def dell(n):
    S = []
    for x in range(2, int(n ** 0.5) + 1):
        if n % x == 0:
            S.append(x)
            S.append(n // x)
    return sorted(set(S))

k = 0
for x in range(32500280, 10**10):
    P = [t for t in dell(x) if len(dell(t)) == 0]
    if len(P) > 0:
        S = sum(P)
        if S != 0 and S % 145 == 0:
            print(x, S)
            k += 1
            if k == 7:
                break

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.2, 25, 27]
# КЕГЭ = [11]
# на следующем уроке: 7, 24 номера через замену, 24 номера через замену + split()


# region 📖 Пробник (Вариант 2)

# Студент #Арсений
# Дата: #Пятница #27Февраля2026
# ✅ Верно: 1, 2, 4, 5, 7, 8, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23
# ⛔️ Неверно: 3, 9, 17, 22, 27
# ❔ Без ответа: 6, 24, 25, 26
# Итог: 19/29 первичных балла ~ 75 вторичных

# endregion 📖 Пробник (Вариант 2)

