# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Единицы измерения информации (10101010100110 - биты информации)
# 1 бит - минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# Типы 11 номера:
# 1. sym, alp = byte
# 2. sym, byte = alp
# 3. alp, byte = sym

# https://education.yandex.ru/ege/inf/task/7d47d6e9-3b01-44d0-83dd-2b280b962cef
'''
sym = 15
alp = 10 + 12  # 2**5 >= 22
i = 5  # бит на один символ пароля

bit = sym * i  # бит на один пароль
print(bit / 8)  # 9.375 -> 10
byte = 10

# user = dop + byte
dop = 12

print(40 * (dop + byte))  # 880
'''


# https://education.yandex.ru/ege/inf/task/221f688c-b7dd-4fd8-b384-f8c245b17f14
'''
sym = 23
alp = 12  # 2**4 >= 12
i = 4

bit = sym * i
print(bit / 8)  # 11.5 -> 12
byte = 12

user = 13068 / 297
print(user - byte)
'''


# https://education.yandex.ru/ege/inf/task/a1beb780-b471-41fe-a815-b22e0ec632dc
# Известно, что для хранения 862 серийных номеров отведено не более 276 Кбайт памяти.
'''
# sym - ?
alp = 10 + 52 + 458  # 520  <= 2**10
i = 10

byte = 276 * 2**10 / 862
print(byte)  # 327.870 -> 327

bit = 327 * 8
sym = bit / i
print(sym)  # 261.6 -> 261
'''

# https://education.yandex.ru/ege/inf/task/1d71d4bc-4f2b-4c20-aee2-0ced3ec49f02
# Известно, что для хранения 45 877 серийных номеров требуется более 49 Мбайт памяти.
'''
# sym - ?
alp = 10 + 52 + 500  # 562
i = 10

byte = 49 * 2**20 / 45877
print(byte)  # 1119.95 -> 1120

bit = 1120 * 8
sym = bit / i
print(sym)  # 896.0
'''


# https://education.yandex.ru/ege/inf/task/b7bccef2-d2fe-4064-8fcd-69ea6cd792c2
# Известно, что для хранения 356 984 серийных номеров потребовалось не менее 54 Мбайт памяти.
'''
# alp - ?
sym = 172

byte = 54 * 2**20 / 356_984
print(byte)  # 158.61524 -> 159
bit = 159 * 8

i = bit / sym
print(i)  # 7.395 -> 8

print(f'Определите максимальную возможную мощность алфавита: {2 ** 8}')
print(f'Определите минимально возможную мощность алфавита: {2 ** 7 + 1}')
'''
'''
alp = 256  # i = 8
alp = 250  # i = 8
alp = 130  # i = 8
alp = 129  # i = 8

alp = 128  # i = 7
alp = 65  # i = 7

alp = 64  # i = 6
alp = 33  # i = 6

alp = 32  # i = 5
'''
# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 8, 11, 13, 14, 15, 16, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 7, 17, 9, 27
