# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# 22, 18, 17, 7


# 7 Апробация 04.03.26 вариант 2 (https://disk.yandex.ru/i/olGf9MsK09aN4g)
'''
t = 180
v = 24000
i = 8
y = 2
S = t * v * i * y  # бит

print(S / 48000)  # 1440.0
'''


# 17 Апробация 04.03.26 вариант 2 (https://disk.yandex.ru/i/olGf9MsK09aN4g)
'''
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in A if abs(x) % 100 == 43]
S = []
for i in range(len(M)- 1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) >= 1:
        if (x + y) ** 2 < max(B) ** 2:
            S.append((x + y) ** 2)
print(len(S), max(S))
'''


# F(257487) = (257487 + 4) * F(257482)
# F(257482) = (257482 + 4) * F(257477)
# F(257477) = (257477 + 4) * F(257472)
'''
print((257487 + 4) * (257482 + 4) * (257477 + 4) / 683)
print((257477 + 4) / 67)
print(24994252792782 + 3843)
'''


# 16
'''
from functools import *
@lru_cache(None)
def F(n):
    if n < 10:
        return 3
    return (n + 4) * F(n - 5)
M = [257487, 257477, 257472]
for n in range(1, 260000):
    F(n)

print((F(257487) / 683 + F(257477) / 67) / F(257472))
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.2, 25, 27]
# КЕГЭ = [11]
# на следующем уроке: 7, 24 номера через замену, 24 номера через замену + split()


# region 📖 Пробник (Вариант 2)

# Студент #Арсений
# Дата: #Пятница #27Февраля2026
# ✅ Верно: 1, 2, 4, 5, 7, 8, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23
# ⛔️ Неверно: 3, 9, 17, 22, 27
# ❔ Без ответа: 6, 24, 25, 26
# Итог: 19/29 первичных балла ~ 75 вторичных

# endregion 📖 Пробник (Вариант 2)

