# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                # F = ¬(x → z) ∨ (y ≡ w) ∨ y
                F = (not(x <= z)) or (y == w) or y
                if F == 0:
                    print(x, y, z, w)


# № 9733 Основная волна 19.06.23 (Уровень: Базовый)

print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                # F = (x ∧ ¬y) ∨ (x ≡ z) ∨ w
                F = (x and (not y)) or (x == z) or w
                if F == 0:
                    print(x, y, z, w)

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = [11]
# на следующем уроке: 7
