# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 25448 (Уровень: Базовый)
'''
from math import dist
clustersA = [[], []]
clustersB = [[], [], []]

for s in open('files/27A.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y < 10:
        clustersA[0].append([x, y])
    else:
        if 0 < x < 5:
            clustersA[1].append([x, y])

for s in open('files/27B.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if 0 < y < 11:
        clustersB[0].append([x, y])
    if 11 < y < 15:
        clustersB[1].append([x, y])
    if 15 < y < 25:
        clustersB[2].append([x, y])

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        R.append([summa, p])
    return min(R)[1]

# Для файла А определите координаты центра каждого кластера, затем найдите два числа:
# Px - расстояние по оси абсцисс между центрами кластеров, и
# Py - расстояние по оси ординат между центрами кластеров.

print(center(clustersA[0]))  # [1.8967357, 6.201779273]
print(center(clustersA[1]))  # [3.43093914, 17.76254855]

PxA = (3.43093914 - 1.8967357) * 10000
PyA = (17.76254855 - 6.201779273) * 10000
print(int(abs(PxA)), int(abs(PyA)))


# Для файла Б определите координаты центра каждого кластера,
# затем найдите два числа:
# Q1 - среднее арифметическое расстояний от центра кластера
# с минимальным количеством точек до точек этого кластера, и
# Q2 - среднее арифметическое расстояний от центра кластера
# с максимальным количеством точек до точек этого кластера.
# Нулевое расстояние от центра кластера до самого себя не учитывать.

print(center(clustersB[0]))  # [28.41855208, 8.279001906]
print(center(clustersB[1]))  # [16.02610912, 13.02260516]
print(center(clustersB[2]))  # [18.68018435, 19.56779858]

print(len(clustersB[0]))  # 399
print(len(clustersB[1]))  # 146
print(len(clustersB[2]))  # 88

def F(cl, cent):
    summa = 0
    cnt = 0
    for p in cl:
        summa += dist(p, cent)
        cnt += 1
    return summa / cnt

clustersB[2].remove([18.68018435, 19.56779858])
Q1 = F(clustersB[2], [18.68018435, 19.56779858])
clustersB[0].remove([28.41855208, 8.279001906])
Q2 = F(clustersB[0], [28.41855208, 8.279001906])
print(int(Q1 * 10000), int(Q2 * 10000))
'''
# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 7, 8, 9, 11, 13, 14, 15, 16, 17, 19-21, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке: +20 минут к след. уроку
