# region Домашка: *********************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *********************************************************************

# № 17556 Основная волна 08.06.24 (Уровень: Базовый)
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or (B <= (x % 22 != 0))

for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''

'''
def F(x, a1, a2):
    P = 15 <= x <= 40
    Q = 21 <= x <= 63
    A = a1 <= x <= a2
    return P <= ((Q and (not A)) <= (not P))

R = []
M = [x / 4 for x in range(10 * 4, 100 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))
'''

# № 17529 Основная волна 07.06.24 (Уровень: Базовый)

import sys
sys.setrecursionlimit(10000)
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n-1)

print((2 * F(2024)+F(2023))/F(2022))


# endregion Урок: ******************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [3, 4, 6, 10, 12, 15, 16, 23]
# на следующем уроке:
