# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 17860 Демоверсия 2025 (Уровень: Базовый)
# Черепахе был дан для исполнения следующий алгоритм:
# Повтори 9 [Вперёд 22 Направо 90 Вперед 6 Направо 90]
# Поднять хвост
# Вперед 1 Направо 90 Вперёд 5 Налево 90
# Опустить хвост
# Повтори 9 [Вперёд 53 Направо 90 Вперёд 75 Направо 90]
'''
import turtle as t
t.screensize(-2000, 2000)  # Добавляет ползунки
t.tracer(0)  # Отключает анимацию отрисовки
t.left(90)
t.down()  # хвост опущен
l = 40

# Тут пишется псевдокод

for _ in range(9):
    t.forward(22 * l)
    t.right(90)
    t.forward(6 * l)
    t.right(90)
t.up()
t.fd(1 * l)
t.rt(90)
t.fd(5 * l)
t.lt(90)
t.down()
for _ in range(9):
    t.fd(53 * l)
    t.rt(90)
    t.fd(75 * l)
    t.rt(90)

# Тут рисуем точки:
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * l, y * l)
        t.dot(4, 'red')

t.update()  # Для корректной работы .tracer()
t.done()  # Фиксация окна отриcовки
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6]
# КЕГЭ  = []
# на следующем уроке:
