# region Домашка: *********************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *********************************************************************


# 2
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (not (x <= w)) or (y <= z) or (not y)
                if F == 0:
                    print(x, y, z, w)
'''

# 5
'''
a = []
for n in range(1, 1000):
    s = bin(n)[2:]  # [2:] забыл добавит срез
    if s.count('1') % 2 == 0:
        s = '10' + s[2:] + '0'
    else:
        s = '11' + s[2:] + '1'
    r = int(s, 2)  # Эта строчка всегда лежит именно в цикле for
    if r > 50:
        a.append(n)
print(min(a))  # Эту строчку можно вынести в самый левый край вне цикла for
'''


# 6
'''
from turtle import*
tracer(0)
k = 20
left(90)
for i in range(9):
    forward(22*k)
    right(90)
    forward(6*k)
    right(90)
up()
forward(1*k)
right(90)
forward(5*k)
left(90)
down()
for i in range(9):
    forward(53*k)
    right(90)
    forward(75*k)
    right(90)

up()
for x in range(-50, 50):
    for y in range(-50, 50):
        goto(k*x, k*y)
        dot(2, 'red')
update()
done()
'''

# 7
'''
pixels = 1024*960
colors = 8192  # 2**i >= 8192
i = 13  # бит на один пиксель
bit = pixels * i  # бит

I = 280 * 1_474_560  # бит
print(I / bit)  # 32.30769 -> 32
'''


# endregion Урок: ******************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [3, 7, 4, 10, 12]
# на следующем уроке:
