# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

import sys
sys.setrecursionlimit(10000)
def F(n):
    if n < 5:
        return n
    if n >= 5:
        return 2*n * F(n - 4)


print((F(13766) - 9 * F(13762)) / F(13758))
# RecursionError: maximum recursion depth exceeded

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16]
# КЕГЭ  = []
# на следующем уроке:
