# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единиц измерения информации
# 1 бит - это минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит


# № 9834 Основная волна 27.06.23 (Уровень: Базовый)
'''
sym = 10
alp = 52  # alp = 2**i
i = 6  # 2**6 >= 52
# i - это кол-во бит на один символ

bit = sym * i  # бит на один пароль
print(bit / 8)  # 7.5 -> 8 (всегда вверх)
byte = 8  # байт на один пароль

print((byte * 65536) / 2**10)
'''


# № 4616 Основная волна 2022 (Уровень: Базовый)
'''
sym = 294
alp = 10 + 4550
i = 13  # 2 ** 13 >= 4560

bit = sym * i
print(bit / 8)  # 477.75 -> 478
byte = 478
print((byte * 131_072) / 2**10)
'''


# № 20805 Апробация 05.03.25 (Уровень: Средний)
# Известно, что для хранения 75 600 серийных номеров
# требуется более 16 Мбайт памяти.

sym = 248
# alp - ?
# i - ?

byte = 16 * 2**20 / 75_600
print(byte)  # 221.9208 -> 222
bit = 222 * 8

i = bit / sym
print(i)  # 7.1612 -> 8

i = 8  # alp[129:256]
i = 8  # alp[2**7+1 : 2**8]
# минимально возможную мощность алфавита: 129
# максимально возможную мощность алфавита: 256

alp = 16  # i = 4
alp = 32  # i = 5
alp = 17  # i = 5
alp = 33  # i = 6









# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 7, 18


# Второй пробник 28.02.25:
# Артем 4/29 -> 27 вторичных баллов +[2, 10, 15, 16] -[1, 5, 6, 8, 12, 13, 14, 23]
