# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

`# Единиц измерения информации
# 1 бит - это минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит


# Прототип с картинками

# I = x * y * i
# pixels = x * y кол-во пикселей на картинке
# colors = 2 ** i
# i - кол-во бит на один пиксель d


# https://education.yandex.ru/ege/task/f6a4cbda-6370-43f2-839e-f3b856609737
'''
pixels = 640 * 320
i = 6  # 2 ** 6 >= 64
I = pixels * i  # бит
print(I / 2**13)  # 150
'''


# https://education.yandex.ru/ege/task/3e56d20f-3710-4260-a6aa-4f73c37facec
'''
pixels = 320 * 480
I = 40 * 2**13
i = I / pixels
print(i)  # 2.13333 -> 2
i = 2
print(2**i)  # 4
'''




# Прототип с музыкой

# I = v * i * n * t

# моно: v = 1
# стерео: v = 2
# квадра: v = 4

# https://education.yandex.ru/ege/task/ee646cf7-b673-4401-87f5-eb996022d56a
'''
v = 2
n = 24
i = 16000
t = 90
I = v * i * n * t
print(I / 64000)  # 1080
'''


# https://education.yandex.ru/ege/task/5b08e032-88b8-4cff-8b63-329f996e0472
'''
v = 2
i = 48000
t = 90
# n - ?

I = 1600 * 86400
n = I / (v * i * t)
print(2**n)  # уровней громкости / уровней квантования 
'''


# https://education.yandex.ru/ege/task/79f258a0-f83f-4f92-9d8f-a5400b888821
'''
t = 4*60 + 16
v = 2
i = 11000
n = 16
I = v * i * n * t

I2 = v * 44000 * 10 * t

print((I2 - I) / 2**13)
'''`




# Прототип с видео


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 18


# Второй пробник 28.02.25:
# Артем 4/29 -> 27 вторичных баллов +[2, 10, 15, 16] -[1, 5, 6, 8, 12, 13, 14, 23]
