# region Домашка: ******************************************************************

'''
b = 'k'
print(b + 'b')  # 'kb' - операция конкатенации строк (склеивание)

print(b * 5)  # kkkkk

b = 'k'
print(b, b * 2)  # k kk
'''


# Монетный размен: количество и остаток
'''
money = int(input())
nomenal = int(input())
print(money // nomenal)
print(money % nomenal)
'''


# Произведение и сумма цифр пятизначного числа
'''
x = 78
print(x // 10)


x2 = 256
print(x2 // 100)

x3 = 327
print(x3 // 10)
'''

'''
n = int(input())
# n = 34578
a = n // 10000
b = (n // 1000) % 10  # 4
c = (n % 1000) // 100  # 578
d = (n % 100) // 10
e = n % 10
# print(a, b, c, d, e)
print(a * b * c * d * e)
print(a + b + c + d + e)
'''

'''
A = tuple(input())
a = int(A[0])
b = int(A[1])
c = int(A[2])
d = int(A[3])
e = int(A[4])
print(a * b * c * d * e)
print(a + b + c + d + e)


from math import prod
M = [int(x) for x in input()]
print(prod(M))
print(sum(M))


a = int(input())

d = str(a)
while len(d) != 5:
    a = int(input())
    d = str(a)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************




# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
