# region Домашка: ******************************************************************

'''
a = int(input())
b = int(input())
for x in range(a, b+1):
    if (x % 20 == 0) or (x % 7 == 0 and x % 14 == 0) or (x % 10 == 9):
        print(x)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((not z) == y) <= ((w and (not x)) == (y and x))
                if F == 0:
                    print(x, y, z, w)
'''


# Тип 2 №56502
# Логическая функция F задаётся выражением:
# ((x→y)∨(z→w))∧((z≡y)→(w≡x)).
#
# Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x <= y) or (z <= w)) and ((z == y) <= (w == x))
                if F == 0:
                    print(x, y, z, w)
'''

# Тип 2 №18550
# Логическая функция F задаётся выражением ((y → z) ∨ (¬x ∧ w)) ≡ (w ≡ z).
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((y <= z) or ((not x) and w)) == (w == z)
                if F == 1:
                    print(x, y, z, w)
'''


# Тип 2 №18578
# Логическая функция F задаётся выражением ((x ∧ ¬y) ∨ (w → z)) ≡ (z ≡ x).
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x and (not y)) or (w <= z)) == (z == x)
                if F == 1:
                    print(x, y, z, w)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
