# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 8594 (Уровень: Базовый)
'''
def F(a, s, n):
    if a*s >= 455:
        return n % 2 == 0
    if n == 0:
        return 0
    sp = [F(a+1, s, n - 1), F(a, s + 1, n-1), F(a*2, s, n-1), F(a, s*2, n-1)]
    return any(sp) if (n-1) % 2 == 0 else all(sp)
    return any(sp) if (n-1) % 2 == 0 else any(sp)

print([s for s in range(1, 91) if F(5, s, n=2)])
print([s for s in range(1, 91) if F(5, s, n=3) and not F(5, s, n=1)])
print([s for s in range(1, 91) if F(5, s, n=4) and not F(5, s, n=2)])
'''


# № 27771 Апробация 04.03.26 (Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=n×F(n−1), если n>1.
# Чему равно значение выражения(F(2024)−2×F(2023))/F(2022)?
# В ответе запишите целую часть полученного числа
'''
# Решение: 
# F(n) = n * F(n−1), если n>1.
# F(2024) = 2024 * F(2023)
# F(2023) = 2023 * F(2022) / F(2022)

# F(2023) = 2023 * F(2022) / F(2022)

print(2024 * 2023 - 2 * 2023)  # 4090506
'''


# Номер 16 Досрочная волна 07.04.26 вариант 1 (https://disk.yandex.ru/i/vSKwP7fEAs4V0g)
'''
# F(n) = (n + 4) * F(n - 5)
# F(267487) = (257487 + 4) * F(257482)
# F(267482) = (257482 + 4) * F(257477)
# F(267477) = (257477 + 4) * F(257472) / F(257472)

# F(267477) = (257477 + 4) * F(257472) / F(257472)

print(((257487 + 4) * (257482 + 4) * (257477 + 4)) / 683)  # 24994252792782
print((257477 + 4) / 67)  # 3843
print(24994252792782 + 3843)  # 24994252796625
'''


# Номер 12 Досрочная волна 07.04.26 вариант 1 (https://disk.yandex.ru/i/vSKwP7fEAs4V0g)

print(bin(2047)[2:])  # 11111111111
# 1 1 1 1 1 1 1 1 1 1 1
print(int('100000000000', 2))  # 2048


print(bin(800)[2:])  # 11111111111
print(int('1000100000', 2))  # 544


print(bin(2028)[2:])  # 11111101100
print(int('1111110110000', 2))

# № 25599 (Уровень: Базовый)

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 9, 12, 14, 15, 16, 17, 23, 19-21, 27]
# КЕГЭ = [16+]
# на следующем уроке: