# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# ¬x        (not x)
# x ∧ y     x and y
# x ∨ y     x or y
# x → y     x <= y
# x ≡ y     x == y

# № 23739 Демоверсия 2026 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции
# F = (x∨y) ∧ ¬(y≡z) ∧ ¬w
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (x or y) and (not(y == z)) and (not w)
                if F == 1:
                    print(x, y, z, w)
'''


# № 23548 Пересдача 03.07.25 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции
# F=((x∨y)→z)∨(y≡w)∨z
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x or y) <= z) or (y==w) or z
                if F == 0:
                    print(x, y, z, w)
'''

#
# № 23361 Резервный день 19.06.25 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции
# F = ¬(y → (x≡z)) ∧ (w→x)
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (not(y <= (x==z))) and (w <= y)
                if F == 1:
                    print(x, y, z, w)
'''


# № 22421 (Уровень: Базовый)
# (Л. Шастин) Лёня заполнял таблицу истинности логической функции
# F=¬(¬(z→y)∨(x≡w)∨x)
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (not((not(z<=y)) or (x==w) or x))
                if F == 1:
                    print(x, y, z, w)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 14]
# КЕГЭ = []
# на следующем уроке:
