# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 21895 Открытый вариант 2025 (Уровень: Базовый)
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    if len(M) == len(set(M)): # – в строке все числа различны;
        M = sorted(M)  # – сумма двух наибольших чисел строки не больше суммы трёх её оставшихся чисел.
        if M[-1] + M[-2] <= M[0] + M[1] + M[2]:
            cnt += 1
print(cnt)

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1


T = ('a', 'b', 'c', 'd', 'e')
S = {'a', 'b', 'c', 'd', 'e'}
s = 'abcde'
'''


# Определите количество строк таблицы, для чисел которых выполнены все условия:
# в строке есть число, которое повторяется трижды
# в строке ровно 5 различных значений
# сумма чисел в строке меньше 502
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    copied3 = [x for x in M if M.count(x) == 3]
    if len(copied3) == 3:
        if len(set(M)) == 5:
            if sum(M) < 502:
                cnt += 1
print(cnt)
'''

# M = [1, 2, 3, 4]
# from itertools import permutations
# for p in permutations(M):
#     print(p)
    # (1, 2, 3, 4)
    # (1, 2, 4, 3)
    # (1, 3, 2, 4)
    # (1, 3, 4, 2)
    # (1, 4, 2, 3)
    # (1, 4, 3, 2)
    # (2, 1, 3, 4)
    # (2, 1, 4, 3)
    # (2, 3, 1, 4)
    # (2, 3, 4, 1)
    # (2, 4, 1, 3)
    # (2, 4, 3, 1)
    # (3, 1, 2, 4)
    # (3, 1, 4, 2)
    # (3, 2, 1, 4)
    # (3, 2, 4, 1)
    # (3, 4, 1, 2)
    # (3, 4, 2, 1)
    # (4, 1, 2, 3)
    # (4, 1, 3, 2)
    # (4, 2, 1, 3)
    # (4, 2, 3, 1)
    # (4, 3, 1, 2)
    # (4, 3, 2, 1)



# наибольшее из четырёх чисел меньше суммы трёх других;
# четыре числа можно разбить на две пары чисел с равными суммами.
'''
from itertools import permutations
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    if max(M) < sum(M) - max(M):
        if any(p[0] + p[1] == p[2] + p[3] for p in permutations(M)):
            cnt += 1
print(cnt)
'''


# в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны;
# максимальное число строки не повторяется.
'''
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    copied2 = [x for x in M if M.count(x) == 2]
    copied1 = [x for x in M if M.count(x) == 1]
    if len(copied2) == 4 and len(copied1) == 3:
        if M.count(max(M)) == 1:
            print(sum(M))
            break
'''

# Определите количество строк таблицы, содержащих числа,
# для которых выполнено строго одно из условий:
# в строке есть повторяющиеся числа;
# в строке есть ровно три нечётных числа.
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    flag = 0
    if len(M) != len(set(M)):
        flag += 1
    nechet = [x for x in M if x % 2 != 0]
    if len(nechet) == 3:
        flag += 1
    if flag == 1:
        cnt += 1
print(cnt)
'''



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 9, 14, 15, 16, 23, 19-21, 27]
# КЕГЭ = []
# на следующем уроке: