# region Домашка: ******************************************************************

# Сочетание клавиш ctrl + alt + L - приводит код в соответствие PEP8
'''
a = int(input())
b = int(input())
print(a // b)
print(a % b)
'''
from runpy import run_path

# https://stepik.org/lesson/1309430/step/8?unit=1324546
'''
print(123 // 10)  # 12
print(123 % 10)  # 3

n = int(input())  # 48395
a = n // 10000  # 4
b = (n // 1000) % 10
c = (n % 1000) // 100
d = (n % 100) // 10
e = n % 10  # 5
print(a * b * c * d * e)
print(a + b + c + d + e)
'''
# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

a = int(input())
b = int(input())
c = int(input())
if a == b == c:
    print("Равносторонний")
elif (a == b) or (a == c) or (c == b):
    print("Равнобедренный")
else:
    print("Разносторонний")



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
