# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# https://education.yandex.ru/ege/task/c624bf95-c3d7-48d7-898f-7a8868480573

def divisors(x):
    div = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


for x in range(326496, 649632+1):
    d = divisors(x)
    chet = [j for j in d if j % 2 == 0]
    nechet = [j for j in d if j % 2 != 0]
    if len(chet) == len(nechet):
        if len(chet) >= 70 and len(nechet) >= 70:
            print(x, min([j for j in d if j > 1000]))



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Второй пробник 28.02.25:
# Артем 4/29 -> 27 вторичных баллов +[2, 10, 15, 16] -[1, 5, 6, 8, 12, 13, 14, 23]
