# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# № 27635 Апробация 04.03.26(Уровень: Базовый)
# Назовём маской числа последовательность цифр, в которой также могут
# встречаться следующие символы:
# – символ «?» означает ровно одну произвольную цифру;
# – символ «*» означает любую последовательность цифр произвольной длины;
# в том числе «*» может задавать и пустую последовательность.

# Среди натуральных чисел, не превышающих 10**8, найдите все числа,
# соответствующие маске 1*23??56, делящиеся на 171 без остатка

# 1*23??56
# 1232556
# 1111232556
# 1000232556

'''
from fnmatch import *
for x in range(171, 10**8, 171):
    if fnmatch(str(x), '1*23??56'):
        print(x, x // 171)

from re import *
for x in range(171, 10**8, 171):
    if fullmatch('1[0-9]*23[0-9][0-9]56', str(x)):
        print(x, x // 171)
'''

# Ответ:
# 1237356 7236
# 10231956 59836
# 12232656 71536
# 14233356 83236
# 16234056 94936
# 18234756 106636



# № 20288 (Уровень: Средний)
# (М. Попков) Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
# – символ «?» означает ровно одну произвольную нечётную цифру;
# – символ «*» означает любую последовательность чётных цифр
# произвольной длины; в том числе «*» может задавать и пустую последовательность.
#
# Среди натуральных чисел, не превышающих 10**10, найдите
# все числа, соответствующие маске *12?4?, делящиеся
# на 9231 без остатка.
'''
from re import *
for x in range(9231, 10**10, 9231):
    if fullmatch('[02468]*12[13579]4[13579]', str(x)):
        print(x, x // 9231)
'''


# Универсальная функция поиска делителей числа для 25 номера #шпора
'''
import time
start = time.time()

# def divisors(x):
#     d = []
#     for j in range(1, x+1):
#         if x % j == 0:
#             d.append(j)
#     return d

def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

print(divisors(24))  # [1, 2, 3, 4, 6, 8, 12, 24]
print(divisors(100_000_000))  # [1, 2, 3, 4, 6, 8, 12, 24]

end = time.time()
print(end - start)  # 1.7149 -> 0.00022101
'''




# № 2588 (Уровень: Базовый)
# (А.Н. Носкин) Напишите программу, которая ищет среди целых чисел,
# принадлежащих числовому отрезку [190201; 190260], числа, имеющие
# ровно 4 различных чётных делителя. В ответе для каждого найденного
# числа запишите два его наибольших чётных делителя в порядке убывания.
'''
def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

for x in range(190201, 190260+1):
    d = [j for j in divisors(x) if j % 2 == 0]
    if len(d) == 4:
        print(d[-1], d[-2])
'''




# № 2685 Пробный 02.2022 /dev/inf Base level(Уровень: Средний)
# Пусть S - сумма двух минимальных натуральных делителей целого числа,
# не считая единицы и самого числа.
# Если таких делителей у числа менее двух, то считать значение S равным нулю.
# Напишите программу, которая перебирает целые числа, не превышающие 1 200 000,
# и ищет среди них такие, для которых значение S не равно нулю и кратно 2022.
# Программа должна найти и вывести 5 наибольших таких чисел и соответствующие
# им значения S.
'''
def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1):  # не считая единицы и самого числа.
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
for x in range(1_200_000+1-1, -1, -1):
    d = divisors(x)
    if len(d) >= 2:
        S = d[0] + d[1]
        if S != 0 and S % 2022 == 0:
            print(x, S)
            cnt += 1
            if cnt == 5:
                break
'''


# № 1976 Демоверсия 2022(Уровень: Базовый)
# Пусть M – сумма минимального и максимального натуральных делителей целого числа,
# не считая единицы и самого числа. Если таких делителей у числа нет, то
# значение M считается равным нулю.
#
# Напишите программу, которая перебирает целые числа, бо́льшие 700 000,
# в порядке возрастания и ищет среди них такие, для которых значение M оканчивается на 8.
# Выведите первые пять найденных чисел и соответствующие им значения M.
'''
def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1): # не считая единицы и самого числа
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
for x in range(700_000+1, 10**10):
    d = divisors(x)
    if len(d) >= 2:
        M = min(d) + max(d)
        if M % 10 == 8:
            print(x, M)
            cnt += 1
            if cnt == 5:
                break
'''


# № 25362 ЕГКР 13.12.25(Уровень: Базовый)
# Напишите программу, которая перебирает целые числа, большие 1 350 050,
# в порядке возрастания и ищет среди них такие, у которых есть натуральный
# делитель, оканчивающийся на 11 и не равный ни самому числу, ни числу 11.
# В ответе запишите в первом столбце таблицы первые пять найденных чисел
# в порядке возрастания, а во втором столбце - для каждого числа соответствующий
# минимальный делитель, оканчивающийся на 11, не равный ни самому числу,
# ни числу 11.
'''
def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
for x in range(1_350_050+1, 10**10):
    d = [j for j in divisors(x) if j != 11 and j != x and j % 100 == 11]
    if len(d) > 0:
        print(x, min(d))
        cnt += 1
        if cnt == 5:
            break
'''



# № 2394 (Уровень: Средний)
'''
def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
for x in range(670_000+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) > 0:
        S = sum(d)
        if S % 10 == 5:
            print(x, S)
            cnt += 1
            if cnt == 5:
                break
'''





# № 28944 ЕГКР 18.04.26(Уровень: Базовый)
# Напишите программу, которая перебирает целые числа, большие 8 996 452,
# в порядке возрастания и ищет среди них числа, представленные в виде
# произведения ровно двух простых множителей, не обязательно различных,
# каждый из которых содержит в своей записи ровно две цифры 3.

# В ответе в первом столбце таблицы запишите первые 5 найденных чисел
# в порядке возрастания, а во втором столбце - для каждого из чисел
# соответствующий им наибольший из найденных множителей.
'''
def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
from itertools import product
for x in range(8_996_452+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 2 and str(j).count('3') == 2]
    if any(p[0] * p[1] == x for p in product(d, repeat=2)):
        print(x, max(d))
        cnt += 1
        if cnt == 5:
            break
'''


def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
from itertools import product
for x in range(8_996_452+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 2 and str(j).count('3') == 2]
    for p in product(d, repeat=2):
        if p[0] * p[1] == x :
            print(x, max(p))
            cnt += 1
            break
    if cnt == 5:
        break


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [5, 25]
# КЕГЭ = []
# на следующем уроке:



