# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************




# № 31360 Пересдача 08.07.26(Уровень: Базовый)
# Операнды арифметического выражения записаны в системе счисления с основанием 22.
# 27x98966_22 + 26x33_22 + 522x5_22
# В записи чисел переменной х обозначена неизвестная цифра из алфавита 22-ричной системы счисления. Определите наибольшее значение х, при котором значение данного арифметического выражения кратно 21. Для найденного х вычислите частное от деления значения арифметического выражения на 21 и укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.



# № 31222 Резерв 22.06.26(Уровень: Базовый)
# Операнды арифметического выражения записаны в системе счисления с основанием 19.
# 76x79645_19 + 35x42_19 + 332x6_19
# В записи чисел переменной х обозначена неизвестная цифра из алфавита 19-ричной системы счисления.
# Определите наибольшее значение х, при котором значение данного арифметического выражения кратно 18.
# Для найденного вычислите частное от деления значения арифметического выражения на 18 и укажите
# его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.






# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27.1]
# КЕГЭ = [5, 18]
# на следующем уроке: 9, 14, 16, 17, 24, 25


# region 📖 Пробник (Вариант 2)

# Студент #Никита
# Дата: #Вторник #17Марта2026
# ✅ Верно: 1, 2, 3, 4, 7, 10, 11, 19, 20, 21, 23
# ⛔️ Неверно: 6, 8
# ❔ Без ответа: 5, 9, 12, 13, 14, 15, 16, 17, 18, 22, 24, 25, 26, 27
# Итог: 11/29 первичных балла ~ 54 вторичных

# endregion 📖 Пробник (Вариант 2)
