# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

R = []
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if x < 0]
B = [x for x in M if x < 0 and len(str(x)) == 4 and x % 9 == 0]
for i in range(len(M) -1):
    x,y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) > max(B):
            R.append(x+y)
print(len(R), min(R))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27.1]
# КЕГЭ = []
# на следующем уроке: 5, 9, 12, 13, 14, 15, 16, 17, 18, 22, 24, 25


# region 📖 Пробник (Вариант 2)

# Студент #Никита
# Дата: #Вторник #17Марта2026
# ✅ Верно: 1, 2, 3, 4, 7, 10, 11, 19, 20, 21, 23
# ⛔️ Неверно: 6, 8
# ❔ Без ответа: 5, 9, 12, 13, 14, 15, 16, 17, 18, 22, 24, 25, 26, 27
# Итог: 11/29 первичных балла ~ 54 вторичных

# endregion 📖 Пробник (Вариант 2)
