# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Цикл for отвечает запросы: "повтори N раз", "пробеги от A до B"

# Цикл for работа через функцию range()
'''
# range(0, STOP-1, 1)
# range(START, STOP-1)
# range(START, STOP, STEP-1)

for i in range(10):
    print(i, end=' ')  # 0 1 2 3 4 5 6 7 8 9
print()

for i in range(2, 10):
    print(i, end=' ')  # 2 3 4 5 6 7 8 9
print()

for i in range(2, 10, 2):
    print(i, end=' ')  # 2 4 6 8
print()

for i in range(2, 10+1, 2):  # - все числа, делящиеся на 2
    print(i, end=' ')  # 2 4 6 8 10
print()

for i in range(3, 10+1, 3):  # - все числа, делящиеся на 3
    print(i, end=' ')  # 2 4 6 8 10
print()

for i in range(10, -1, -1):
    print(i, end=' ')  # 10 9 8 7 6 5 4 3 2 1 0
print()
'''

# Цикл for работа напрямую через последовательность
'''
s = 'abcde'

# i   0    1    2    3    4
L = ['a', 'b', 'c', 'd', 'e']

print(len(L))  # 5 - Возвращает длину списка (кол-во элементов)

for x in L:
    print(x, end=' ')  # a b c d e
print()

for x in L:
    if x in 'ae':
        print(x, end=' ')  # a e
print()

for i in range(len(L)):
    # print(i, end=' ')  # 0 1 2 3 4
    print(L[i], end=' ')  # a b c d e
print()

for i in range(len(L)):
    L[i] = L[i] * i
print(L)  # ['', 'b', 'cc', 'ddd', 'eeee']

M = [2, 3, 2, 4, 5, 6, 4, 3, 43, 52]
for i in range(len(M)):
    if M[i] % 2 != 0:
        M[i] = M[i] ** 2
print(M)  # [2, 9, 2, 4, 25, 6, 4, 9, 1849, 52]

for x in range(2):
    for y in (0, 1):
        print(x, y )
'''

# Цикл while отвечает запросы: "пока условие верно - делаем действие", "Бесконечный цикл"
'''
for i in range(2, 10+1, 2):
    print(i, end=' ')  # 2 4 6 8 10
print()

i = 2
while i <= 10:
    print(i, end=' ')  # 2 4 6 8 10
    i += 2
print()
'''


# Бесконечные циклы и операторы: break, continue, exit()
'''
k = 0
while True:
    k += 1
    if k % 2 != 0:
        continue  # Прерывает итерацию (шаг цикла)
    if k == 100_000:
        break  # Прерывает выполнение цикла в котором он лежит
    if k == 50_000:
        exit()  # Прерывает выполнение всей программы
    print(k)

print('Продолжение программы')
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2]
# КЕГЭ = []
# на следующем уроке: Должен +30 минут, программа проверки паролей, списки/строки
