# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 23561 Пересдача 03.07.25 (Уровень: Базовый)
# Для какого наибольшего натурального числа А выражение
# ДЕЛ(х,128) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,80))
# истинно (т.е. принимает значение 1) при любом натуральном значении переменной х?
'''
import time
start = time.time()

# Вариант 1
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

RES = []
for A in range(1, 5000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        RES.append(A)
print(max(RES))


# Вариант 2
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

RES = []
for A in range(1, 5000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        RES.append(A)
print(max(RES))

# Вариант 3
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A) == True for x in range(1, 10000)):
        RES.append(A)
print(max(RES))

# Вариант 4
print(max([A for A in range(1, 5000) if all(((x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))) == True for x in range(1, 10000))]))

end = time.time()
print(end - start)
'''


# № 23374 Резервный день 19.06.25 (Уровень: Базовый)
# Для какого наименьшего целого положительного числа А выражение
# (x<A) ∧ (y<3A) ∨ (2x+y>128)
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?
'''
def F(x, y, A):
    return (x<A) and (y<3*A) or (2*x+y>128)

RES = []
for A in range(1, 5000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        RES.append(A)
print(min(RES))
'''


# № 22433 (Уровень: Базовый)
# Для какого наименьшего неотрицательного целого числа А логическое выражение
# (x&117=0) ∧ (x&91=0)→¬(x&А=0)
# истинно (т.е. принимает значение 1) при любом неотрицательном целом значении переменной х?
'''
def F(x, A):
    return ((x & 117 != 0) and (x & 91 == 0)) <= (x & A != 0)

RES = []
for A in range(0, 5000):
    if all(F(x, A) == True for x in range(0, 10000)):
        RES.append(A)
print(min(RES))
'''


#
# № 19485 (Уровень: Базовый)
# и пусть на числовой прямой дан отрезок B=[170;220]
# Определите количество натуральных значений A, при которых формула ДЕЛ(x,A) ∨ ((x∈B) → ¬ДЕЛ(x,24))
# тождественно истинна (т.е. принимает значение 1) при любом натуральном значении переменной x?
'''
def F(x, A):
    B = 170 <= x <= 220
    return (x % A == 0) or ((B) <= (x % 24 != 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A) == True for x in range(1, 10000)):
        RES.append(A)
print(len(RES))
'''


# № 21710 ЕГКР 19.04.25 (Уровень: Базовый)
# На числовой прямой даны два отрезка: B = [36; 75] и C = [60; 110].
# Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
# ¬(x∈A)→((x∈B)≡(x∈C))
#  истинно (т.е. принимает значение 1) при любом значении переменной х.
'''
def F(x, a1, a2):
    B = 36 <= x <= 75
    C = 60 <= x <= 110
    A = a1 <= x <= a2
    return (not A) <= ((B) == (C))

RES = []
M = [x / 4 for x in range(20 * 4, 120 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 74.0
'''


# № 12469 (Уровень: Базовый)
# На числовой прямой даны два отрезка: D = [7; 68] и C = [29; 100].
# Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
# (x∈D)→((¬(x∈C)∧¬(x∈A))→¬(x∈D))
# истинно (т.е. принимает значение 1) при любом значении переменной х.
'''
def F(x, a1, a2):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return (D) <= (((not C) and (not A)) <= (not D))

RES = []
M = [x / 10 for x in range(1 * 10, 120 * 10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 21.75 -> 21.8 -> 21.9 -> 22
'''


# № 11607 (Уровень: Средний)
# Для какого наибольшего натурального числа А формула
# (¬(ДЕЛ(x,263)→ДЕЛ(x,A)) ∧ ДЕЛ(x,71)
# тождественно ложна (т.е. принимает значение 0) при любом натуральном значении переменной х?
'''
def F(x, A):
    return (not((x % 263 == 0) <= (x % A == 0))) and (x % 71 == 0)

RES = []
for A in range(1, 20000):
    if all(F(x, A) == False for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''

# № 11837 (Уровень: Базовый)
# (Л. Шастин) Для какого наименьшего целого неотрицательного числа А формула
# (x ** 2 + y ** 2 > 1024 - x) ∨ (y < -2x + A)
# тождественно истинна, т.е. принимает значение 1 при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (x ** 2 + y ** 2 > 1024 - x) or (y < -2*x + A)

RES = []
for A in range(1, 5000):
    if all(F(x, y, A) == True for x in range(1, 100) for y in range(1, 100)):
        RES.append(A)
print(min(RES))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 4, 5, 14, 15]
# КЕГЭ = []
# на следующем уроке: 16, 23, 19-21
