# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Способ чтения файла
'''
file = open('files/17.txt', mode='r')
print(file)  # <_io.TextIOWrapper name='files/17.txt' mode='r' encoding='UTF-8'>

M = []
for s in file:
    s = int(s)
    M.append(s)
print(M)

file.close()
'''


# Правильные условия открытия файла
'''
with open('files/17.txt', mode='r') as file:
    M = []
    for s in file:
        s = int(s)
        M.append(s)
    print(M)
'''

# Как открывать файл для 17 номера:
'''
M = [int(s) for s in open('files/17.txt')]
print(M)
'''


# Рассмотрим три прототипа 17 номера
'''
# i  0  1  2  3  4
M = [1, 2, 3, 4, 5]

# 1. Под парой подразумевается два идущих подряд элемента последовательности.
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# 2. Под тройкой подразумевается три идущих подряд элемента последовательности.
# 123 234 345
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
'''


# № 25356 (Уровень: Базовый)
'''
M = [int(s) for s in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in M if abs(x) % 100 == 30]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 0:
        if (x + y + z) > max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''


# № 23276 Основная волна 11.06.25 (Уровень: Базовый)
'''
M = [int(s) for s in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in M if abs(x) % 100 == 25]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) <= 2:
        if (x + y + z) <= max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''


# № 23201 Основная волна 10.06.25 (Уровень: Базовый)
'''
M = [int(s) for s in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 3]
B = [x for x in A if abs(x) % 10 == 7]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) % min(B) == 0:
            R.append(x + y)
print(len(R), min(R))
'''


# № 23563 Пересдача 03.07.25 (Уровень: Базовый)
# Определите количество пар последовательности, в которых элементы не равны,
# а абсолютное значение их разности делится на минимальный положительный элемент
# последовательности, кратный 35. Гарантируется, что такой элемент последовательности есть.
# В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар.
'''
M = [int(s) for s in open ("files/17.txt")]
B = [x for x in M if abs(x) % 35 == 0 and x > 0]
R = []
for i in range(len (M)-1):
    x, y = M[i], M[i+1]
    if x != y:
        if abs(x - y) % min(B) ==0:
            R.append(x+y)
print (len(R),max(R))
'''



# № 23757 Демоверсия 2026 (Уровень: Базовый)
# Определите количество пар последовательности, в которых только один из элементов
# является двузначным числом, а сумма элементов пары кратна минимальному двузначному
# элементу последовательности. В ответе запишите количество найденных пар, затем максимальную
# из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд
# элемента последовательности.

M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 2]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) % min(A) == 0:
            R.append(x + y)
print(len(R), max(R))




# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 7, 8, 11, 13, 14, 15, 16, 17, 19-21, 23]
# КЕГЭ = []
# на следующем уроке: 9, 27
