# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 25358 ЕГКР 13.12.25 (Уровень: Базовый)
# 1 куча s + 2, s + 4, s * 2   1 <= s <=124
'''
def F(s, n):
    if s >= 124:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s + 2, n - 1), F(s + 4, n - 1), F(s * 2, n - 1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)


print([s for s in range(1, 124 + 1) if F(s, n=2)])
print([s for s in range(1, 124 + 1) if F(s, n=3) and not F(s, n=1)])
print([s for s in range(1, 124 + 1) if F(s, n=4) and not F(s, n=2)])
'''

# № 27631 Апробация 04.03.26 (Уровень: Базовый)
# 2 кучи: a+1, s+1, a*2, s*2 | a + s >= 211 | a = 17 | 1 < s <= 193

'''
def F(a, s, n): 
    if a + s >= 211:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(a + 1, s, n - 1), F(a, s + 1, n - 1), F(a * 2, s, n - 1), F(a, s * 2, n - 1),]
    return any(h) if (n - 1) % 2 == 0 else all(h) #  else any(h) 

print([s for s in range(2, 193+1) if F(17, s, n=2)])
print([s for s in range(2, 193+1) if F(17, s, n=3) and not F(17, s, n=1)])
print([s for s in range(2, 193+1) if F(17, s, n=4) and not F(17, s, n=2)])  
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9, 11, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 22, 27
