# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 22222
# Определите количество строк таблицы, для чисел которой выполнены все условия:
#
# – в строке только одно число повторяется дважды, остальные числа различны;
# – максимальное число не повторяется;
# – квадрат повторяющегося числа не меньше суммы квадратов
# двух наименьших неповторяющихся чисел.
'''
cnt = 0
for i in open("0. files/9_22222.csv"):
    m = [int(p) for p in i.split(";")]
    if m.count(max(m)) == 1:
        l2 = [x for x in m if m.count(x) == 2]
        l1 = [x for x in m if m.count(x) == 1]
        if len(l2) == 2 and len(l1) == 4:
            # print(m, max(m), l2)
            n = sorted(l1)[:2]
            print(n, l1)
            if (l2[0] ** 2) >= (n[0] ** 2 + n[1] ** 2):
                cnt += 1
print(cnt)
'''
from idlelib.outwin import file_line_progs

# 19240
'''
from itertools import *
n = 0
for p in product(sorted("ЯНВАРЬ"), repeat = 5):
    p = "".join(p)
    n += 1
    if p[0] != "Я":
        if p.count("Ь") <= 1:
            if "ЯЯ" not in p:
                print(n)
'''


# 22221
'''
from itertools import *
cnt = 0
for p in product("01234567", repeat = 7):
    if p[0] != "0":
        p = "".join(p)
        if p.count("0") == 2:
            for x in "1357":
                p = p.replace(x, "*")
            for x in "0246":
                p = p.replace(x, "-")
            if "**" not in p and "--" not in p:
                cnt += 1
print(cnt)
'''


# № 15326 Досрочная волна 2024 (Уровень: Базовый)
# Сеть задана IP-адресом 105.224.200.224 и сетевой маской 255.255.255.224.
# Сколько в этой сети IP-адресов, для которых количество единиц
# в двоичной записи IP-адреса кратно 4?
'''
from ipaddress import *
net = ip_network('105.224.200.224/255.255.255.224', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 4 == 0:
        cnt += 1
print(cnt)
'''

# № 14948 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network("192.168.32.128/255.255.255.192", False)
cnt = 0
for i in net:
    s = f"{i:b}"
    if s.count("1") % 2 == 0:
        cnt += 1
print(cnt)
'''


# № 14358 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network("192.168.32.64/255.255.255.192", False)
cnt = 0
for i in net:
    s = f"{i:b}"
    if s[-3:] == "101":
        cnt += 1
print(cnt)
'''

# № 12947 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network("203.111.195.0/255.255.240.0", False)
cnt = 0
for i in net:
    s = f"{i:b}"
    if s.count("0") % 3 == 0:
        if "111" in s:
            if "000" in s:
                cnt += 1
print(cnt)
'''

'''
# Маска сети имеет длину 32 бита и определенный вид:
# [Единиц: 0, Нулей: 32] 000000....000
# [Единиц: 1, Нулей: 31] 100000....000
# [Единиц: 2, Нулей: 30] 110000....000
# [Единиц: 3, Нулей: 29] 111000....000
# [Единиц: 4, Нулей: 28] 111100....000
# [Единиц: 5, Нулей: 27] 111110....000
# ....
# [Единиц: 31, Нулей: 1] 111111....110
# [Единиц: 32, Нулей: 0] 111111....111

# for mask in range(0, 32+1):
#     print(mask)
'''

# 255.255.255.248 - маска сети в десятичной записи
# 11111111.11111111.11111111.11111000 - маска сети в двоичной записи
# 122.159.136.144/29 - 29 это кол-во единиц в двоично записи маски



# № 18159 (Уровень: Базовый)
# Для узла с IP-адресом 205.154.212.20 адрес сети равен 205.154.192.0.
# Чему равно наибольшее возможное значение третьего слева байта маски?
'''
from ipaddress import *
for mask in range(0, 32+1):
    net = ip_network(f'205.154.212.20/{mask}', 0)
    if '205.154.192.0' in str(net):
        print(net, mask, net.netmask)
        # 205.154.192.0/18 18 255.255.192.0
        # 205.154.192.0/19 19 255.255.224.0
'''


# Для устройства с IP-адресом 222.190.122.24 адрес сети равен 222.190.120.0.
# Какое ещё наибольшее возможное количество устройств можно подключить к этой сети,
# если известно, что два адреса в сети зарезервированы (широковещательный и адрес сети)?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'222.190.122.24/{mask}', 0)
    if '222.190.120.0' in str(net):
        print(net.num_addresses - 2)
'''


# № 16260 Джобс 03.05.24 (Уровень: Средний)
# Известно два узла с IP-адресами 123.20.103.136 и 123.20.103.151
# принадлежат разным сетям с одинаковой маской.
# Определите значение 4 байта маски в этих сетях.
'''
from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'123.20.103.136/{mask}', 0)
    net2 = ip_network(f'123.20.103.151/{mask}', 0)
    if net1 != net2:
        print(net1.netmask)
'''


# № 14359 (Уровень: Базовый)
'''
from ipaddress import *
for masc in range(32+1):
    net1 = ip_network(f"157.127.172.56/{masc}", 0)
    net2 = ip_network(f"157.127.191.78/{masc}", 0)
    if net1 != net2:
        print(masc)
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 8, 9, 13, 14, 17]
# КЕГЭ = []
# на следующем уроке: