# region Домашка: ******************************************************************

# № 25354 ЕГКР 13.12.25 (Уровень: Средний)
# Для какого наименьшего целого неотрицательного числа А логическое выражение
# (78125 != y+4x) ∨ (A>x) ∧ (A>y)
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?
'''
def F(x, y, A):
    return (78125 != y + 4 * x) or (A > x) and (A > y)

# 78125 != y + 4 * x
# y = 78125 - 4*x

for A in range(10**10):
    if all(F(x, 78125 - 4*x, A) for x in range(1, 78125 // 4)):
        print(A)
        break
'''
# Ответ: 78122

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 25448 (Уровень: Базовый)
'''
from math import dist
clustersA = [[], []]
clustersB = [[], [], []]

for s in open('files/27A.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y < 10:
        clustersA[0].append([x, y])
    if y > 10 and 0 < x < 10:
        clustersA[1].append([x, y])

for s in open('files/27B.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y > 0 and 25 < x < 35:
        clustersB[0].append([x, y])
    if 11 <= y <= 15:
        clustersB[1].append([x, y])
    if 15 < y < 23:
        clustersB[2].append([x, y])

# from math import dist
# def d(A, B):
#     x1, y1 = A
#     x2, y2 = B
#     return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
#
# print(d([4, 5], [6, 7]))  # 2.8284
# print(dist([4, 5], [6, 7]))  # 2.8284

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        R.append([summa, p])
    return min(R)[1]

def center(cl):
    return min((sum(dist(p, g) for g in cl), p) for p in cl)[1]


# Для файла А определите координаты центра каждого кластера, затем найдите два числа:
# Px - расстояние по оси абсцисс между центрами кластеров, и
# Py - расстояние по оси ординат между центрами кластеров.

print(center(clustersA[0]))  # [1.8967357, 6.201779273]
print(center(clustersA[1]))  # [3.43093914, 17.76254855]

Px = 3.43093914 - 1.8967357  # 1.53420344
Py = 17.76254855 - 6.201779273  # 11.560769277000002
print(int(abs(Px * 10000)), int(abs(Py * 10000)))  # 15342 115607


# Для файла Б определите координаты центра каждого кластера, затем найдите два числа:
# Q1 - среднее арифметическое расстояний от центра кластера с минимальным
# количеством точек до точек этого кластера, и
# Q2 - среднее арифметическое расстояний от центра кластера с максимальным
# количеством точек до точек этого кластера.
# Нулевое расстояние от центра кластера до самого себя не учитывать.

print(center(clustersB[0]))  # [28.41855208, 8.279001906]
print(center(clustersB[1]))  # [16.02610912, 13.02260516]
print(center(clustersB[2]))  # [18.68018435, 19.56779858]

print(len(clustersB[0]))  # 399
print(len(clustersB[1]))  # 146
print(len(clustersB[2]))  # 88

def avg_center(cl, center, cnt):
    summa = 0
    for p in cl:
        if p == center:
            continue
        summa += dist(p, center)
    return summa / (cnt - 1)

Q1 = avg_center(clustersB[2], [18.68018435, 19.56779858], 88)  # 0.9762326577793143
Q2 = avg_center(clustersB[0], [28.41855208, 8.279001906], 399)  # 0.9518080288394967
print(int(Q1 * 10000), int(Q2 * 10000))  # 9762 9518
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 7, 8, 9, 11, 13, 14, 15, 16, 17, 19-21, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке: