# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# V = a * b * c * t (бит)
# a - кол-во каналов (шт) моно-1/стерео-2/квадра-4
# b - частота дискретизации (Гц)
# c - битное разрешение/глубина кодирования (бит)
# t - длина звукозаписи (сек)


# https://education.yandex.ru/ege/inf/task/eeee81f3-071e-46a6-967d-043f06c8af92
'''
a = 1
b = 10000
c = 16
t = 8
V = a * b * c * t  # бит
print(V / 2**13)  # 156.25
'''


# В музыкальном фрагменте продолжительностью 4 минуты 16 секунд,
# записанном в формате стерео с частотой дискретизации 11 КГц и 65536 уровнями квантования
# без использования сжатия данных, уменьшили количество уровней квантования до 1024
# и увеличили частоту дискретизации до 44000 Гц.
# На сколько килобайт увеличился информационный объём после преобразования?
'''
a = 2
b = 11000
c = 16  # 65536 уровнями квантования -> 2**16 битное разрешение/глубина кодирования = 16
t = 4*60 + 16
V = a * b * c * t

a = 2
c2 = 10
b2 = 44000
t = 4*60 + 16
V2 = a * b2 * c2 * t

print((V2 - V) / 2**13)
'''


# https://education.yandex.ru/ege/inf/task/7407e7ee-2ca4-4372-b173-b39bffa2d1d9
'''
a = 2
b = 44000
c = 16
t = 60

v = a * b * c * t
v_32 = v * 32

u = 1_802_240  # бит/с

print(v_32 / u)  # 1500 сек
'''


'''
t = 90 * 60 # 5400
a = 1
b = 16000
V = 256 * 1024 * 1024 * 8
print(V)
c = V / (t * a * b)
V = 25 * t * a * b
print(V)
print(c)
'''



# V = pixels * i
# i - это кол-во бит на один пиксель

# colors = 2 ** i
# 128 = 2 ** 7
# i = 7  - по 7 бит на каждый пиксель


# https://education.yandex.ru/ege/inf/task/c0059c7b-fccc-42d5-b1b0-dffa46d4fccc
'''
V = 405 * 2**13
pixels = 480 * 768

i = V / pixels
print(i)  # 9 = 2+1 + 2+1 + 2+1
# i = 6
'''

'''
pix_1 = 1920 * 1080
i = 23
V_1 = pix_1 * i
print(V_1 * 120)

pix_2 = 1280 * 1024
i2 = 21
V_2 = pix_2 * i2
print(V_2 * 120)

print((V_1 - V_2) / 2**13)
'''


# https://education.yandex.ru/ege/inf/task/c4adfb30-2b1d-4601-869e-d52ed7dab6cb

from math import floor
u = 1_638_400
t = 220
V = (u * t) / 27
print(V)  # 13349925

pix = 1024 * 768
i = V / pix
print(i)

print(2**16)



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 7, 8, 9, 11, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: