# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 18265 (Уровень: Средний)
# alp = sorted('0123456789QWERTUIOPOASDFGHJKLZXCVBNM')
# print(alp.index('T'))
'''
for p in range(30, 36+1):
    for s in range(10, 34+1):
        A = int('R4', p-1)
        B = int('B0', s+2)
        C = int('T3NK4', p)
        if A + B + C == 23593399:
            print(p * s)#
'''


# № 23934 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTUIOPOASDFGHJKLZXCVBNM')
for p in range(7, 36+1):
    A = int('2465123', p)
    B = int('251341', p)
    if (A + B) % 17 == 0:
        print(p, (A + B) // 17)
'''

# № 23753 Демоверсия 2026 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTUIOPOASDFGHJKLZXCVBNM')
for x in alp[:29]:
    A = int(f'923{x}874', 29)
    B = int(f'524{x}6152', 29)
    if (A + B) % 28 == 0:
        print(x, (A + B) // 28)
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 9, 14, 17]
# КЕГЭ = []
# на следующем уроке: