# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# https://education.yandex.ru/ege/task/97232e31-d97b-4f20-badf-1c38458126c4
# I = k * T * c * t
'''
# Исходный - 100% отняли -40%
print(18 * 60)
N = 256000 * 1080  # бит/с * с - сжатый 60%
print(N)
I = (N / 60) * 100  # исходный файл 100 %
print(I)

k = 2
T = 48000
c = 10  # 2**10 == 1024
print(2**10)
# t - ?

t = I / (k * T * c)  # сек
print(t / 60)  # 480
'''


# https://education.yandex.ru/ege/task/69f7445f-bff9-4586-bd5b-1bbfa80ff30d
'''
t = 90
k = 2
c = 16
T = 48000

I = k * T * c * t  # бит
U = 3200  # бит/с

print(I / U)  # 43200
'''


# https://education.yandex.ru/ege/task/724475c0-8d62-4879-80a6-99e86710b738
'''
symbols1 = 10
alphabet1 = 10  # 2 ** i >= 10
i1 = 4  # кол-во бит выделяемых на один символ
bit1 = symbols1 * i1

symbols2 = 10
alphabet2 = 26  # 2 ** i >= 10
i2 = 5
bit2 = symbols2 * i2

bit = bit2 + bit1
print(bit / 8)  # 11.25
byte = 12

I = 600 / 20  # вес одного пользователя
# пользователь = ID + допы

print(I - byte)
'''


# https://education.yandex.ru/ege/task/7973eeb2-91dd-4de5-ae6f-9c141ca5fa47






# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке: Разобрать сложные 10. На следующем уроке просто решаем вариант - повторение
