# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# 7 Мбайт = 2**20 байт = 2**23 бит

# bit = pixels * i, где i - это кол-во бит на один пиксель
# colors = 2 ** i

# № 19568 (Уровень: Средний)
'''
colors = 256  # 2 ** 8 >= 256
i = 8  # бит на один пиксель
pixels = 1280 * 1024  # общее кол-во пикселей
bit = pixels * i  # бит на одну фотографию

card = 4 * 2**33  # бит (4 Гбайт)
photos = int(card / bit)

cards_34 = photos * 34
print(cards_34 + 307)
'''
# 1 Мбайт = 1 * 2 ** 23 бит
# 1 Гбайт = 1 * 2 ** 33 бит


# № 19557 (Уровень: Базовый)
'''
pixels = 1920 * 1080
colors = 2048  # 2 ** 11 >= 2048
i = 11
bit = pixels * i  # бит на одну фотографию
bit_all = bit * 313  # бит
print(bit_all / 2**23)
'''


# № 19556 (Уровень: Базовый)
'''
# bit = a (шт) * b (Гц) * c (бит) * t (сек)

a = 2
b = 48000
c = 18
# t - ?

bit = 196 * 2 ** 23  # бит
t = bit / (a * b * c)
print(t)  # 951.48562 - сек
print(t / 60)  # 15.85809 - мин
'''


# № 18191 (Уровень: Средний)
'''
# bit_music = a (шт) * b (Гц) * c (бит) * t (сек)
# bit_photo = pixels (шт) * i (бит)

# При его срабатывании включается запись ровно на 1 минуту.
# Видео записывается с частотой 60 кадров в секунду,
# разрешением 1920х1080 и глубиной кодирования 1 байт

photos = 60 * 60
pixels = 1920 * 1080
i = 1 * 2**3  # бит
bit_photo = pixels * i
bit_photos = bit_photo * photos

# Звук видео записан в формате стерео,
# частотой дискретизации 24 кГц и разрешением 6 бит.

a = 2
b = 24000
c = 6
t = 60
bit_music = a * b * c * t


print(((bit_music + bit_photos) * 50) / 2**13)
# 364605468.75 -> 364605469
'''


# № 17548 Основная волна 08.06.24 (Уровень: Базовый)
'''
pixels = 1024 * 960
colors = 2048
i = 11
bit = pixels * i

U = 96_468_992  # бит / с
T = 280  # с
bit_all = U * T
print(bit_all / bit)  # 2497.939
'''
# Ответ: 2497


# № 10093 Демоверсия 2024 (Уровень: Базовый)
'''
symbols = 60
alphabet = 10 + 250  # alphabet = 2 ** i, где i - это кол-во бит на один символ
i = 9  # 2 ** 9 >= 260
bit = symbols * i

print(bit / 8)  # 67.5 -> 68
byte = 68

print((65_536 * byte) / 2**10)
'''
# 4352.0 -> 4352


#
# № 18313 (Уровень: Средний)
'''
symbols = 25
alphabet = 10 + 26*2 + 465
print(alphabet)
i = 10  # 2 ** 10 >= alphabet (527)

bit = symbols * i
print(bit / 8)  # 31.25 -> 32
byte = 32

user = (77 * 2**10) / 1500
print(user - byte)  # 20.565
'''
# Ответ: 20


# № 17524 Основная волна 07.06.24 (Уровень: Средний)
'''
alphabet = 10 + 52 + 458
print(alphabet)
i = 10  # 2 ** 10 >= alphabet


byte = (276 * 2**10) / 862
print(byte)  # int(327.870)

bit = int(byte) * 2**3
print(bit)  # 2616

symbols = bit / i
print(symbols)  # 261.6
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке: Разобрать сложные 10. На следующем уроке просто решаем вариант - повторение
