# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 15 №16894
# Для какого наименьшего целого неотрицательного числа A выражение
# (2x + 3y ≠ 60) ∨ (A ≥ x) ∨ (A ≥ y)
# тождественно истинно при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (2*x + 3*y != 60) or (A >= x) or (A >= y)


R = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(100) for y in range(100)):
        R.append(A)
print(min(R))
'''


# Тип 15 №34520
# Для какого наименьшего неотрицательного целого числа А формула
# x & 17 = 0 → (x & 29 ≠ 0 → x & А ≠ 0)
# тождественно истинна (т.е. принимает значение 1 при любом неотрицательном целом значении переменной х)?
'''
def F(x, A):
    return (x & 17 == 0) <= ((x & 29 != 0) <= (x & A != 0))


R = []
for A in range(0, 1000):
    if all(F(x, A) for x in range(10000)):
        R.append(A)
print(min(R))
'''


# Тип 15 №59754
# Для какого наибольшего целого неотрицательного числа А выражение
# (x+3y>A) ∨ (x<30) ∨ (y<30) тождественно истинно?
'''
def F(x, y, A):
    return (x+3*y > A) or (x < 30) or (y < 30)


R = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(100) for y in range(100)):
        R.append(A)
print(max(R))
'''

# Вариант 2 (через флаги)
'''
def F(x, y, A):
    return (x+3*y > A) or (x < 30) or (y < 30)


for A in range(300, 1, -1): 
    k = 0
    for x in range(0, 300):
        for y in range(0, 300):
            if F(x, y, A):
                k += 1
    if k == 90_000:
        print(A)
        break
'''


# Тип 15 №29663
# Для какого наибольшего натурального числа А формула
# (A < 50) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 10) → ¬ДЕЛ(x, 12)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
def F(x, A):
    return (A < 50) and ((x % A != 0) <= ((x % 10 == 0) <= (x % 12 != 0)))


R = []
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''


# Тип 15 №58482
# На числовой прямой даны три отрезка: P=[24;77], Q[47;92] и R=[82;116].
#
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
# (¬((x∈Q) → ((x∈P) ∨ (x∈R)))) → (¬(x∈A) → ¬(x∈Q))
# тождественно истинна (то есть принимает значение 1 при любом значении переменной х).
'''
def F(x, a1, a2):
    P = 24 <= x <= 77
    Q = 47 <= x <= 92
    R = 82 <= x <= 116
    A = a1 <= x <= a2
    return ((not(Q <= (P or R)))) <= ((not A) <= (not Q))


R = []
M = [x / 5 for x in range(20*5, 120*5)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))  # 4.0 -> 4, 4.5 -> 5, 4.59999999 -> 5
'''




# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
