# region Домашка: ******************************************************************

'''
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (y <= (not(x <= z))) or w
                if F == 0:
                    print(x, y, z, w)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Адрес сети = IP адрес узла & Маска сети
# & - операция побитовой конъюнкции

# Маска сети имеет длину 32 бит
# Маска всегда имеет вид 1111111...0000
'''
a = 6
b = 12
print(bin(a)[2:])
print(bin(b)[2:])

print(a & b)  # 4

# print(115&255, 192&192, 0&0, 0&0)

# 122.159.136.144
# 01111010.10101010.11111101.00000000
print(int('11111111', 2))  # 255
# 1 байт = 8 бит
# 122
print(bin(122)[2:].zfill(8))  # 01111010
'''

'''
from ipaddress import *
net = ip_network('217.19.128.131/255.255.192.0', 0)
print(net)  # 217.19.128.0/18 -> 18 - это кол-во единиц в маске сети
# 11111111.11111111.11000000.00000000 -> 255.255.192.0

print('.'.join([f'{int(x):b}'.zfill(8) for x in '255.255.192.0'.split('.')]))
'''


# № 11764 (Уровень: Базовый)
# Для узла с IP-адресом 168.224.22.193 адрес сети равен 168.224.16.0.
# Каково наименьшее возможное количество единиц в двоичной записи маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'168.224.22.193/{mask}', 0)
    print(net)

    # 168.224.16.0/20
    # 168.224.16.0/21
'''

'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'168.224.22.193/{mask}', 0)
    if str(net) == f'168.224.16.0/{mask}':
        print(mask)
        break
'''


# № 11763 (Уровень: Базовый)
# Сеть задана IP-адресом 180.23.32.0 и маской сети 255.255.240.0.
# Сколько в этой сети IP-адресов, для которых сумма единиц в двоичной записи IP-адреса чётна?
'''
from ipaddress import *
net = ip_network('180.23.32.0/255.255.240.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 2 == 0:
        cnt += 1
print(cnt)
'''


# № 12947 (Уровень: Базовый)
# Сеть задана IP-адресом 203.111.195.0 и маской сети 255.255.240.0.
# Сколько в этой сети IP-адресов, в двоичной записи которых количество нулей кратно трём,
# а также содержатся три подряд идущие единицы и три подряд идущих нуля одновременно?
'''
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('0') % 3 == 0:
        if '111' in s and '000' in s:
            cnt += 1
print(cnt)
'''


# № 10786 (Уровень: Средний)
# Два узла, находящиеся в разных подсетях, имеют IP-адреса 151.172.115.121 и 151.172.115.156
# В масках обеих подсетей одинаковое количество единиц.
# Укажите наименьшее возможное количество единиц в масках этих подсетей.
'''
from ipaddress import *
R = []
for mask in range(32+1):
    net1 = ip_network(f'151.172.115.121/{mask}', 0)
    net2 = ip_network(f'151.172.115.156/{mask}', 0)
    if net1 != net2:
        R.append(mask)
print(min(R))


# # Укажите наименьшее возможное количество нулей в масках этих подсетей.

from ipaddress import *
R = []
for mask in range(32+1):
    net1 = ip_network(f'151.172.115.121/{mask}', 0)
    net2 = ip_network(f'151.172.115.156/{mask}', 0)
    if net1 != net2:
        print(32 - mask)
        R.append(32 - mask)
print(min(R))
'''


# № 11794 (Уровень: Базовый) 🌶
# Сеть, в которой содержится узел с IP-адресом 223.167.A.167 ,
# задана маской сети 255.255.255.192 , где A - некоторое допустимое для
# записи IP-адреса число. Определите максимальное значение A, для которого
# для всех IP-адресов этой сети в двоичной записи IP-адреса суммарное
# количество нулей в левых двух байтах не больше суммарного количества
# нулей в правых двух байтах.
'''
from ipaddress import *
R = []
for A in range(0, 255+1):
    net = ip_network(f'223.167.{A}.167/255.255.255.192', 0)
    if all(f'{ip:b}'[:16].count('0') <= f'{ip:b}'[16:].count('0') for ip in net):
        R.append(A)
print(max(R))
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 8, 12, 13, 14]
# КЕГЭ  = []
# на следующем уроке:
