# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 8546 (Уровень: Базовый)
'''
from itertools import *
print('1 2 3 4 5 6 7 8 9')
table = '13 18 19 23 24 25 26 31 32 37 38 42 47 52 56 62 65 68 73 74 79 81 83 86 91 97'
graph = 'АБ БА АГ ГА АИ ИА ГЗ ЗГ ГД ДГ ДЗ ЗД ЗИ ИЗ ЗЖ ЖЗ ЖЕ ЕЖ ЕВ ВЕ ЕИ ИЕ ИБ БИ БВ ВБ'
for p in permutations('АБВДГИЖЗЕ'):
    new_table = table
    for i in range(1, 9+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''
# 1 2 3 4 5 6 7 8 9
# Б З И Ж Д Г Е А В


'''
from itertools import *
print('1 2 3 4 5 6 7')
table = '12 14 21 24 26 35 36 41 42 46 47 53 56 62 63 64 65 67 74 76'
graph = 'АБ БА АВ ВА БВ ВБ ВД ДВ ВГ ГВ ВЕ ЕВ ЕД ДЕ ЕГ ГЕ ЕК КЕ ГК КГ'
for p in permutations('АБВДГКЕ'):
    new_table = table
    for i in range(1, 7+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке:
