# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21412 Досрочная волна 2025 (Уровень: Базовый)
# Сеть задана IP-адресом одного из входящих в неё узлов 143.168.72.213
# и сетевой маской 255.255.255.240.
# Определите наибольший IP-адрес данной сети, который может быть присвоен компьютеру.
# В ответе укажите найденный IP-адрес без разделителей.
'''
from ipaddress import *
net = ip_network('143.168.72.213/255.255.255.240', 0)
for ip in net:
    print(ip)  # 143.168.72.222 -> 14316872222
'''


# № 21413 Досрочная волна 2025 (Уровень: Базовый)
'''
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:21]:
    A = int(f'82934{x}2', 21)
    B = int(f'2924{x}{x}7', 21)
    C = int(f'67564{x}8', 21)
    if (A + B + C) % 20 == 0:
        print((A + B + C) // 20)
'''


# № 20905 Апробация 05.03.25 (Уровень: Базовый)
'''
def F(x, a1, a2):
    P = 17 <= x <= 58
    Q = 29 <= x <= 80
    A = a1 <= x <= a2
    return (P) <= (((Q) and (not A)) <= (not P))

R = []
M = [x / 4 for x in range(10 * 4, 90 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))  # 29.0
'''

'''
print(all(x % 2 == 0 for x in [2, 4, 6, 8]))
# Все элементы списка должны быть четные

print(any(x % 2 != 0 for x in [2, 5, 6, 8]))
# Хотя бы один элемент списка должен быть нечетным
'''

# i: 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
# s: 0 1 2 3 4 5 6 7 8 9 A  B  C  D  E  F  G  H  I  J  K

# Четыре вариант подключения библиотек:
'''
import sys
sys.setrecursionlimit(10000)

import sys as s  # короткое имя 
s.setrecursionlimit(10000)

from sys import setrecursionlimit
setrecursionlimit(10000)

from sys import *
setrecursionlimit(10000)
'''


'''
count = 0
from itertools import product  # подключение всего содержимого библиотеки 
for p in product('123', repeat=2):
    count += 1
print(count)
'''


# № 21416 Досрочная волна 2025 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if x < 0]
R = []  # сюда будем записывать результаты
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if max(x, y, z) * min(x, y, z) > sum(A):
        R.append(x + y + z)
print(len(R), max(R))
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ = []
# на следующем уроке: 19-21 код, 22, 24.1 повторять

# Второй пробник 28.02.25:
# Дарья 10/29 -> 51 вторичных баллов +[1, 2, 4, 7, 10, 11, 13, 15, 16, 18] -[3, 6, 12, 22]

