# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print(17 ** 0.5)  # 4.123105625617661
print(int(17 ** 0.5))  # 4 - просто взятие целой части

# 24 [1, 2, 3, 4, {4.898}, 6, 8, 12, 24]
print(24 ** 0.5)  # 4.898

def divisors(x):
    div = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            # делитель слева и его сомножитель справа
            div += [j, x // j]  # j = 4, x = 24, 24 // 4 = 6
    return sorted(set(div))

# Если у числа нет полного квадратного корня, то у него четное кол-во делителей
print(divisors(24))  # [1, 2, 3, 4, 6, 8, 12, 24]

# Если у числа есть полный квадратный корень, то у него нечетное кол-во делителей
print(divisors(16))  # [1, 2, 4, 8, 16]
'''


'''
def divisors(x):
    div = []
    for j in range(2, int(x**0.5)+1):  # 1/2
        if x % j == 0:
            div += [j, x // j]
    return sorted(set(div))


# не считая единицы и самого числа
print(divisors(24))  # [2, 3, 4, 6, 8, 12]
'''

# Номер 25 20814
'''
def divisors(x):
    div = []
    for j in range(2, int(x**0.5)+1):  # 1/2
        if x % j == 0:
            div += [j, x // j]
    return sorted(set(div))

k = 0
for x in range(500_000+1, 10**10):
    d = divisors(x)
    R = sum(d)
    if str(R)[-1] == '9':
        print(x, R)
        k += 1
        if k == 5:
            break
'''
# Ответ:
# 500014 250009
# 500038 495289
# 500040 1170359
# 500054 250029
# 500058 667289






# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке: 8, 22, 25 повторять

# Второй пробник 28.02.25:
# Дарья 10/29 -> 51 вторичных баллов +[1, 2, 4, 7, 10, 11, 13, 15, 16, 18] -[3, 6, 12, 22]

