# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21421 Досрочная волна 2025 (Уровень: Базовый)

# 1A2  2222 20 AAAA20
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-B][0-B]*[02468A])'
M = [x.group() for x in finditer(num, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''


# № 20813 Апробация 05.03.25 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([789][0789]*|[0])'
reg = rf'{num}([-*]{num})*'
M = [x.group() for x in finditer(reg, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''
# 7*9009*9009*9009*9009*9009


# № 21597 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-5][0-5]*|[0])'
reg = rf'{num}([*]{num})*([-]{num})*'
reg = rf'(?=({reg}))'
M = [x.group(1) for x in finditer(reg, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''
# 46      1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1
# 51 3021*1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1

# 5*5*5-5-5-3021*1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1
# 5*5*5-5-5-3021
#                1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1
#           3021*1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1


print(eval('(3 * (2 + 2)) ** 2'))
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-9][0-9]*|[0])'
reg = rf'{num}([+*]{num})*'
reg = rf'(?=({reg}))'
M = [x.group(1) for x in finditer(reg, s)]
maxi = 0
for x in M:
    if eval(x) == 0:
        print(x)
        maxi = max(maxi, len(x))
print(maxi)
'''


# 20969
'''
from fnmatch import *
for x in range(154682, 10**11, 154682):
    if fnmatch(str(x), '*192?3*68'):
        print(x, x // 154682)

from re import *
for x in range(154682, 10**11, 154682):
    if fullmatch('[0-9]*192[0-9]3[0-9]*68', str(x)):
        print(x, x // 154682)
'''

# № 18591 (Уровень: Средний)
'''
from re import *
for x in range(1984, 10**10, 1984):
    if fullmatch('[02468]9[0-9]23[0-9][0-9]*23[13579][02468]', str(x)):
        print(x, x // 1984)
'''















# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ = []
# на следующем уроке: 22, 24.1 повторять

# Второй пробник 28.02.25:
# Дарья 10/29 -> 51 вторичных баллов +[1, 2, 4, 7, 10, 11, 13, 15, 16, 18] -[3, 6, 12, 22]

