

'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:22]:
    A = int(f'27{x}98876', 22)
    B = int(f'26{x}51', 22)
    C = int(f'711{x}5', 22)
    if (A + B + C) % 21 == 0:
        print((A + B + C) // 21)
'''
from traceback import print_tb

# № 22427 (Уровень: Базовый)
# (Л. Шастин)  Операнды арифметического выражения записаны в системах счисления с основаниями
# 4B3x1C7_14 + 5xG83F7_17
# В записи чисел переменной x обозначена неизвестная допустимая
# цифра из алфавита данных систем счисления. Определите наименьшее
# значение x, при котором значение данного арифметического выражения кратно 15.
# Для найденного значения x вычислите частное от деления значения
# арифметического выражения на 15 и укажите его в ответе в десятичной
# системе счисления. Основание системы счисления указывать не нужно.
'''
alp = sorted("0123456789QWERTYUIOPASDFGHJKLZXCVBNM")
for x in alp[:14]:
    A = int(f"4B3{x}1C7",14)
    B = int(f"5{x}G83F7",17)
    if (A + B) % 15 ==0:
        print((A + B) // 15)
'''



# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

print(f'Первый элемент списка М: {M[0]}')
print(f'Последний элемент списка М: {M[-1]}')


# Срезы списков и других последовательностей
'''
# СРЕЗЫ[START:STOP-1:STEP]
print(M[1:3])   # ['b', 'c']
print(M[:3])  # ['a', 'b', 'c']
print(M[1:])  # ['b', 'c', 'd', 'e']

print(M[2:])  # ['c', 'd', 'e'] - все элементы кроме первых двух
print(M[:])  # ['a', 'b', 'c', 'd', 'e']
print(M[::])  # ['a', 'b', 'c', 'd', 'e']

print(M[0::2])  # ['a', 'c', 'e']
print(M[1::2])  # ['b', 'd']

print(M[1:-1])  # ['b', 'c', 'd'] - все кроме первого и последнего
print(M[::-1])  # ['e', 'd', 'c', 'b', 'a']


s = 'abcde'
print(s[::-1])  # edcba
'''


# Функции списков
'''
M = [1, 3, 2, 3, 2, 3]

print(len(M))  # Возвращает кол-во элементов списка
print(sum(M))
print(min(M), max(M))

print(sorted(M))  # [1, 2, 2, 3, 3, 3]
print(sorted(M)[::-1])  # [3, 3, 3, 2, 2, 1]
print(sorted(M, reverse=True))  # [3, 3, 3, 2, 2, 1]

print(set(M))  # {1, 2, 3}
print(len(set(M)))  # 3 - кол-во различных элементов 
'''


# Методы списков
'''
# .append() - добавляет только один элемент в конец списка 
M = [1, 2, 3]
M.append(4)
M.append(5)
print(M)  # [1, 2, 3, 4, 5]

M = M[::-1]
M.append(0)
M = M[::-1]
print(M)  # [0, 1, 2, 3, 4, 5]

M = [1, 2, 3]
M = [0] + M + [4, 5]
print(M)  # [0, 1, 2, 3, 4, 5]


# .count() - возвращает кол-во определенного элемента из списка 
M = [2, '2', 2, '2', 2]
print(len(M))  # 5
print(M.count(2))  # 3
print(M.count(2) + M.count('2'))  # 5
'''

# Генераторы списков

for x in range(10):
    print(x, end=' ')
print()

# Генератор[что_кладем откуда_берем]
print([x for x in range(10)])  # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

print([x * 2 for x in range(10)])  # [0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
print([x ** 2 for x in range(10)])  # [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

print([x ** 2 for x in range(10) if x % 2 == 0])  # [0, 4, 16, 36, 64]


# print([i for i in range(int(input('A: ')), int(input('B: '))+1) if i % 3 == 0])

M = [int(x) for x in open('files/17.txt')]
print([x for x in M if x % 2 == 0])
print([x for x in M if abs(x) % 10 == 3])
print([x for x in M if len(str(abs(x))) == 3])
