# region Домашка: ******************************************************************

'''
import turtle as t
t.tracer(0)
t.screensize(-10000, 10000)
l = 50
t.left(90)
t.down()

t.right(60)
for i in range(2):
    t.forward(7*l)
    t.right(120)
t.right(300)
t.forward(7*l)
for i in range(2):
    t.right(60)
    t.forward(7*l)
    t.right(60)

t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x*l, y*l)
        t.dot(2, 'red')

t.update()
t.done()
'''
import subprocess

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Дана программа для редактора:
# ПОКА нашлось (1111) ИЛИ нашлось (88888)
#   ЕСЛИ нашлось (1111)
# ТО заменить (1111, 888)
#   ИНАЧЕ заменить (88888, 888)

# Какая строка получится в результате применения приведённой выше
# программы к строке, состоящей из 81 идущей подряд цифры 1?
# В ответе запишите полученную строку.
'''
s = '1' * 81
while '1111' in s or '88888' in s:
    if '1111' in s:
        s = s.replace('1111', '888', 1)
    else:
        s = s.replace('88888', '888', 1)

print(s)  # 88881
'''


# Тип 12 №26986
'''
s = '4' * 50 + '7' * 40 + '9' * 40  # Расположенных в произвольном порядке
while '49' in s or '97' in s or '47' in s:
    if '47' in s:
        s = s.replace('47', '74', 1)
    if '97' in s:
        s = s.replace('97', '79', 1)
    if '49' in s:
        s = s.replace('49', '94', 1)
print(s[25-1], s[71-1], s[105-1])
'''


# Тип 12 №33514
'''
for x in range(50):
    for y in range(50):
        for z in range(50):
            s = '0' + '1' * x + '2' * y + '3' * z

            while '01' in s or '02' in s or '03' in s:
                s = s.replace('01', '30', 1)
                s = s.replace('02', '101', 1)
                s = s.replace('03', '202', 1)
            if s.count('1') == 15 and s.count('2') == 10 and s.count('3') == 60:
                print(x)
'''


# На вход приведённой ниже программе поступает строка,
# начинающаяся с символа «>», а затем содержащая
# 10 цифр 1, 20 цифр 2 и 30 цифр 3, расположенных в произвольном порядке.
#
# Определите сумму числовых значений цифр строки, получившейся
# в результате выполнения программы.

# Тип 12 №23912
'''
s = '>' + '1' * 10 + '2' * 20 + '3' * 30
while '>1' in s or '>2' in s or '>3' in s:
    if '>1' in s:
        s = s.replace('>1', '22>', 1)
    if '>2' in s:
        s = s.replace('>2', '2>', 1)
    if '>3' in s:
        s = s.replace('>3', '1>', 1)
print(s)

# Вариант 1
print(s.count('1') + s.count('2') * 2)

# Вариант 2
print(sum([int(x) for x in s[:-1]]))
print(sum([int(x) for x in s if x.isdigit()]))
# ValueError: invalid literal for int() with base 10: '>'

# Вариант 3
print(sum(map(int, s[:-1])))
'''


# Тип 12 №27013
# Дана программа для Редактора:
# ПОКА нашлось (11)
#   ЕСЛИ нашлось (112)
#       ТО заменить (112, 6)
#   ИНАЧЕ заменить (11, 3)
#
# Исходная строка содержит десять единиц и четыре двойки,
# других цифр нет, точный порядок расположения единиц и двоек неизвестен.
# Какую наибольшую сумму цифр может иметь строка, которая получится
# после выполнения программы?

'''
from itertools import *
R = []
for p in product('12', repeat=14):
    if p.count('2') == 4:
        s = ''.join(p)

        while '11' in s:
            if '112' in s:
                s = s.replace('112', '6', 1)
            else:
                s = s.replace('11', '3', 1)
        summa = sum(map(int, s))
        R.append(summa)
print(max(R))
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14]
# КЕГЭ  = []
# на следующем уроке:
