# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Задание 13 https://education.yandex.ru/ege/task/311278cb-12ec-4f14-bde6-571d7045cc02
'''
from ipaddress import *
for mask in range(32):
    net = ip_network(f'111.81.208.27/{mask}', 0)
    print(net, mask, net.netmask)
    # 111.81.192.0/18 18 255.255.192.0
    # 111.81.192.0/19 19 255.255.224.0
'''


# Задание 13 https://education.yandex.ru/ege/task/b5ea1e82-76f7-4781-8ef4-5f462fdc7638

from ipaddress import *
for mask in range(32):
    net1 = ip_network(f'151.172.115.121/{mask}', 0)
    net2 = ip_network(f'151.172.115.156/{mask}', 0)
    if net1 != net2:
        print(mask)

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 18, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
