# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# (x -> y and z or w) => (x -> ((y and z) or w))


# Тип 2 №27371
# Логическая функция F задаётся выражением
# ((x ∧ ¬y) → (¬z ∨ ¬w)) ∧ ((w→x) ∨ y).
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x and (not y)) <= ((not z) or (not w))) and ((w <= x) or y)
                if F == 0:
                    print(x, y, z, w, int(F))
'''


# № 17665 Пересдача 04.07.24 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции
# F=(z→¬(y→x))∨w
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (z <= (not (y <= x))) or w
                if F == 0:
                    print(x, y, z, w, int(F))
'''


# № 16368 ЕГКР 27.04.24 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции
# F=¬(x∨y)∧¬w∨¬(z∨w)∧y
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (not(x or y)) and (not w) or (not(z or w)) and y
                if F == 1:
                    print(x, y, z, w, int(F))
'''

# Тип 2 №68264
# Логическая функция F задаётся выражением:
# ((y ∨ z) → (z ∧ w)) ≡ ¬ ((x ∧ z) → (w ∨ y)).
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((y or z) <= (z and w)) == (not((x and z) <= (w or y)))
                if F == 1:
                    print(x, y, z, w, int(F))
'''


# КЕГЭ № 9149 (Уровень: Базовый)
# (Е. Джобс) Миша заполнял таблицу истинности
# логической функции F = ((x → y) ∨ (z ≡ x)) ∧ (w → z)
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x <= y) or (z == x)) and (w <= z)
                if F == 0:
                    print(x, y, z, w, int(F))

for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x <= y) or (z == x)) and (w <= z)
                if F == 1:
                    print(x, y, z, w, int(F))
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2]
# КЕГЭ  = []
# на следующем уроке:
