# region Домашка: ******************************************************************
'''
n = int(input())
s = bin(n)[2:]
print(s)

n = int(input())
s = f'{n:b}'
print(s)

n = int(input())
s = ''
while n > 0:
    s += str(n % 2)
    n //= 2
s = s[::-1]
print(s)
'''

# Переставь местами
# На вход программе подается строка текста.
# Напишите программу, которая разрежет ее на две равные части,
# переставит их местами и выведет на экран.
'''
s = input()
l = len(s)
print(l)
first_s = s[:l//2+1]
print(first_s)
second_s = s[l//2+1:]
print(second_s)
new_s = second_s + first_s
print(new_s)
'''
'''
s = input()
if s.count('X') + s.count('Y') != len(s):
    print('Строка не удовлетворяет условию.')
else:
    summa = 0
    for i in range(len(s)):
        if s[i] == 'Y':
            summa += i
    print(summa)
'''
# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 5 №60247
'''
R = []
for n in range(1, 10000):
    s = f'{n:b}'
    if n % 3 == 0:
        s += s[-3:]
    else:
        x = (n % 3) * 3
        s += f'{x:b}'
    r = int(s, 2)
    if r > 151:
        R.append(r)

print(min(R))
'''

# n = 12
# s = f'{n:b}'
# if n % 3 == 0:
#     s += s[-3:]
# else:
#     x = (n % 3) * 3
#     s += f'{x:b}'
# r = int(s, 2)
# print(r)


# Тип 5 №27535
# Автомат обрабатывает натуральное число N по следующему алгоритму:
# 1. Строится двоичная запись числа N.
# 2. В конец двоичной записи добавляются две первые цифры этой записи
# в обратном порядке.
# 3. Результат переводится в десятичную систему и выводится на экран.
# При каком наименьшем исходном N результат на экране автомата будет больше 90?
'''
for n in range(1, 10000):
    s = f'{n:b}'
    s += s[::-1][:2]
    r = int(s, 2)
    if r > 90:
        print(n)
        break
'''


# Тип 5 №58513
'''
for n in range(1000000, 0, -1):
    s = f'{n:b}'
    if n % 5 == 0:
        s += f'{5:b}'
    else:
        s += '1'
    if int(s, 2) % 7 == 0:
        s += f'{7:b}'
    else:
        s += '1'
    r = int(s, 2)
    if r < 1_855_663:
        print(n)
        break
'''





# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# todo Разобрать, как решить авторскую задачку
'''
cnt = 0
for n in range(10**8, 10**9+1):
    s = f'{n:b}'
    for _ in range(3):
        summa = sum([int(x) for x in str(int(s, 2))])
        if summa % 2 != 0:
            s += '1'
        else:
            s += '0'
    r = int(s, 2)
    if 987_654_321 <= r <= 2_123_456_789:
        cnt += 1
        print(cnt)
'''

# Тип 5 №15818
'''
R = []
for n in range(1, 10000):
    s = f'{n:b}'
    s += str(s.count('1') % 2)
    s += str(s.count('1') % 2)
    r = int(s, 2)
    if r > 93:
        R.append(r)
print(min(R))
'''

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6]
# КЕГЭ  = []
# на следующем уроке:
