# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
from itertools import *
R = []
for p in permutations('ПАРИЖАНКА'):
    word = ''.join(p)
    slovo = word  # копия для второго условия
    slovo = slovo.replace('И', 'А')
    if slovo.count('АА') == 1 and 'ААА' not in slovo:
        R.append(word)
print(len(set(R)))
'''

alphabet = sorted('01234567890qwertyuiopasdfghjklzxcvbnm')


def my_convert(a, b):
    res = ''
    while a:
        res += alphabet[a % b]
        a //= b
    return res[::-1]


x = 5 * 729 ** 2024 + 3 * 243 ** 1413 - 7 * 81 ** 169 - 2 * 9 ** 107 + 3017
s = my_convert(x, 27)
summ = 0
for i in s:
    if i in alphabet[0::2]:
        if i < 'o':
            summ += alphabet.index(i)
print(summ)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = []
# на следующем уроке:

