# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    if len(set(M)) == 5:  # set(4 5 6 6) => {4 5 6}
        plus = [x for x in M if x > 0]
        minus = [abs(x) for x in M if x < 0]
        if sum(minus) > sum(plus):
            cnt += 1
print(cnt)
'''

k = 0
count = 0
for s in open('files/9.csv'):
    m = [int(x) for x in s.split(',')]
    count += 1
    ss = [x for x in m if m.count(x) >= 2]
    if (sorted(m) == m) or (len(ss) >= 2):
        k += count
print(k)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
