# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации
# 1 бит - это минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 МКбайт - 2**30 байт - 2**33 бит

# photo_bit = pixels * i, где i - это кол-во бит на один пиксель
# colors = 2 ** i

# № 19568 (Уровень: Средний)
'''
pixels = 3840 * 2160
i = 24
photo_bit = pixels * i  # бит вес одной фотографии
card = 8 * 2**33  # бит на карте
photo_all = card / photo_bit
print(photo_all)  # 345.210
print(127 * 345 + 25)  # 43840
'''


# № 19557 (Уровень: Базовый)
'''
pixels = 1920 * 1080
colors = 2048  # 2 ** 11 >= 2048
i = 11
photo_bit = pixels * i
photo_all = photo_bit * 313
print(photo_all / 2**23)  # бит - 2**3 байт -  2**10 Кбайт - 2**10 Мбайт
# 851.0833
'''
# Ответ: 852


# l;;;;;print(14400 * 3 + 11000 + 4800*3 + 7200*2 + 8000*3+ 4000 + 10000 + 10800 + 8800)

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = []
# на следующем уроке:

