# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# 1. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение 5 процессов

# 2. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение максимального кол-ва процессов
# а время окончания работы всех процессов минимально.

# 3. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение максимального кол-ва процессов
# а время окончания работы каждого процесса минимально.

# 4. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение максимального кол-ва процессов


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = []
# на следующем уроке:

