# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Задание 1 https://education.yandex.ru/ege/task/f0d37846-6c0e-4eb6-9780-20af718e47b6
'''
from itertools import permutations
print('1 2 3 4 5 6 7 8')
table = '12 13 16 21 23 26 31 32 34 35 36 37 38 43 45 53 54 57 61 62 63 73 75 78 83 87'
graph = 'ЖЗ ЗЖ ЖБ БЖ БЗ ЗБ БВ ВБ ЖВ ВЖ ВА АВ БА АБ БЕ ЕБ БГ ГБ ДГ ГД ДЕ ЕД ЕГ ГЕ ДБ БД'
for p in permutations('АБВГДЖЗЕ'):
    # ('Е', 'З', 'Д', 'Ж', 'Б', 'Г', 'В', 'А')
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
