# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21718 ЕГКР 19.04.25 (Уровень: Базовый)
'''
from fnmatch import *
for x in range(7993, 10**10, 7993):
    if fnmatch(str(x), '4*4736*1'):
        print(x, x // 7993)
'''

# № 20288 (Уровень: Средний)
'''
from re import *
for x in range(9231, 10**10, 9231):
    if fullmatch('[02468]*12[13579]4[13579]', str(x)):
        print(x, x // 9231)
'''
# 608812143 65953
# 2086012149 225979
# 4440212541 481011
# 6286412541 681011
# 8486012145 919295


# № 19255 ЕГКР 21.12.24 (Уровень: Базовый)
# Среди натуральных чисел, не превышающих 10**10,
# найдите все числа, соответствующие маске 54?1?3*7,
# делящиеся на 18579 без остатка.
'''
from re import *
for x in range(18579, 10**10, 18579):
    if fullmatch('54[0-9]1[0-9]3[0-9]*7', str(x)):
        print(x, x // 18579)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ = []
# на следующем уроке:

# Второй пробник 28.02.25:
# Дмитрий 14/29 -> 62 вторичных баллов +[1, 3, 4, 5, 8, 9, 12, 15, 16, 17, 23, 18, 19-21] -[13, 14, 22]


