# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации
# 1 бит - это минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 МКбайт - 2**30 байт - 2**33 бит


# https://education.yandex.ru/ege/task/e981a8c4-5b49-4b78-8dea-e70229591c14
'''
U = 768 * 2**13  # бит/с

a = 4  # квадро - 4 канала
b = 44000  # Гц
c = 16 * 2**3  # бит
t = 3 * 60  # сек
V = a * b * c * t  # бит - вес нашего звукового фрагмента

print(V / U)  # 644.53125 сек
'''


# https://education.yandex.ru/ege/task/21c8d3fd-6a3a-4352-aaa3-fcfd629d1c75
'''
a = 2
t = 10*60
b = 192000
c = 24
V = a * b * c * t  # общий вес всех частей

v = 12800 * 20  # вес одной части
print(V / v)  # 21600
'''


# https://education.yandex.ru/ege/task/eb4d9b1f-9e48-4163-a44c-78007d760e63

'''
a = 2
b = 48000
t = 150
c = 16
V = a * b * c * t
V = V * 0.5

print((V / 3200) / 60 / 60)
'''
print(100 / 1.4)

print((1.5 * 2**23) / 1.4 / 5040)
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 26.1]
# КЕГЭ  = []
# на следующем уроке:

