# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 18313 (Уровень: Средний)
'''
sym = 25
alp = 10 + 26 + 26 + 465
print(alp)  # 527 >= 2 ** i
i = 10  # бит на один символ
bit = sym * i
print(bit / 8)  # 31.25
byte = 32

# d = dop + pas (byte)
d = (77 * 2 ** 10) / 1500
print(d - byte)  # 20.56533
'''

# № 20805 Апробация 05.03.25 (Уровень: Средний)
'''
sym = 248
# alp - ?
# i - ?

# 75 600 серийных номеров требуется более 16 Мбайт памяти.
byte = (16 * 2 ** 20) / 75_600
print(byte)  # 221.920
byte = 222
bit = byte * 8
# bit = sym * i
i = bit / sym
print(i)  # 7.1612
i = 8
print(2 ** 8)  # 256


alp = 128  # i = 7
alp = 129  # i = 8
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = [23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Dmitry 11/14 -> 54 вторичных баллов +[1, 2, 4-7, 10-12, 14, 25] -[3, 8, 13]

# Второй пробник 28.02.25:
# Dmitry 13/16 -> 58 вторичных баллов +[1-5, 7, 8, 12, 14-16, 23, 25] -[6, 9, 13, 17]
