# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


def F(a, b):
    if a >= b:
        return a == b  # True/False
    h = [F(a + 2, b), F(a * 2, b)]
    return sum(h)

# № 20811 Апробация 05.03.25 (Уровень: Базовый)
# 1 куча: +1, +4, *2 | >= 51 | 1 ≤ S ≤ 50

# s - это кол-во камней в куче
# n - это шаг игры

# n = 1: Петя первый ход
# n = 2: Ваня первый ход
# n = 3: Петя второй ход
# n = 4: Ваня второй ход
'''
def F(s, n):
    if s >= 51:
        return n % 2 == 0  
    if n == 0:
        return 0
    h = [F(s+1, n-1), F(s+4, n-1), F(s*2, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)

print([s for s in range(1, 51) if F(s, 2)])
print([s for s in range(1, 51) if F(s, 3) and not F(s, 1)])
print([s for s in range(1, 51) if F(s, 4) and not F(s, 2)])
'''

# № 17875 Демоверсия 2025 (Уровень: Базовый)
'''
from math import ceil, floor

def F(s, n):
    if s <= 19:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s-2, n-1), F(s-5, n-1), F(floor(s/3), n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)

print([s for s in range(20, 2000) if F(s, 2)])
print([s for s in range(20, 2000) if F(s, 3) and not F(s, 1)])
print([s for s in range(20, 2000) if F(s, 4) and not F(s, 2)])
'''

# № 17532 Основная волна 07.06.24 (Уровень: Базовый)

def F(a, s, n):
    if a + s >= 65:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(a+1, s, n-1), F(a, s+1, n-1), F(a*3, s, n-1), F(a, s*3, n-1)]
    # return any(h) if (n - 1) % 2 == 0 else any(h)  # После неудачного первого хода Пети.
    return any(h) if (n - 1) % 2 == 0 else all(h)  # При любой игре Пети.

print([s for s in range(1, 59) if F(6, s, 2)])  # [7, 8,
print([s for s in range(1, 59) if F(6, s, 3) and not F(6, s, 1)])  # [10, 19]
print([s for s in range(1, 59) if F(6, s, 4) and not F(6, s, 2)])  # [18]

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = [23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Dmitry 11/14 -> 54 вторичных баллов +[1, 2, 4-7, 10-12, 14, 25] -[3, 8, 13]

# Второй пробник 28.02.25:
# Dmitry 13/16 -> 58 вторичных баллов +[1-5, 7, 8, 12, 14-16, 23, 25] -[6, 9, 13, 17]
