# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# 9)
'''
counter = 0
for x in open('0. files/9.csv'):
    M = [int(i) for i in x.split(';')]
    copied = [i for i in M if M.count(i) == 2]
    uncopied = [i for i in M if M.count(i) == 1]
    if len(copied) == 4 and len(uncopied) == 3:
        if (sum(copied) / len(copied)) < (sum(uncopied) / len(uncopied)):
            counter += 1
print(counter)
'''

# net - Адрес сети
# Адрес сети = Узел сети & Маска сети
# net = ip_network(f'узел сети №/ маска сети', 0)

# 13)
'''
from ipaddress import *
for mask in range(33):
    net = ip_network(f'111.118.179.50/{mask}', 0)
    if '111.118.178.0' in str(net):
        print(net, net.netmask)  # 111.118.178.0/23 255.255.254.0
'''

# 17)
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5]
B = [x for x in M if abs(x) % 100 == 29]
R = []
for i in range(len(M)-2):
    # x, y, z = M[i], M[i+1], M[i+2]
    x, y, z = M[i:i+3]
    if (x in A) + (y in A) + (z in A) == 2:  # из трёх элементов тройки пятизначными числами являются только два,
        if (x + y + z) <= max(B):  # сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 29.
            R.append(x + y + z)
print(len(R), max(R))
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = [23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Dmitry 11/14 -> 54 вторичных баллов +[1, 2, 4-7, 10-12, 14, 25] -[3, 8, 13]

# Второй пробник 28.02.25:
# Dmitry 13/16 -> 58 вторичных баллов +[1-5, 7, 8, 12, 14-16, 23, 25] -[6, 9, 13, 17]
