# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# узел & маска = адрес сети
# узел - knot
# маска - mask
# адрес сети - net

from ipaddress import *
# адрес сети = ip_network('узел/маска', 0)


from ipaddress import *
net = ip_network('214.96.0.0/255.240.0.0', 0)
print(net)  # 214.96.0.0/12, где 12 - это кол-во единиц в маске
print(net.network_address)  # 214.96.0.0 - адрес сети
print(net.netmask)  # 255.240.0.0 - маска сети
print(net.num_addresses)  # 1048576 - кол-во айпи адресов в сети

# 255.240.0.0  -> 111111...000000 (32)
# 11111111.11110000.00000000.00000000 -> 12 (12 единиц в маске)
# Вариантов масок всего 32
'''

# Первый прототип:
'''
from ipaddress import *
net = ip_network('214.96.0.0/255.240.0.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('0') % 3 == 0:
        cnt += 1
print(cnt)
'''


# Второй прототип:
'''
from ipaddress import *
cnt = 0
for mask in range(32+1):
    net1 = ip_network(f'201.44.240.33/{mask}', 0)
    net2 = ip_network(f'201.44.240.107/{mask}', 0)
    if net1 == net2:
        net = net1.network_address
        s = f'{net:b}'
        if s.count('1') >= 5:
            # print(net1.netmask)
            cnt += 1
print(cnt)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = [23]
# на следующем уроке:


# Первый пробник 21.12.24:
# Dmitry 11/14 -> 54 вторичных баллов +[1, 2, 4-7, 10-12, 14, 25] -[3, 8, 13]
