




# № 29353 Открытый вариант 2026(Уровень: Базовый)
# У исполнителя есть три команды, которые обозначены латинскими буквами:
# A. Прибавить 1
# B. Умножить на 2
# C. Умножить на 3

# Сколько существует программ, для которых при исходном числе 2 результатом
# является 39 и при этом траектория вычислений не содержит числа 14?
'''
def F(a, b):
    if a > b or a == 14:
        return 0
    elif a == b:
        return 1
    else:
        return F(a + 1, b) + F(a * 2, b) + F(a * 3, b)

print(F(2, 39))


# Вариант 2

def F(a, b):
    if a >= b or a == 14:
        return a == b
    return F(a + 1, b) + F(a * 2, b) + F(a * 3, b)

print(F(2, 39))
'''



# № 28942 ЕГКР 18.04.26(Уровень: Базовый)
# У исполнителя есть три команды, которые обозначены латинскими буквами:
# A. Вычти 3
# B. Вычти 8
# C. Найди целую часть от деления на 2

# Сколько существует программ, для которых при исходном
# числе 76 результатом является число 12, и при этом траектория
# вычислений содержит число 41 и не содержит 73?
'''
def F(a, b):
    if a < b or a == 73:
        return 0
    elif a == b:
        return 1
    else:
        h = [F(a - 3, b), F(a - 8, b), F(a // 2, b)]
        return sum(h)

print(F(76, 41) * F(41, 12))
'''


# № 23759 Демоверсия 2026(Уровень: Базовый)
# 1 куча: s-3, s-5, s / 4 (до маньшего) | s <= 30 | s >= 31
'''
from math import floor, ceil
def F(s, n):
    if s <= 30:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s - 3, n - 1), F(s - 5, n - 1), F(floor(s / 4), n - 1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)
    return any(h) if (n - 1) % 2 == 0 else any(h)

print(19, [s for s in range(31, 1000) if F(s, n=2)])
print(20, [s for s in range(31, 1000) if F(s, n=3) and not F(s, n=1)])
print(21, [s for s in range(31, 1000) if F(s, n=4) and not F(s, n=2)])
'''

# № 22437 (Уровень: Базовый)
# (Л. Шастин). Два игрока, Петя и Ваня, играют в следующую игру.
# Перед игроками лежит куча камней.
# - добавить в кучу 4 камня;
# - добавить в кучу 7 камней;
# - увеличить количество камней в куче в 4 раза.

# Победителем считается игрок, сделавший последний ход,
# т.е. первым получивший кучу из 471 или более камней.
# В начальный момент в куче было S камней; 1 ≤ S ≤ 470.


# 1 куча: +4, +7, *4 \ s >= 471 \ s < 471
'''
def F(s, n):
    if s >= 471:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s+4,n-1), F(s+7, n-1), F(s*4, n-1)]
    return any(h) if (n-1) % 2 == 0 else all(h)

print(19, [s for s in range(1, 470+1) if F(s, n = 2)])
print(20, [s for s in range(1, 470+1) if F(s, n = 3) and not F(s, n=1)])
print(21, [s for s in range(1, 470+1) if F(s, n = 4) and not F(s, n=2)])
'''


#
# № 22066 (Уровень: Базовый)
# 2 кучи: s1+3, s2+3, s1*2, s2*2 | s1 + s2 >= 100 | s1 = 17  | 1 <= s2 <= 82
'''
def F(s1, s2, n):
    if s1 + s2 >= 100:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s1+3, s2, n -1 ), F(s1, s2+3, n -1 ), F(s1 * 2, s2, n -1 ), F(s1, s2 * 2, n -1 )]
    return any(h) if (n - 1) % 2 == 0 else all(h)
    return any(h) if (n - 1) % 2 == 0 else any(h)

print(19, [s2 for s2 in range(1, 82+1) if F(17, s2, n=2)])
print(19, [s2 for s2 in range(1, 82+1) if F(17, s2, n=3) and not F(17, s2, n=1)])
print(19, [s2 for s2 in range(1, 82+1) if F(17, s2, n=4) and not F(17, s2, n=2)])
'''


# № 31516 Демоверсия 2027(Уровень: Базовый)
# Два игрока, Петя и Ваня, играют в следующую игру.
# Перед игроками лежат две кучи камней. Игроки ходят по очереди,
# первый ход делает Петя. За один ход игрок может:
# – добавить в одну из куч (по своему выбору) 4 камня;
# – увеличить количество камней в одной из куч (по своему выбору) в 2 раза.


# Победителем считается игрок, сделавший последний ход,
# то есть первым получивший такую игровую позицию, при которой
# в двух кучах суммарно 133 камня или больше.

# В начальный момент в первой куче было 17 камней,
# во второй куче – S камней; 1 ≤ S ≤ 115.

# Известно, что Ваня выиграл своим первым ходом.
# Укажите минимальное значение S, при котором такая ситуация возможна.

def F(s1, s2, n):
    if s1 + s2 >= 133:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s1 + 4, s2, n - 1), F(s1, s2 + 4, n - 1), F(s1 * 2, s2, n - 1), F(s1, s2 * 2, n - 1)]
    # return any(h) if (n-1) % 2 == 0 else all(h)
    return any(h) if (n - 1) % 2 == 0 else any(h)


print(19, [s2 for s2 in range(1, 116) if F(17, s2, n=2)])
print(20, [s2 for s2 in range(1, 116) if F(17, s2, n=3) and not F(17, s2, n=1)])
print(21, [s2 for s2 in range(1, 116) if F(17, s2, n=4) and not F(17, s2, n=2)])



















