



#
# № 31128 Основная волна 18.06.26(Уровень: Средний)
# Исполнитель преобразует число на экране.
# У исполнителя есть две команды, которые обозначены латинскими буквами:
# A. Прибавь 1
# B. Поменяй местами
# Первая из этих команд увеличивает число на экране на 1.
# Вторая команда применяется только к числу, у которого цифра
# в разряде десятков по значению меньше цифры, стоящей в разряде
# единиц, и действует, заменяя число на экране числом, в котором
# цифры двух младших разрядов поменялись местами.

# Сколько существует программ, для которых при исходное числе 100 результатом является число 150?
'''
def F(a, b):
    if a >= b:
        return a == b

    c = str(a)
    if c[-2] < c[-1]:
        return F(a + 1, b) + F(int( c[0] + c[-1] + c[-2] ), b)
    else:
        return F(a + 1, b)

print(F(100, 150))
'''




# № 31513 Демоверсия 2027(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n) = 1 при n=1;
# F(n) = n × F(n−1), если n>1.
# Чему равно значение выражения (F(3038)+5×F(3037)) / F(3036) ?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print(  (F(3038) + 5 * F(3037)) // F(3036)  )
#  [Previous line repeated 996 more times]
# RecursionError: maximum recursion depth exceeded
'''



# № 20906 Апробация 05.03.25(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где  n – натуральное число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=n×F(n−1), если n>1.
# Чему равно значение выражения (F(2024)/4+F(2023))/F(2022)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print( (F(2024) // 4 + F(2023)) // F(2022)  )
#     print( (F(2024) / 4 + F(2023)) / F(2022)  )
#             ~~~~~~~~^~~
# OverflowError: integer division result too large for a float
'''



# № 23275 Основная волна 11.06.25(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n) и G(n), где  n – целое число, задан следующими соотношениями:
# F(n)=2×(G(n−3)+8);
# G(n)=2×n, если n<10.
# G(n)=G(n−2)+1, если n≥10.
# Чему равно значение выражения F(15548)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    return 2 * (G(n - 3) + 8)

def G(n):
    if n < 10:
        return 2 * n
    if n >= 10:
        return G(n - 2) + 1

print(F(15548))
'''

# Вариант 2
'''
from functools import *

@lru_cache(None)
def F(n):
    return 2 * (G(n - 3) + 8)

@lru_cache(None)
def G(n):
    if n < 10:
        return 2 * n
    if n >= 10:
        return G(n - 2) + 1

for n in range(16000):
    G(n)

print(F(15548))
'''

# № 18931 Новогодний вариант 2025(Уровень: Базовый)
# Снежная Королева создала волшебную функцию
# F(n), которая помогает ей вычислять силу зимы.
# Эта функция определяется следующим образом:
# F(n)=n−1, при  n⩽3;
# F(n)=F(n−2)+n/2−F(n−4), если n>3 и n чётно;
# F(n)=F(n−1)×n+F(n−2), если n>3 и n нечётно,
# где n – целое неотрицательное число.
#
# Королева решила узнать, насколько велика сила зимы
# в её королевстве. Для этого вычислите значение выражения:

# F(4952)+2×F(4958)+F(4964).
'''
from functools import *

@lru_cache(None)
def F(n):
    if n <= 3:
        return n - 1
    if n > 3 and n % 2 == 0:
        return F(n - 2) + n / 2 - F(n - 4)
    if n > 3 and n % 2 != 0:
        return F(n - 1) * n + F(n - 2)

for n in range(0, 5000, 1):
    F(n)

print(F(4952)+2 * F(4958)+F(4964))
'''


# № 14334 (Уровень: Базовый)
# (Л. Шастин) Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=n, если n>10000;
# F(n)=5⋅F(n+3), если n<10001.
# Чему равно значение выражения F(4625)/F(4640)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n > 10000:
        return n
    if n < 10001:
        return 5 * F(n + 3)

for n in range(11000-1, -1, -1):
    F(n)

print(F(4625) / F(4640))
'''



# № 25355 ЕГКР 13.12.25(Уровень: Базовый)
# Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:

# F(n)=F(n−4)+3580, если n≥19;
# F(n)=6×(G(n−7)−36), если  n<19;

# G(n)=n/20+28, если n≥248045;
# G(n)=G(n+9)−4, если n<248045.
# Чему равно значение функции F(673)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n >= 19:
        return F(n - 4) + 3580
    if n < 19:
        return 6 * (G(n - 7) - 36)

@lru_cache(None)
def G(n):
    if n >= 248045:
        return n / 20 + 28
    if n <= 248045:
        return G(n + 9) - 4

for n in range(250_000-1, -1, -1):
    G(n)

for n in range(700):
    F(n)

print(F(673))
'''



# № 25398 (Уровень: Средний)
# (Р. Косов) Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−6)+2048, если n>30;
# F(n)=3×(G(n−5)+13), если n≤30;

# G(n)=2×n+50, если n≥221337;
# G(n)=G(n+11)−48, если n<221337.
# Чему равно значение функции F(5078)?

