# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# https://education.yandex.ru/ege/task/e0309b53-310b-4c80-a557-c75800407e4c
'''
pixels = 1440 * 900
i = 11
I = pixels * i
cnt = 32 * 256
Kbyte = (I * cnt) / 2**13
print(Kbyte / 21600)
'''


# Единицы измерения информации
# 1 бит - минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# Прототип номер 1 (картинки)
# colors <= 2**i  |  128 <= 2**7 -> i = 7   129 <= 2**8 -> i = 8
# I = pixels * i   i - это кол-во бит на один пиксель
# i = I / pixels
# pixels = I / i


# Прототип номер 2 (музыка)
# I = v * i * n * t
# v - кол-во каналов (шт)   моно-1, стерео-2, квадра-4
# i - частота дискретизации (в Гц)
# n - глубина кодирования (бит)   | 256 уровней дискретизации -> 2**8 = 256 -> n = 8
# t - длительность записи (сек)


# https://education.yandex.ru/ege/task/32b13529-3681-4545-9ca9-fa9a88849498
# I = v * i * n * t

v = 4
n = 8
t = 8*60 + 32
I = 62.5 * 2**23
i = I / (v * n * t)
print(i)

print(2.5 * 2**10)

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7?, 8, 9, 10?, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ = [9, 13, 19-21, 22, 24, 25]
# на следующем уроке:


# Первый пробник 21.12.24:
# Ефим 12/25 -> 56 вторичных баллов +[1-4, 7, 8, 11, 14-18] -[5, 6, 9, 10, 12, 19-21, 22, 23, 24, 25]
