# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# № 21901 Открытый вариант 2025 (Уровень: Базовый)
'''
def F(x, A):
    return ((x & 52 != 0) and (x & 48 == 0)) <= (x & A != 0)


for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


# Единицы измерения информации
# 1 бит - это минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит

#
# № 9834 Основная волна 27.06.23 (Уровень: Базовый)
'''
sym = 10
alp = 52  # alp = 2 ** i
i = 6  # 2 ** 6 >= 52
# i - это кол-во бит на один символ

bit = sym * i  # бит на один пароль
print(bit / 8)  # 7.5 -> 8

byte = 8  # байт на один пароль

print((byte * 65536) / 2**10)
'''

# № 11660 (Уровень: Базовый)
'''
sym = 35
alp = 4090 + 10
i = 13  # 2 ** 13 >= 4100

bit = sym * i
print(bit / 8)  # 56.875 -> 57
byte = 57  # байт на один пароль

user =  96000 / 300
print(user)  # 320.0

print(user - byte)  # 263
'''


# № 21897 Открытый вариант 2025 (Уровень: Базовый)
# Известно, что для хранения 703 569 серийных номеров доступно не более 77 Мбайт памяти.
'''
# bit = sym * i

sym = 246
# alp - ?
# i - ?

byte = 77 * 2 ** 20 / 703_569
print(byte)  # 114.758 -> 114
bit = 114 * 8
i = bit / sym
print(i)  # 3.7073 -> 3

i = 3  # alp[2**2+1  : 2**3]
i = 3  # alp[5  : 8]

alp = 4  # i = 2

alp = 17  # i = 5

alp = 16  # i = 4
alp = 12   # i = 4
alp = 9  #  i = 4

alp = 8  # i = 3
'''
# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7?, 8, 9, 10?, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ = [9, 13, 19-21, 22, 24, 25]
# на следующем уроке:


# Первый пробник 21.12.24:
# Ефим 12/25 -> 56 вторичных баллов +[1-4, 7, 8, 11, 14-18] -[5, 6, 9, 10, 12, 19-21, 22, 23, 24, 25]
