# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# Узел сети & Маска сети = Адрес сети (net)
# & - операция побитовой конъюнкции
# print(14 & 5)  # 4

# 87.226.26.72, на каждое число выделяется по 8 бит
# то бишь числа лежат в диапазоне от 0 до 255, 255 -> 11111111

# Маска сети имеет длину 32 бита и вид: 111111....00000

print('.'.join([bin(int(x))[2:].zfill(8) for x in '255.255.255.252'.split('.')]))
#  11111111.11111111.11111111.11111100 - пример маске сети

# Сеть задана IP-адресом 87.226.26.72 и маской сети 255.255.255.252.
# Сколько в этой сети IP-адресов,
# у которых количество нулей в двоичной записи IP-адреса чётно?

# № 11773 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('87.226.26.72/255.255.255.252', 0)
# print(net)  # 87.226.26.72/30 - 30 это кол-во единиц в маске сети
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('0') % 2 == 0:
        cnt += 1
print(cnt)
'''


# № 11764 (Уровень: Базовый)
'''
from ipaddress import *
for mask in range(32+1):  # перебираем кол-во единиц в маске сети
    net = ip_network(f'168.224.22.193/{mask}', 0)
    if '168.224.16.0' in str(net):
        print(net, mask)
        # 168.224.16.0/20 20
        # 168.224.16.0/21 21
'''

# № 11768 (Уровень: Базовый)
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'143.172.12.114/{mask}', 0)
    if '143.172.8.0' in str(net):
        print(net, net.netmask)
        # 143.172.8.0/21 255.255.248.0
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7?, 8, 9, 10?, 11?, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ = [9, 13, 22, 24, 25]
# на следующем уроке:


# Первый пробник 21.12.24:
# Ефим 12/25 -> 56 вторичных баллов +[1-4, 7, 8, 11, 14-18] -[5, 6, 9, 10, 12, 19-21, 22, 23, 24, 25]
