# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

from itertools import permutations
print('1 2 3 4 5 6 7 8')
table = '15 18 23 25 27 32 35 46 47 51 52 53 64 68 72 74 78 81 86 87'
graph = 'ЕГ ГЕ ЕД ДЕ ГД ДГ ГВ ВГ ДБ БД БА АБ АВ ВА АК КА КЖ ЖК ЖВ ВЖ'
for p in permutations('АБВГДЖКЕ'):
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(graph.split()) == set(new_table.split()):
        print(*p)

# 1 2 3 4 5 6 7 8
# Б Г Е Ж Д К В А


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7?, 8, 9, 10?, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ = [9, 13, 19-21, 22, 24, 25]
# на следующем уроке:


# Первый пробник 21.12.24:
# Ефим 12/25 -> 56 вторичных баллов +[1-4, 7, 8, 11, 14-18] -[5, 6, 9, 10, 12, 19-21, 22, 23, 24, 25]
