# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Пример работы функции all
'''
s = '234890'
print(all(x in '0123456789'  for x in s))  # True

s = '234890a'
print(all(x in '0123456789'  for x in s))  # False
'''
from os import pread

#  ¬x    |   (not x)
# x ∧ y  |   x and y
# x ∨ y  |   x or y
# x → y  |   x <= y
# x ≡ y  |   x == y


# № 31361 Пересдача 08.07.26(Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуралиное число m».
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?

# Вариант 1
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(1, 2000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        print(A)
'''

# Вариант 1
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(1, 2000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''

# Вариант 3.1
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(1, 2000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)

# Вариант 3.2

for A in range(1, 2000):
    if all( ((x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))) for x in range(1, 10000)):
        print(A)

# Вариант 3.3

def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

RES = []
for A in range(1, 2000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))


# Вариант 3.4

print(max([A for A in range(1, 2000) if all( ((x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))) for x in range(1, 10000))]))
'''


# № 31512 Демоверсия 2027(Уровень: Базовый)
# Пусть на числовой прямой дан отрезок B = [70; 90].
# Для какого наибольшего натурального числа А логическое
# выражение ДЕЛ(x, A) \/ ((x ∈ B) → ¬ДЕЛ(x, 22)) истинно (т.е. принимает значение 1)
# при любом целом положительном значении переменной х?
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 22 != 0))

RES = []
for A in range(1, 2000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 20823 (Уровень: Базовый)
# (Д. Бахтиев) Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Так, например, 14 & 5 = 11102&01012 = 01002 = 4. Найдите минимальное натуральное значение А,
# при котором значение выражения:  (x&A=0) → ((x&77=0) ∧ (x&44=0))
# тождественно истинно, то есть принимает значение 1 при любом натуральном значении х.
'''
def F(x, A):
    return (x & A == 0) <= ((x & 77 == 0) and (x & 44 == 0))

RES = []
for A in range(1, 2000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(min(RES))
'''


# № 21414 Досрочная волна 2025(Уровень: Базовый)
# Для какого наименьшего целого неотрицательного числа А логическое выражение
# (5<y) ∨ (x>32) ∨ (x+2y<A)
# тождественно истинно (т.е. принимает значение 1) при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (5 < y) or (x > 32) or (x + 2*y < A)

RES = []
for A in range(0, 2000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        RES.append(A)
print(min(RES))
'''


# № 23374 Резервный день 19.06.25(Уровень: Базовый)
# Для какого наименьшего целого положительного числа А выражение
# (x<A) ∧ (y<3A) ∨ (2x+y>128)
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?
'''
def F(x, y, A):
    return (x < A) and (y < 3 * A) or (2 * x + y > 128)

RES = []
for A in range(1, 2000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        RES.append(A)
print(min(RES))
'''


# № 23561 Пересдача 03.07.25(Уровень: Базовый)
# Для какого наибольшего натурального числа А выражение
# ДЕЛ(х,128) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,80))
# истинно (т.е. принимает значение 1) при любом натуральном
# значении переменной х?
'''
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

RES = []
for A in range(1, 2000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 12469 (Уровень: Базовый)
# На числовой прямой даны два отрезка: D = [7; 68] и C = [29; 100].
# Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
# (x∈D) → ((¬(x∈C) ∧ ¬(x∈A)) → ¬(x∈D))
# истинно (т.е. принимает значение 1) при любом значении переменной х.

def F(x, a1, a2):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return (D) <= (((not C) and (not A)) <= (not D))

RES = []
M = [x / 4 for x in range(1 * 4, 110 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 21.75 -> 21.8 -> 21.9 -> 22






# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [15]
# КЕГЭ = []
# todo на следующем уроке: 10

