# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# ¬x      |   (not x)
# x ∧ y   |   x and y
# x ∨ y   |   x or y
# x → y   |   x <= y
# x ≡ y   |   x == y

# № 31122 Основная волна 18.06.26(Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без
# остатка на натуральное число m»; пусть на числовой прямой дан отрезок B  = [70; 90].
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(х,А) ∨ ((х∈В) → ¬ДЕЛ(х,16))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?

# Вариант 1
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 16 != 0))  # ДЕЛ(х,А) ∨ ((х∈В) → ¬ДЕЛ(х,16))

RES = []
for A in range(1, 5000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        RES.append(A)
print(max(RES))
'''

# Вариант 2
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 16 != 0))  # ДЕЛ(х,А) ∨ ((х∈В) → ¬ДЕЛ(х,16))

RES = []
for A in range(1, 5000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        RES.append(A)
print(max(RES))
'''

# Вариант 3
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 16 != 0))  # ДЕЛ(х,А) ∨ ((х∈В) → ¬ДЕЛ(х,16))

RES = []
for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''
# Вариант 3.2
'''
RES = []
for A in range(1, 5000):
    if all( ((x % A == 0) or ((70 <= x <= 90) <= (x % 16 != 0)))    for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''

# Вариант 3.3
'''
print(max([A for A in range(1, 5000) if all( ((x % A == 0) or ((70 <= x <= 90) <= (x % 16 != 0)))  for x in range(1, 10000))]))
'''

'''
s = '246824828428'
print(all(x in '02468' for x in s))  # True

s = '2468248284281'
print(all(x in '02468' for x in s))  # False
'''


# № 31361 Пересдача 08.07.26(Уровень: Базовый)
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''

# Вариант 2
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(5000-1, -1, -1):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


#
# № 20823 (Уровень: Базовый)
'''
def F(x, A):
    return (x & A == 0) <= ((x & 77 == 0) and (x & 44 == 0))

for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


# № 23199 Основная волна 10.06.25(Уровень: Базовый)
'''
def F(x, y, A):
    return (x * y > A) or (x > y) or (11 > x)

for A in range(0, 5000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        print(A)
'''

# № 7086 OpenFIPI(Уровень: Базовый)

# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n
# делится без остатка на натуральное число m»;
# и пусть на числовой прямой дан отрезок B = [50; 70].
# Для какого наибольшего натурального числа А формула

# ДЕЛ(x, A) \/ ((x ∈ B) → ¬ДЕЛ(x, 16))

# тождественно истинна (т.е. принимает значение 1) при любом
# натуральном значении переменной х?
'''
def F(x, A):
    b = 50 <= x <= 70
    return (x % A == 0) or ((b) <= (x % 16 != 0))
for A in range (1, 5000):
    if all (F(x, A) for x in range(1, 10000)):
        print(A)
'''


# № 18877 (Уровень: Базовый)

# (Л. Шастин) Для какого наибольшего целого неотрицательного числа
# A формула: ¬((x<7) ∨ (y≥5x+A−60) ∨ (x≥36) ∨ (y<225))

# тождественно ложна, т.е. принимает значение 0 при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (not ((x < 7) or (y >= 5 * x + A - 60) or (x >= 36) or (y < 225)))

for A in range(0, 5000):
    if all(F(x, y, A) == False for x in range(0, 100) for y in range(0, 400)):
        print(A)
'''


# 12469
'''
def F(x, a1, a2):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return (D) <= (((not C) and (not A)) <= (not D))

RES = []
M = [x / 10 for x in range(1 * 10, 110 * 10)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 21.75 -> 21.8 -> 21.9 -> 22
'''

# № 17528 Основная волна 07.06.24(Уровень: Базовый)
'''
def F(x, a1, a2):
    P = 15 <= x <= 40
    Q = 21 <= x <= 63
    A = a1 <= x <= a2
    return (P) <= (((Q) and (not A)) <= (not P))

RES = []
M = [x / 4 for x in range(10 * 4, 70 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 19.0
'''


# № 16833 (Уровень: Базовый)
# (Л. Шастин) На числовой прямой даны два отрезка: P=[25,73] и Q=[75,118].
# Укажите наибольшую возможную длину такого отрезка A, для которого
# логическое выражение: ((x∈A)∧¬(x∈Q))→((x∈P)∨(x∈Q))
# тождественно истинно (т.е. принимает значение 1) при любом значении переменной x.

def F(x, a1, a2):
    P = 25 <= x <= 73
    Q = 75 <= x <= 118
    A = a1 <= x <= a2
    return ((A) and (not Q)) <= ((P) or (Q))


RES = []
M = [x / 4 for x in range(15 * 4, 130 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(max(RES))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10, 15]
# КЕГЭ = []
# todo на следующем уроке: 2
