# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Команды математической логики на python
# ¬x         |    (not x)
# x ∧ y      |    x and y
# x ∨ y      |    x or y
# x → y      |    x <= y
# x ≡ y      |    x == y


# ¬(x ∧ y)                  |   (not(x and y))
# (w ≡ z) ∧ y               |   (w == z) and y
# ¬(x → w)                  |   (not(x <= w))
# ((z → x) → (x ≡ y)) ∨ ¬w  |  ((z <= x) <= (x == y)) or (not w)

'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((x == (not y)) <= (not(w <= x))) or (not z)
                if F == 0:
                    print(x, y, z, w)
'''




# № 1019 100 базовых задач Е. Джобс(Уровень: Базовый)
# Алгоритм вычисления функции
# F(n) задан следующими соотношениями:
# F(n) = n⋅n+11 при n≤10
# F(n) = F(n−3)+n⋅n−5 при n>10
# Определите значение, которое будет получено при вызове  F(40).
'''
def F(n):
    if n <= 10:
        return n * n + 11
    if n > 10:
        return F(n - 3) + n * n - 5

print(F(40))
'''


# № 1021 100 базовых задач Е. Джобс(Уровень: Базовый)
'''
def F(n):
    if n <= 2:
        return n
    if n > 2:
        return G(n) + F(n - 2)

def G(n):
    if n <= 2:
        return n
    if n > 2:
        return F(n - 1) - G(n - 2)

print(G(15))
'''


# № 4704 Демоверсия 2023(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=n×F(n−1) если n>1.
# Чему равно значение выражения F(2023)/F(2020)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print(F(2023) / F(2020))
'''
#   [Previous line repeated 996 more times]
# RecursionError: maximum recursion depth exceeded


# № 17557 Основная волна 08.06.24(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=2×n×F(n–1), если n>1.
# Чему равно значение выражения (F(2024)/16−F(2023))/F(2022)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return 2 * n * F(n - 1)

print(  (F(2024) // 16 - F(2023)) // F(2022) )
'''
#     print(  (F(2024) / 16 - F(2023)) / F(2022) )
#              ~~~~~~~~^~~~
# OverflowError: integer division result too large for a float




# № 6751 Апробация 10.03.23(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n — натуральное число, задан следующими соотношениями:
# F(n)=2 при n<3;
# F(n)=F(n−2)−F(n−1)+2, если n>2 и при этом n чётно;
# F(n)=F(n−1)−F(n−2)−2, если n>2 и при этом n нечётно;
# Чему равно значение функции F(29)?
'''
def F(n):
    if n < 3:
        return 2
    if n > 2 and n % 2 == 0:
        return F(n - 2) - F(n - 1) + 2
    if n > 2 and n % 2 != 0:
        return F(n - 1) - F(n - 2) - 2

print(F(29))
'''



# № 18931 Новогодний вариант 2025(Уровень: Базовый)
'''
from functools import *

@lru_cache(None)
def F(n):
    if n <= 3:
        return n - 1
    if n > 3 and n % 2 == 0:
        return F(n - 2) + n / 2 - F(n - 4)
    if n > 3 and n % 2 != 0:
        return F(n - 1) * n + F(n - 2)

for n in range(0, 5000, 1):
    F(n)

print(F(4952) + 2 * F(4958) + F(4964))
'''


'''
return F(n - 1) * n + F(n - 2)
for n in range(0, 5000, 1):

return F(n + 1) * n + F(n + 2)
for n in range(5000-1, -1, -1):
'''


# № 23375 Резервный день 19.06.25(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n) и G(n), где n – целое число, задан следующими соотношениями:
# F(n)=G(n−1)+G(n−3);
# G(n)=3×n, если n≤9.
# G(n)=G(n−4)+2, если n>9.
# Чему равно значение выражения F(42999)?
'''
from functools import *

def F(n):
    return G(n - 1) + G(n - 3)

@lru_cache(None)
def G(n):
    if n <= 9:
        return 3 * n
    if n > 9:
        return G(n - 4) + 2

for n in range(50000):
    G(n)

print(F(42999))
'''


# № 25355 ЕГКР 13.12.25(Уровень: Базовый)
# Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−4)+3580, если n≥19;
# F(n)=6×(G(n−7)−36), если n<19;

# G(n)=n/20+28, если n≥248045;
# G(n)=G(n+9)−4, если n<248045.
# Чему равно значение функции F(673)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n >= 19:
        return F(n - 4) + 3580
    if n < 19:
        return 6 * (G(n - 7) - 36)

@lru_cache(None)
def G(n):
    if n >= 248045:
        return n / 20 + 28
    if n < 248045:
        return G(n + 9) - 4

for n in range(250000-1, -1, -1):
    G(n)

for n in range(700):
    F(n)

print(F(673))
'''

# ДЗ № 25397 , 25398, 25399


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10, 15, 16]
# КЕГЭ = []
# todo на следующем уроке: 13, 19-21
