# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 209 Джобс 14.09.2020(Уровень: Средний)
# Сколько существует чисел, делящихся на 5, десятичная запись
# которых содержит 7 цифр, причём все цифры
# различны и никакие две чётные и две нечётные цифры не стоят рядом.
'''
cnt = 0
from itertools import permutations
for p in permutations('0123456789', r=7):
    num = ''.join(p)
    if num[0] != '0':
        # if int(num) % 5 == 0:
        if num[-1] in '05':
            for x in '02468':
                num = num.replace(x, '+')
            for x in '13579':
                num = num.replace(x, '*')
            if '++' not in num and '**' not in num:
                cnt += 1
print(cnt)
'''


print('00 11 22 33 44 55 66 77 88'.split())
# ['00', '11', '22', '33', '44', '55', '66', '77', '88']


# № 12240 ЕГКР 16.12.23(Уровень: Базовый)
# Сколько существует девятеричных пятизначных чисел, содержащих
# в своей записи ровно одну цифру 5, в которых никакие две одинаковые цифры не стоят рядом?
'''
cnt = 0
from itertools import product
for p in product('012345678', repeat=5):
    num = ''.join(p)
    a, b, c, d, e = num
    if num[0] != '0':
        if num.count('5') == 1:
            # if a != b and b != c and c != d and d != e:
            # if all(p[i] != p[i+1]  for i in range(len(num)-1) ):
            if all(pair not in num    for pair in '00 11 22 33 44 55 66 77 88'.split()):
                cnt += 1
print(cnt)
'''



# № 11827 (Уровень: Средний)
# (Л. Шастин) Определите количество семизначных чисел, записанных в восьмеричной
# системе счисления, запись которых содержит ровно две чётные цифры,
# и при этом никакая нечётная цифра не стоит рядом с цифрой 7.
'''
cnt = 0
from itertools import product
for p in product('01234567', repeat=7):
    num = ''.join(p)
    if num[0] != '0':
        for x in '0246':
            num = num.replace(x, '2')
        for x in '135':
            num = num.replace(x, '1')
        if num.count('2') == 2:
            if '17' not in num and '71' not in num and '77' not in num:
                cnt += 1
print(cnt)
'''

'''
s = '243897'
if len(s) == len(set(s)):
    print('Все элементы различные')
'''


# № 12462 PRO100 ЕГЭ 29.12.23(Уровень: Базовый)
# Сколько существует различных трёхзначных и пятизначных чисел, записанных
# в шестнадцатеричной системе счисления, в записи которых цифры следуют
# слева направо в строго убывающем порядке?
'''
cnt = 0
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
from itertools import permutations

for p in permutations(alp[:16], r=3):
    num = ''.join(p)
    if num[0] != '0':
        if num[0] > num[1] > num[2]:
            cnt += 1

for p in permutations(alp[:16], r=5):
    num = ''.join(p)
    if num[0] != '0':
        if list(num) == sorted(num)[::-1]:
            print(list(num), sorted(num))
            cnt += 1
print(cnt)
'''



# Команды математической логики на python
# ¬x         |    (not x)
# x ∧ y      |    x and y
# x ∨ y      |    x or y
# x → y      |    x <= y
# x ≡ y      |    x == y

# ¬(x ∧ y)                  |   (not(x and y))
# (w ≡ z) ∧ y               |   (w == z) and y
# ¬(x → w)                  |   (not(x <= w))
# ((z → x) → (x ≡ y)) ∨ ¬w  |  ((z <= x) <= (x == y)) or (not w)




# № 31361 Пересдача 08.07.26(Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуралиное число m».
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000) ):
        print(A)
'''
# print(726)

'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000) ):
        R.append(A)
print(max(R))
'''


# № 20577 (Уровень: Базовый)
# (М. Попков) Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Определите наибольшее натуральное число A, такое что выражение
# (x & A ≠ 0) → ((x & 698 = 0) → (x & 321 ≠ 0))
# тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной x)?
'''
def F(x, A):
    return (x & A != 0) <= ((x & 698 == 0) <= (x & 321 != 0))

R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000) ):
        R.append(A)
print(max(R))
'''


# № 20580 (Уровень: Базовый)
# (М. Попков) Для какого наибольшего натурального значения A выражение
# (9x + y > A) ∨ (x ≥ 36) ∨ (y ≥ 18)
# тождественно истинно для любых положительных и целых x и y?
'''
def F(x, y, A):
    return (9*x + y > A) or (x >= 36) or (y >= 18)

R = []
for A in range(1, 10000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        R.append(A)
print(max(R))
'''


# № 31512 Демоверсия 2027(Уровень: Базовый)
# пусть на числовой прямой дан отрезок B = [70; 90].
# Для какого наибольшего натурального числа А логическое выражение ДЕЛ(x, A) \/ ((x ∈ B) → ¬ДЕЛ(x, 22))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 22 != 0))

R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''


# № 23755 Демоверсия 2026(Уровень: Базовый)
# На числовой прямой даны два отрезка: P = [25; 64] и Q = [40; 115].
# Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
#  (x∈P) → (((x∈Q) ∧ ¬(x∈A)) → ¬(x∈P))
# истинно (т.е. принимает значение 1) при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 25 <= x <= 64
    Q = 40 <= x <= 115
    A = a1 <= x <= a2
    return (P) <= (((Q) and (not A)) <= (not P))

R = []
M = [x / 4 for x in range(15 * 4, 120 * 4)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))  # 24.0 -> 24
'''


# № 12469 (Уровень: Базовый)
# На числовой прямой даны два отрезка: D = [7; 68] и C = [29; 100].
# Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
# (x∈D)→((¬(x∈C)∧¬(x∈A))→¬(x∈D))
# истинно (т.е. принимает значение 1) при любом значении переменной х.

def F(x, a1, a2):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return (D) <= (((not C) and (not A)) <= (not D))

R = []
M = [x / 10 for x in range(5 * 10, 110 * 10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))  # 21.75 -> 21.8 -> 21.9 -> 22


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [8, 15, 16, 19-21]
# КЕГЭ = []
# todo на следующем уроке:  5, 14, 23  - что-то смотрели
