# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Адрес сети = Узел сети & Маска сети
'''
ip = '192.168.n.160'  # на каждое число уходит по 1 байту
# байт 1   1  1  1
# бит  8   8  8  8   -> 32 бит

# 0 <= n <= 255
# 255_10 -> 11111111_2


# 1 and 1 = 1 - конъюнкция

print(14 & 5)  # 4 - операция побитовой (поразрядной) конъюнкции
# 14 = 1110_2
#  5 = 0101_2
#      0100_2 -> 4

# Узел сети:  192.168.32.160
# Маска сети: 255.255.255.240

print(192 & 255, 168 & 255, 32 & 255, 160 & 240)  # - Адрес сети
# net = 192 168 32 160

# net - Адрес сети
# for ip in net:
'''

# Маска сети - она имеет опредленный вид: сначала 1, а потом 0
'''
# 255.255.255.240 -> 11111111.11111111.11111111.11110000

for mask in range(32+1):
    print('1' * mask + '0' * (32 - mask))
    # 00000000000000000000000000000000
    # 10000000000000000000000000000000
    # 11000000000000000000000000000000
    # 11100000000000000000000000000000
    # 11110000000000000000000000000000
    # 11111000000000000000000000000000
    # 11111100000000000000000000000000
    # 11111110000000000000000000000000
    # 11111111000000000000000000000000
    # 11111111100000000000000000000000
    # 11111111110000000000000000000000
    # 11111111111000000000000000000000
    # 11111111111100000000000000000000
    # 11111111111110000000000000000000
    # 11111111111111000000000000000000
    # 11111111111111100000000000000000
    # 11111111111111110000000000000000
    # 11111111111111111000000000000000
    # 11111111111111111100000000000000
    # 11111111111111111110000000000000
    # 11111111111111111111000000000000
    # 11111111111111111111100000000000
    # 11111111111111111111110000000000
    # 11111111111111111111111000000000
    # 11111111111111111111111100000000
    # 11111111111111111111111110000000
    # 11111111111111111111111111000000
    # 11111111111111111111111111100000
    # 11111111111111111111111111110000
    # 11111111111111111111111111111000
    # 11111111111111111111111111111100
    # 11111111111111111111111111111110
    # 11111111111111111111111111111111
'''



# № 10095 Демоверсия 2024(Уровень: Средний)
# Сеть задана IP-адресом 192.168.32.160 и маской сети 255.255.255.240.
# Сколько в этой сети IP-адресов, для которых сумма единиц
# в двоичной записи IP-адреса чётна?
'''
from ipaddress import *
net = ip_network('192.168.32.160/255.255.255.240', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 2 == 0:
        cnt += 1
print(cnt)
'''


# № 11779 (Уровень: Базовый)
# Сеть задана IP-адресом 151.192.0.0 и маской сети 255.224.0.0.
# Сколько в этой сети IP-адресов, у которых
# количество единиц и количество нулей в двоичной записи IP-адреса одинаково?
'''
from ipaddress import *
net = ip_network('151.192.0.0/255.224.0.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') == b.count('0'):
        cnt += 1
print(cnt)  # 293930
'''


# № 11776 (Уровень: Базовый)
# Сеть задана IP-адресом 235.86.56.0 и маской сети 255.255.248.0.
# Сколько в этой сети IP-адресов, двоичная запись
# которых оканчивается на две единицы?
'''
from ipaddress import *
net = ip_network('235.86.56.0/255.255.248.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    # if b[-2] == '1' and b[-1] == '1':
    if b[-2:] == '11':
        cnt += 1
print(cnt)
'''


# № 12947 (Уровень: Базовый)
# Сеть, в которой содержится узел с IP-адресом 203.111.195.0,
# задана маской сети 255.255.240.0.
# Сколько в этой сети IP-адресов, в двоичной записи
# которых количество нулей кратно трём, а также
# содержатся три подряд идущие единицы и три подряд
# идущих нуля одновременно?
'''
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('0') % 3 == 0:
        if '111' in b and '000' in b:
            cnt += 1
print(cnt)
'''


# № 19245 ЕГКР 21.12.24(Уровень: Базовый)

# Сеть задана IP-адресом одного из входящих в неё узлов 218.194.82.148 и сетевой маской 255.255.255.192.
# Найдите наибольший IP-адрес в данной сети, который может быть назначен компьютеру.
# В ответе укажите найденный IP-адрес без разделителей.
'''
from ipaddress import *
net = ip_network('218.194.82.148/255.255.255.192', 0)
for ip in net:
    print(ip)
'''


# № 31151 Основная волна 19.06.26(Уровень: Базовый)
# Сеть задана IP-адресом одного из входящих в неё узлов 185.249.55.138 и сетевой маской 255.255.192.0.
# Найдите её широковещательный IP-адрес. В ответе укажите сумму числовых значений октетов найденного IP-адреса.
'''
from ipaddress import *
net = ip_network('185.249.55.138/255.255.192.0', 0)
for ip in net:
    print(ip)
'''


# № 10575 (Уровень: Базовый)
# Для узла с IP адресом 118.193.30.139
# адрес сети равен 118.193.24.0.
# Чему равно значение третьего слева байта маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'118.193.30.139/{mask}', 0)
    if '118.193.24.0' in str(net):
        print(net, net.netmask)
        # 118.193.24.0/21 255.255.248.0
'''



# № 10571 (Уровень: Базовый)
# Для узла с IP адресом 122.21.49.91
# адрес сети равен 122.21.48.0.
# Найдите наименьшее возможное количество единиц
# в двоичной записи маски подсети.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'122.21.49.91/{mask}', 0)
    if '122.21.48.0' in str(net):
        print(net, mask, 32-mask)
'''


# № 10170 (#Уровень: Средний)
# Два узла, находящиеся в разных подсетях,
# имеют IP-адреса 193.175.175.231 и 193.175.176.118.
# В масках обеих подсетей одинаковое количество единиц.
# Укажите наименьшее возможное значение третьего слева
# байта этой маски. Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'193.175.175.231/{mask}', 0)
    net2 = ip_network(f'193.175.176.118/{mask}', 0)
    if net1 != net2:
        print(net1.netmask)
'''



# № 10169 (Уровень: Средний)
# Два узла, находящиеся в разных подсетях,
# имеют IP-адреса 157.127.182.76 и 157.127.190.80.
# В масках обеих подсетей одинаковое количество единиц.
# Укажите наименьшее возможное количество единиц
# в масках этих подсетей.
'''
from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'157.127.182.76/{mask}', 0)
    net2 = ip_network(f'157.127.190.80/{mask}', 0)
    if net1 != net2:
        print(mask)
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10]
# КЕГЭ = []
# todo на следующем уроке: 15

























