# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 28764 Досрочная волна 2026(Уровень: Базовый)
# A. Прибавить 1
# B. Прибавить 3
# C. Умножить на 2
# Сколько существует программ, для которых при исходном числе 2 результатом является число 25,
# и при этом траектория вычислений содержит число 15 и не содержит 7?
'''
def F(a, b):
    if a > b or a == 7:
        return 0
    elif a == b:
        return 1
    else:
        return F(a + 1, b) + F(a + 3, b) + F(a * 2, b)

print(F(2, 15) * F(15, 25))

# Вариант 2
def F(a, b):
    if a >= b or a == 7:
        return a == b
    return F(a + 1, b) + F(a + 3, b) + F(a * 2, b)

print(F(2, 15) * F(15, 25))
'''


# № 28942 ЕГКР 18.04.26(Уровень: Базовый)
# A. Вычти 3
# B. Вычти 8
# C. Найди целую часть от деления на 2
# Сколько существует программ, для которых при исходном числе 76 результатом
# является число 12, и при этом траектория вычислений содержит число 41 и не содержит 73?
'''
def F(a, b):
    if a < b or a == 73:
        return 0
    elif a == b:
        return 1
    else:
        return F(a - 3, b) + F(a - 8, b) + F(a // 2, b)

print(F(76, 41) * F(41, 12))
'''


# № 25360 ЕГКР 13.12.25(Уровень: Базовый)
# A. вычти 3
# В. вычти 6
# C. найди целую часть от деления на 2
# Сколько существует программ, для которых при исходном числе 86 результатом
# является 12, при этом траектория вычислений содержит число 53 и не содержит 36?
'''
def F(a, b):
    if a < b or a == 36:
        return 0
    elif a == b:
        return 1
    else:
        return F(a - 3, b) + F(a - 6, b) + F(a // 2, b)

print(F(86, 53) * F(53, 12))
'''


# № 31128 Основная волна 18.06.26(Уровень: Средний)
# A. Прибавь 1
# B. Поменяй местами

# Вторая команда применяется только к числу, у которого цифра
# в разряде десятков по значению меньше цифры, стоящей в разряде
# единиц, и действует, заменяя число на экране числом, в котором
# цифры двух младших разрядов поменялись местами.

# Сколько существует программ, для которых при исходном
# числе 100 результатом является число 150?
'''
def F(a, b):
    if a > b:
        return 0
    elif a == b:
        return 1
    else:
        s = str(a)
        if s[-2] < s[-1]:
            return F(a + 1, b) + F( int(s[0] + s[-1] + s[-2])  , b)
        else:
            return F(a + 1, b)

print(F(100, 150))

# Вариант 2
def F(a, b):
    if a >= b:
        return a == b
    s = str(a)
    if s[-2] < s[-1]:
        return F(a + 1, b) + F( int(s[0] + s[-1] + s[-2])  , b)
    else:
        return F(a + 1, b)

print(F(100, 150))
'''


# № 31159 Основная волна 19.06.26(Уровень: Средний)
# A. Прибавь 1
# B. Измени цифру
# Вторая команда применяется только к числу, у которого в записи
# присутствует хотя бы одна цифра 1, и действует, заменяя число
# на экране числом, в котором каждая цифра 1 заменена на цифру 2.

# Сколько существует программ, для которых при исходном
# числе 11 результатом является число 92?
'''
def F(a, b):
    if a >= b:
        return a == b
    s = str(a)
    if s.count('1') >= 1:
        s = s.replace('1', '2')
        return F(a + 1, b) + F(int(s), b)
    else:
        return F(a + 1, b)

print(F(11, 92))
'''


# № 31229 Резерв 22.06.26(Уровень: Средний)
# A. Прибавь 1
# B. Измени цифру
# Первая из этих команд увеличивает число на экране на 1.
# Вторая команда применяется только к числу, у которого в записи
# присутствует хотя бы одна цифра 1, и действует, заменяя число на
# экране числом, в котором каждая цифра 1 заменена на цифру 3.


# Сколько существует программ, для которых при исходном числе 10 результатом
# является число 84?

def F(a, b):
    if a >= b:
        return a == b
    s = str(a)
    if s.count('1') >= 1:
        s = s.replace('1', '3')
        return F(a + 1, b) + F(int(s), b)
    else:
        return F(a + 1, b)
print(F(10, 84))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 13, 14, 15, 16, 18, 22]
# КЕГЭ = []
# todo на следующем уроке:
