# region Домашка: ******************************************************************
from traceback import print_tb

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



#  Общий вид срезов в Python:
# A[начало:конец:шаг]
#
# 🚩 начало — индекс, С КОТОРОГО начинаем (включается).
# 🚩 конец — индекс, ДО КОТОРОГО берём (не включается).
# 🚩 шаг — через сколько берём элементы (по умолчанию 1).
#
# Пример со строкой:
'''
# i  0123456789
s = "информатика"

print(s[0:5])      # 'инфор' (с 0 по 4 индекс)
print(s[::-1])     # 'акитамрофни' (разворот строки)
print(s[2:7])      # 'форма' (с 2 по 6 индекс)
print(s[:4])       # 'инфо' (с начала до 3 индекса)
print(s[-4:])      # 'тика' (последние 4 буквы)
print(s[::2])      # 'ифрмата' (каждая вторая буква)
'''

# 🚩Пример со списком:
'''
# i     0  1   2   3   4   5
nums = [4, 8, 15, 16, 23, 42]
# -i  -6  -5  -4  -3  -2  -1

print(nums[1:4])    # [8, 15, 16] (с 1 по 3 индекс)
print(nums[-3:])    # [16, 23, 42] (последние 3 элемента)
print(nums[:3])     # [4, 8, 15] (первые 3 элемента)
print(nums[::-1])   # [42, 23, 16, 15, 8, 4] (разворот списка)
print(nums[::2])    # [4, 15, 23] (каждый второй элемент)
print(nums[1:-1])   # [8, 15, 16, 23]
'''

# 🚩Как запомнить?
# 🟠 ЛЕВАЯ граница включается, ПРАВАЯ не включается.
# 🟠 Откуда : докуда : шаг.
# 🟠 шаг = -1 — идёшь в обратную сторону.
# 🟠Работает с списками, строками, кортежами




# № 31151 Основная волна 19.06.26(Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут быть
# использованы для адресации сетевых устройств.

# Сеть задана IP-адресом одного из входящих в неё
# узлов 185.249.55.138 и сетевой маской 255.255.192.0.

# Найдите её широковещательный IP-адрес.
# В ответе укажите сумму числовых значений октетов найденного IP-адреса.
'''
from ipaddress import *
net = ip_network('185.249.55.138/255.255.192.0', 0)
for ip in net:
    print(ip)
'''


# № 12947 (Уровень: Базовый)
# Сеть, в которой содержится узел с IP-адресом 203.111.195.0,
# задана маской сети 255.255.240.0. Сколько в этой сети IP-адресов,
# в двоичной записи которых количество нулей кратно трём,
# а также содержатся три подряд идущие единицы и три подряд
# идущих нуля одновременно?
'''
cnt = 0
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
for ip in net:
    b = f'{ip:b}'
    if b.count('0') % 3 == 0:
        if '111' in b and '000' in b:
            cnt += 1
print(cnt)
'''


# № 12922 PRO100 ЕГЭ 26.01.24(Уровень: Базовый)
# Сеть задана IP-адресом 136.36.240.16 и маской сети 255.255.255.248.
# Сколько в этой сети IP-адресов, в которых в двоичной
# записи IP-адреса не встречается 101?
'''
cnt = 0
from ipaddress import *
net = ip_network('136.36.240.16/255.255.255.248', 0)
for ip in net:
    b = f'{ip:b}'
    if '101' not in b:
        cnt += 1
print(cnt)
'''


# № 12088 (Уровень: Средний)
# Сеть задана IP-адресом 112.154.132.0 и маской сети 255.255.252.0.
# Сколько в этой сети узлов (устройств), для которых в двоичной
# записи IP-адреса суммарное количество единиц в левых двух байтах
# не больше суммарного нечётного количества нулей в правых двух байтах.
'''
cnt = 0
from ipaddress import *
net = ip_network('112.154.132.0/255.255.252.0', 0)
for ip in net:
    b = f'{ip:b}'
    # 112.154.135.247  '01110000 100110101000011111110111'
    # print(b[:8], b[8:16], b[16:24], b[24:])
    # print(b[:16], b[16:])
    if b[16:].count('0') % 2 != 0:
        if b[:16].count('1') <= b[16:].count('0'):
            cnt += 1
print(cnt)
'''


# Перебр визуальный маски сети
#  for mask in range(32+1):
#     print('1' * mask + '0' * (32 - mask))


# № 10150 (Уровень: Базовый)
# Для узла с IP-адресом 145.192.94.230 адрес сети равен 145.192.80.0.
# Чему равен третий слева байт маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'145.192.94.230/{mask}', 0)
    if '145.192.80.0' in str(net):
        print(net, net.netmask)
        # 145.192.80.0/20 255.255.240.0
'''

# № 10783 (Уровень: Средний)
# Два узла, находящиеся в одной сети,
# имеют IP-адреса 121.171.5.70 и 121.171.5.107.
# Укажите наименьшее возможное количество адресов в этой сети.
'''
RES = []
from ipaddress import *
for mask in range(33):
    net1 = ip_network(f'121.171.5.70/{mask}', 0)
    net2 = ip_network(f'121.171.5.107/{mask}', 0)
    if net1 == net2:
        RES.append(net1.num_addresses)
print(min(RES))


cnt = 0
from ipaddress import *
net = ip_network('112.154.132.0/255.255.252.0', 0)
for ip in net:
    cnt += 1
print(cnt)  # 1024
print(net.num_addresses)  # 1024
'''


# № 14948 (Уровень: Базовый)
# Сеть задана IP-адресом 192.168.32.128 и маской сети 255.255.255.192.
# Сколько в этой сети IP-адресов, для которых сумма единиц в двоичной
# записи IP-адреса чётна?

cnt = 0
from ipaddress import *
net = ip_network("192.168.32.128/255.255.255.192",0)
for ip in net:
    b = f"{ip:b}"
    if b.count("1") % 2 == 0:
        cnt+=1
print(cnt)





# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10]
# КЕГЭ = []
# todo на следующем уроке:
