# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 1058 Джобс 15.03.2021(Уровень: Средний)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(0)=1, F(1)=3
# F(n) = F(n−1)−F(n−2)+3n при n>1
# Чему равно значение функции F(40)? В ответе запишите только целое число.
'''
def F(n):
    if n == 0:
        return 1
    if n == 1:
        return 3
    if n > 1:
        return F(n-1) - F(n-2) + 3*n

print(F(40))
'''

# № 1021 100 базовых задач Е. Джобс(Уровень: Базовый)
# Алгоритмы вычисления функций
# F(n) и G(n) задан следующими соотношениями:
# F(n)=G(n)=n при n≤2
# F(n)=G(n)+F(n−2) при n>2
# G(n)=F(n−1)−G(n−2) при n>2
# Определите значение, полученное при вызове G(15).
'''
def F(n):
    if n <= 2:
        return n
    if n > 2:
        return G(n) + F(n - 2)

def G(n):
    if n <= 2:
        return n
    if n > 2:
        return F(n - 1) - G(n - 2)

print(G(15))
'''


#
# № 4704 Демоверсия 2023(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=n×F(n−1) если n>1.
# Чему равно значение выражения F(2023)/F(2020)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print(F(2023) / F(2020))
'''
#   [Previous line repeated 996 more times]
# RecursionError: maximum recursion depth exceeded



# № 17557 Основная волна 08.06.24(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=2×n×F(n–1), если n>1.
# Чему равно значение выражения (F(2024)/16−F(2023))/F(2022)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return 2 * n * F(n - 1)

print( (F(2024) // 16 - F(2023)) // F(2022)  )
'''
#     print( (F(2024) / 16 - F(2023)) / F(2022)  )
#             ~~~~~~~~^~~~
# OverflowError: integer division result too large for a float


# № 18931 Новогодний вариант 2025(Уровень: Базовый)
# (М. Попков) Снежная Королева создала волшебную функцию
# F(n), которая помогает ей вычислять силу зимы. Эта функция определяется следующим образом:
# F(n)=n−1, при n⩽3;
# F(n)=F(n−2)+n/2−F(n−4), если n>3 и n чётно;
# F(n)=F(n−1)×n+F(n−2), если n>3 и  n нечётно, где n – целое неотрицательное число.
#
# Королева решила узнать, насколько велика сила зимы в её королевстве.
# Для этого вычислите значение выражения: F(4952)+2×F(4958)+F(4964).
'''
from functools import *

@lru_cache(None)
def F(n):
    if n <= 3:
        return n - 1
    if n > 3 and n % 2 == 0:
        return F(n - 2) + n / 2 - F(n - 4)
    if n > 3 and n % 2 != 0:
        return F(n - 1) * n + F(n - 2)

for n in range(5000):
    F(n)

print( F(4952) + 2 * F(4958) + F(4964))
'''



# № 29970 Апробация 14.05.26(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n) и G(n), где n – целое число, задан следующими соотношениями:
# F(n)=3×G(n−3)+7;
# G(n)=n+2, если n≤20.
# G(n)=G(n−3)+1, если n>20.
# Чему равно значение выражения F(37811)?
'''
from functools import *

def F(n):
    return 3 * G(n-3) + 7

@lru_cache(None)
def G(n):
    if n <= 20:
        return n + 2
    if n > 20:
        return G(n - 3) + 1

for n in range(0, 38000, 1):
    G(n)
    
print(F(37811))
'''


# № 25355 ЕГКР 13.12.25(Уровень: Базовый)
# Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−4)+3580, если n≥19;
# F(n)=6×(G(n−7)−36), если n<19;

# G(n)=n/20+28, если n≥248045;
# G(n)=G(n+9)−4, если n<248045.
# Чему равно значение функции F(673)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n >= 19:
        return F(n - 4) + 3580
    if n < 19:
        return 6 * (G(n-7) - 36)

@lru_cache(None)
def G(n):
    if n >= 248045:
        return n / 20 + 28
    if n < 248045:
        return G(n + 9) - 4

for n in range(250_000-1, -1, -1):
    G(n)

for n in range(700):
    F(n)

print(F(673))
'''

# № 25398 (Уровень: Средний)
# (Р. Косов) Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−6)+2048, если n>30;
# F(n)=3×(G(n−5)+13),, если n≤30;

# G(n)=2×n+50, если n≥221337;
# G(n)=G(n+11)−48, если n<221337.
# Чему равно значение функции F(5078)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n > 30:
        return F(n - 6) + 2048
    if n <= 30:
        return 3 * (G(n - 5) + 13)

@lru_cache
def G(N):
    if n >= 221337:
        return 2 * n + 50
    if n < 221337:
        return G(n + 11) - 48

for n in range(230_000 - 1, -1, -1):
    G(n)

for n in range(5100):
    F(n)

print(F(5078))
'''

# № 25397 (Уровень: Средний)
# (Р. Косов) Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−4)+3020, если n>40;
# F(n)=3×(G(n−2)−15), если n≤40;

# G(n)=10×n+50, если n≥301208;
# G(n)=G(n+7)−21, если n<301208.
# Чему равно значение функции F(2026)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n > 40:
        return F(n - 4)+3020
    if n <= 40:
        return 3 * (G(n - 2) - 15)

@lru_cache(None)
def G(n):
    if n > 301208:
        return 10 * n + 50
    if n <= 301208:
        return G(n + 7) - 21


for n in range(302000-1, -1, -1):
    G(n)

for n in range(2100):
    F(n)

print(F(2026))
'''


# № 31362 Пересдача 08.07.26(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=1 при n=1;

# F(n)=(n+1)×F(n−1), если n>1.
# Чему равно значение выражения
# (F(42038)+3×F(42037))/F(42036)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return (n+1)*F(n-1)

print((F(42038)+3*F(42037)) // F(42036))
'''


'''
from functools import *

@lru_cache(None)
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return (n + 1) * F(n - 1)

for n in range(43000):
    F(n)

print((F(42038) + 3 * F(42037)) // F(42036))
'''


# № 29082 (Уровень: Средний)
# Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:

# F(n)=5 при n<19;

# F(n)=(n+4)×F(n−7), если n≥19.
# Чему равно значение выражения
# (F(157163)/234+F(157149)/533)/F(157142)?

'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n < 19:
        return 5
    if n >= 19:
        return (n + 4)*F(n-7)

print((F(157163) // 234 + F(157149) // 533) // F(157142))
'''

'''
from functools import *

@lru_cache(None)
def F(n):
    if n < 19:
        return 5
    if n >= 19:
        return (n + 4)*F(n-7)

for n in range(160_000):
    F(n)

print((F(157163) // 234 + F(157149) // 533) // F(157142))
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [16]
# КЕГЭ = []
# todo на следующем уроке:
