# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# ip: 192.168.159.86  - 4 байта или 32 бита
# байт 1   1   1  1
# бит  8   8   8  8

# 11000000.10101000.10011111.01010110
print(f'{192:b}.{168:b}.{159:b}.{86:b}')

# ip: 192.168.n.86
# 0 <= n <= 255

# 255_10 -> 11111111_2
'''


'''
# По заданным IP-адресу узла сети и маске определите адрес сети:
# Узел сети: 10.8.248.131
# Маска сети: 255.255.224.0

# Адрес сети = Узел сети & Маска сети
# & - операция побитовой (поразрядной) конъюнкции

print(10 & 255, 8 & 255, 248 & 224, 131 & 0)
# 10.8.224.0
'''


# Маска сети: 255.255.224.0
# Имеет вид: 11111111...000000
'''
for mask in range(32+1):
    print('1' * mask + '0' * (32 - mask))
    # 00000000000000000000000000000000
    # 10000000000000000000000000000000
    # 11000000000000000000000000000000
    # 11100000000000000000000000000000
    # 11110000000000000000000000000000
    # 11111000000000000000000000000000
    # 11111100000000000000000000000000
    # 11111110000000000000000000000000
    # 11111111000000000000000000000000
    # 11111111100000000000000000000000
    # 11111111110000000000000000000000
    # 11111111111000000000000000000000
    # 11111111111100000000000000000000
    # 11111111111110000000000000000000
    # 11111111111111000000000000000000
    # 11111111111111100000000000000000
    # 11111111111111110000000000000000
    # 11111111111111111000000000000000
    # 11111111111111111100000000000000
    # 11111111111111111110000000000000
    # 11111111111111111111000000000000
    # 11111111111111111111100000000000
    # 11111111111111111111110000000000
    # 11111111111111111111111000000000
    # 11111111111111111111111100000000
    # 11111111111111111111111110000000
    # 11111111111111111111111111000000
    # 11111111111111111111111111100000
    # 11111111111111111111111111110000
    # 11111111111111111111111111111000
    # 11111111111111111111111111111100
    # 11111111111111111111111111111110
    # 11111111111111111111111111111111
'''


# № 31120 Основная волна 18.06.26(Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 189.163.226.71
# и сетевой маской 255.255.255.240.
# Найдите IP-адрес сети. В ответе укажите сумму числовых значений октетов
# найденного IP-адреса.
'''
from ipaddress import *
net = ip_network('189.163.226.71/255.255.255.240', 0)
for ip in net:
    print(ip)
    # 189.163.226.64 - IP-адрес сети / Адрес сети
    # 189.163.226.65 - наименьший
    # 189.163.226.66
    # 189.163.226.67
    # 189.163.226.68
    # 189.163.226.69
    # 189.163.226.70
    # 189.163.226.71
    # 189.163.226.72
    # 189.163.226.73
    # 189.163.226.74
    # 189.163.226.75
    # 189.163.226.76
    # 189.163.226.77
    # 189.163.226.78  - наибольший
    # 189.163.226.79  - широковещательный адрес

# Наш ответ: 189.163.226.64
'''
# Записать в ответе без разделителей: 18916322664
# Найдите сумму двух первых байт: 352 (189 + 163)
# Найдите сумму двух первого и последнего: 253 (189 + 64)
# Укажите сумму числовых значений октетов: 642 (189 + 163 + 226 + 64)




'''
from ipaddress import *
net = ip_network('189.163.226.71/255.255.255.240', 0)
print(net)  # 189.163.226.64/28 - где 28 это кол-во единиц в маске сети


print('1' * 28 + '0' * (32 - 28))  # 11111111.11111111.11111111.11110000 == 255.255.255.240

'''



# № 10095 Демоверсия 2024(Уровень: Средний)
# Сеть задана IP-адресом 192.168.32.160 и маской сети 255.255.255.240.
# Сколько в этой сети IP-адресов, для которых сумма единиц в двоичной записи IP-адреса чётна?
'''
from ipaddress import *
net = ip_network('192.168.32.160/255.255.255.240', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 2 == 0:
        cnt += 1
print(cnt)
'''


# № 11779 (Уровень: Базовый)
# Сеть задана IP-адресом 151.192.0.0 и маской сети 255.224.0.0.
# Сколько в этой сети IP-адресов, у которых количество единиц и количество нулей
# в двоичной записи IP-адреса одинаково?
'''
from ipaddress import *
net = ip_network('151.192.0.0/255.224.0.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') == b.count('0'):
        cnt += 1
print(cnt)
'''


# № 11776 (Уровень: Базовый)
# Сеть задана IP-адресом 235.86.56.0 и маской сети 255.255.248.0.
# Сколько в этой сети IP-адресов, двоичная запись которых оканчивается на две единицы?
'''
from ipaddress import *
net = ip_network('235.86.56.0/255.255.248.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    # if b[-1] == '1' and b[-2] == '1':
    if b[-2:] == '11':
        cnt += 1
print(cnt)
'''


# № 11772 (Уровень: Базовый)
# Сеть задана IP-адресом 165.44.96.0 и маской сети 255.255.248.0.
# Сколько в этой сети IP-адресов, в двоичной записи которых содержатся три подряд идущие единицы?
'''
from ipaddress import *
net = ip_network('165.44.96.0/255.255.248.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if '111' in b:
        cnt += 1
print(cnt)
'''


# № 12947 (Уровень: Базовый)
# Сеть, в которой содержится узел с IP-адресом 203.111.195.0,
# задана маской сети 255.255.240.0. Сколько в этой сети IP-адресов,
# в двоичной записи которых количество нулей кратно трём, а также
# содержатся три подряд идущие единицы и три подряд идущих нуля одновременно?
'''
from ipaddress import *
net = ip_network ('203.111.195.0/255.255.240.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if ('111' in b) and ('000'in b):
        if b.count('0') % 3 == 0:
            cnt +=1
print(cnt)
'''


# № 11769 (Уровень: Базовый)
# Для узла с IP-адресом 157.17.164.129 адрес сети равен 157.17.128.0.
# Чему равно наименьшее возможное значение третьего слева байта маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'157.17.164.129/{mask}', 0)
    if '157.17.128.0' in str(net):
        print(net.netmask)
        # 255.255.128.0
        # 255.255.192.0
'''

# Два узла, находящиеся в разных подсетях,
# имеют IP-адреса 118.187.59.255 и 118.187.65.115.
# В масках обеих подсетей одинаковое количество единиц.
# Укажите наибольшее возможное количество единиц
# в масках этих подсетей.

from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'118.187.59.255/{mask}', 0)
    net2 = ip_network(f'118.187.65.115/{mask}', 0)
    if net1 != net2:
        print(mask, 32 - mask)



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10]
# КЕГЭ = []
# todo на следующем уроке: 15

