# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# ¬x         (not x)
# x ∧ y      x and y
# x ∨ y      x or y
# x → y      x <= y


# № 31361 Пересдача 08.07.26(Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуралиное число m».
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?

# Вариант 1
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))    # ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))

RES = []
for A in range(1, 1000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        RES.append(A)
print(max(RES))
'''

# Вариант 2
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))    # ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))

RES = []
for A in range(1, 5000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        RES.append(A)
print(max(RES))
'''

# Вариант 3

'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))    # ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))


for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''

'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))    # ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))

RES = []
for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))




RES = []
for A in range(1, 5000):
    if all( ((x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0)) ) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))


# Вариант 4
print(max([A for A in range(1, 5000) if all( ((x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))) for x in range(1, 10000))]))
'''


# № 31512 Демоверсия 2027(Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка
# на натуральное число m»; пусть на числовой прямой дан отрезок B = [70; 90].
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(x, A) \/ ((x ∈ B) → ¬ДЕЛ(x, 22)) истинно (т.е. принимает значение 1)
# при любом целом положительном значении переменной х?
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 22 != 0))

RES = []
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 8503 Апробация 17.05(Уровень: Базовый)
# Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Для какого наименьшего неотрицательного целого числа А формула
# ((x&52 !=0)∧(x&36=0))→   ¬(x&А=0)
# тождественно истинна (т.е. принимает значение 1) при любом неотрицательном целом значении переменной х?
'''
def F(x, A):
    # return ((x & 52 != 0) and (x & 36 == 0)) <= (not(x & A == 0))
    return ((x & 52 != 0) and (x & 36 == 0)) <= (x & A != 0)

RES = []
for A in range(0, 1000):
    if all(F(x, A) for x in range(0, 10000)):
        RES.append(A)
print(min(RES))
'''


# № 9784 Основная волна 20.06.23(Уровень: Базовый)
# Для какого наименьшего целого неотрицательного числа
# А выражение (x⋅y<A) ∨ (x<y) ∨ (9<x)
# тождественно истинно, т.е. принимает значение 1 при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (x * y < A) or (x < y) or (9 < x)

RES = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        RES.append(A)
print(min(RES))
'''


# № 9838 Основная волна 27.06.23(Уровень: Базовый)
# Для какого наибольшего целого неотрицательного числа А выражение
# (x+2y>A) ∨ (y<x) ∨ (x<30)
# тождественно истинно (т.е. принимает значение 1) при любых целых неотрицательных х и у?
'''
def F(x, y, A):
    return (x + 2 * y > A) or (y < x) or (x < 30)

RES = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        RES.append(A)
print(max(RES))
'''


# № 10098 Демоверсия 2024(Уровень: Базовый)
# Для какого наименьшего целого неотрицательного числа A выражение
# (x+2y < A) ∨ (y>x) ∨ (x>60)
# тождественно истинно, т.е. принимает значение 1 при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (x + 2 * y < A) or (y > x) or (x > 60)

RES = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        RES.append(A)
print(min(RES))
'''


# № 2184 (Уровень: Базовый)
# На числовой прямой даны два отрезка: P = [1, 39] и Q = [23, 58].
# Какова наибольшая возможная длина интервала A, что логическое выражение
#   ((x ∈ P) → ¬(x ∈ Q)) → ¬(x ∈ А)
# тождественно истинно, то есть принимает значение 1 при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 1 <= x <= 39
    Q = 23 <= x <= 58
    A = a1 <= x <= a2
    return ((P) <= (not Q)) <= (not A)

RES = []
M = [x for x in range(0, 70)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(max(RES))
'''


# № 12469 (Уровень: Базовый)
'''
def F(x, a1, a2):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return (D) <= (((not C) and (not A)) <= (not D))

RES = []
M = [x / 10 for x in range(0 * 10, 110 * 10)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 21.75 -> 21.8 -> 21.9 -> 22
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10, 15]
# КЕГЭ = []
# todo на следующем уроке: 2
