# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# 192.n.159.86 -> 4 байт
#  1   1   1  1  -> 4 байт
#  8   8   8  8  -> 32 бит

# 0 <= n <= 255
# 255_10 -> 11111111_2
# 8_10 -> 00001000_2

# 1 байте - 8 бит


# Адрес сети = Адрес узла & Маска сети

# knot = 192.168.159.86
# mask = 255.255.252.0

print(14 & 5)  # 4
print(f'{14:b}')
print(f'{5:b}')

# 1110
# 0101

print(101 & 255, 168 & 255, 159 & 252, 86 & 0)
# 101.168.156.0
'''

# № 10095 Демоверсия 2024(Уровень: Средний)
'''
from ipaddress import *
cnt = 0
net = ip_network('192.168.32.160/255.255.255.240', 0)
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 2 == 0:
        cnt += 1
print(cnt)
'''

# № 12947 (Уровень: Базовый)
# Сеть, в которой содержится узел с IP-адресом 203.111.195.0, задана маской сети 255.255.240.0.
# Сколько в этой сети IP-адресов, в двоичной записи которых количество нулей кратно трём,
# а также содержатся три подряд идущие единицы и три подряд идущих нуля одновременно?
'''
cnt = 0
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
for ip in net:
    ip2 = f'{ip:b}'
    if ip2.count('0') % 3 == 0:
        if ip2.count('000') >= 1:
            if '111' in ip2:
                cnt += 1
print(cnt)


RES = []
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
for ip in net:
    ip2 = f'{ip:b}'
    if ip2.count('0') % 3 == 0:
        if ip2.count('000') >= 1:
            if '111' in ip2:
                RES.append(ip)
print(len(RES))
'''



# № 21412 Досрочная волна 2025(Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 143.168.72.213 и сетевой маской 255.255.255.240.
# Определите наибольший IP-адрес данной сети, который может быть присвоен компьютеру.
# В ответе укажите найденный IP-адрес без разделителей.
'''
from ipaddress import *
net = ip_network('143.168.72.213/255.255.255.240', 0)
for ip in net:
    print(ip)
'''


# 255.255.255.240
# 1111111.1111111.1111111.1110000
'''
for mask in range(1, 32+1):
    print('1' * mask + '0' * (32 - mask) )
    # 10000000000000000000000000000000
    # 11000000000000000000000000000000
    # 11100000000000000000000000000000
    # 11110000000000000000000000000000
    # 11111000000000000000000000000000
    # 11111100000000000000000000000000
    # 11111110000000000000000000000000
    # 11111111000000000000000000000000
    # 11111111100000000000000000000000
    # 11111111110000000000000000000000
    # 11111111111000000000000000000000
    # 11111111111100000000000000000000
    # 11111111111110000000000000000000
    # 11111111111111000000000000000000
    # 11111111111111100000000000000000
    # 11111111111111110000000000000000
    # 11111111111111111000000000000000
    # 11111111111111111100000000000000
    # 11111111111111111110000000000000
    # 11111111111111111111000000000000
    # 11111111111111111111100000000000
    # 11111111111111111111110000000000
    # 11111111111111111111111000000000
    # 11111111111111111111111100000000
    # 11111111111111111111111110000000
    # 11111111111111111111111111000000
    # 11111111111111111111111111100000
    # 11111111111111111111111111110000
    # 11111111111111111111111111111000
    # 11111111111111111111111111111100
    # 11111111111111111111111111111110
    # 11111111111111111111111111111111
'''


# № 10149 (Уровень: Базовый)
# Для узла с IP-адресом 220.128.112.142 адрес сети равен 220.128.96.0.
# Чему равен третий слева байт маски? Ответ запишите в виде десятичного числа.
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'220.128.112.142/{mask}', 0)
    if '220.128.96.0' in str(net):
        print(net, net.netmask)  # 220.128.96.0/19 255.255.224.0
'''
# 224


# № 10153 (Уровень: Базовый)
# Для узла с IP-адресом 115.12.69.38 адрес сети равен 115.12.64.0.
# Найдите наименьшее возможное количество единиц в двоичной записи маски подсети.
'''
RES = []
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'115.12.69.38/{mask}', 0)
    if '115.12.64.0' in str(net):
        RES.append(mask)
print(min(RES))
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [13]
# КЕГЭ = []
# todo на следующем уроке:
