# region Домашка: ******************************************************************

# Номер 19480
'''
from itertools import *
R = []
for p in permutations('ПАРИЖАНКА'):
    word = ''.join(p)
    slovo = word

    word = word.replace('И', 'А')
    if word.count('АА') == 1 and 'ААА' not in word:
        R.append(slovo)
print(len(set(R)))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 4, 5, 6, 7, 8, 12, 13, 14, 15, 16, 23]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Egor 7/10 -> 40 вторичных баллов +[1, 4, 5, 10, 12, 13] -[2, 6, 8]
