# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 19721 (Уровень: Базовый)
'''
def divisors(n):
    div = []
    for j in range(1, int(n ** 0.5)+1):
        if n % j == 0:
            div += [j, n // j]
    return sorted(set(div))


for x in range(178965, 178982+1):
    d = divisors(x)
    if len(d) == 4:
        print(sorted(d)[::-1])
'''


# № 18620 (Уровень: Средний)
'''
def divisors(n):
    div = []
    for j in range(2, int(n ** 0.5)+1):  # не считая самого числа и единицы
        if n % j == 0:
            div += [j, n // j]
    return sorted(set(div))

for x in range(112_500_000, 112_550_000+1):
    d = divisors(x)
    if len(d) >= 2:
        M = d[-2] + d[-1]
        if M % 10000 == 1214:
            print(x)
'''

# № 19776 (Уровень: Средний)
'''
def divisors(n):
    div = []
    for j in range(2, int(n ** 0.5)+1):  # не считая самого числа и единицы
        if n % j == 0:
            div += [j, n // j]
    return sorted(set(div))

cnt = 0
for x in range(23_600_000+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) >= 2:
        M = max(d) + min(d)
        if M % 213 == 171:
            print(x, M)
            cnt += 1
            if cnt == 6:
                break
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Egor 7/10 -> 40 вторичных баллов +[1, 4, 5, 10, 12, 13] -[2, 6, 8]

# Второй пробник 28.02.25:
# Egor 12/16 -> 56 вторичных баллов +[1-4, 6, 7, 11-14, 16, 23] -[5, 8, 10, 15]
