# region Домашка: ******************************************************************

# Обратный порядок
'''
n = int(input())
digits = list(reversed([int(i) for i in str(n)]))
for i in range(len(str(n))):
    print(digits[i])


n = int(input())
digits = list(reversed([int(i) for i in str(n)]))
for i in range(len(digits)):
    print(digits[i])

n = int(input())
digits = [int(i) for i in str(n)]
for x in digits[::-1]:
    print(x)


n = int(input())  # 7834

while n > 0:
    print(n % 10)
    n //= 10
'''


# Сколько чисел хватит?
'''
n = int(input())
s = 0
k = 0
for i in range(1, n + 1):
    if s <= n:
        k += 1
        s += i
print(k)
'''


# https://stepik.org/lesson/1309435/step/12?unit=1324551
'''
a = int(input())
b = int(input())
for i in range(a, b + 1):
    if i in (0, 1):
        continue
    flag = True
    for j in range(2, i):
        if i % j == 0:
            flag = False
    if flag == True:
        print(i)
'''


# Простые числа: https://stepik.org/lesson/1309435/step/12?unit=1324551
'''
def is_prime(n):
    if n <= 1:
        return False
    for j in range(2, n):
        if n % j == 0:
            return False
    return True


a = int(input())
b = int(input())
for n in range(a, b + 1):
    if is_prime(n):
        print(n)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Основные свойства списков
'''
A = [1, 2, 3, '5', [1, 2, 3]]  # list (список)
# 1. Может хранить в себе неограниченное кол-во элементов различных типов данных
# 2. Каждый элемент имеет свой порядковый номер: индекс
# 3. Индексы начинают свою нумерацию слева-направо с 0 или справа-налево с -1
# 4. В отличие от строк и кортежей в списках можно изменять элементы через индексы

# i   0    1    2    3
M = ['a', 'b', 'c', 'd']
# -i -4   -3   -2   -1

print(f'Первый элемент списка М: {M[0]}')
print(f'Последний элемент списка М: {M[3]}')
print(f'Последний элемент списка М: {M[-1]}')

M[0], M[-1] = 'A', 'D'
print(M)  # ['A', 'b', 'c', 'D']


# i   0    1    2    3    4
A = ['a', 'b', 'c', 'd', 'e']
for i in range(len(A)):
    A[i] = A[i] * i
print(A)  # ['', 'b', 'cc', 'ddd', 'eeee']
'''


# Срезы списков и строк
'''
# i   0    1    2    3    4
A = ['a', 'b', 'c', 'd', 'e']
a = 'abcde'

# СРЕЗ[START : STOP-1 : STEP=1]
print(A[1:4])   # ['b', 'c', 'd']
print(A[:4])   # ['a', 'b', 'c', 'd'] - все, что слева до индекса 4-1
print(A[2:])   # ['c', 'd', 'e'] - все, что справа от индекса 2 (включительно)

print(A[:])  # ['a', 'b', 'c', 'd', 'e'] - вывести все элементы
print(A[::])  # ['a', 'b', 'c', 'd', 'e']
print(A[::2])  # ['a', 'c', 'e'] - все элементы с четными индексами
print(A[1::2])  # ['b', 'd'] - все элементы с нечетными индексами
print(A[::-1])  # ['e', 'd', 'c', 'b', 'a'] - все элементы в обратном порядке
print(a[::-1])  # edcba - все элементы в обратном порядке

print(A[2:])  # ['c', 'd', 'e'] - все элементы, кроме первых двух (0, 1)
'''


# Функции списков
'''
from math import prod

M = [4, 5, 2, 3, 3, 3]
print(len(M))  # возвращает длину списка (кол-во элементов в нем)
print(sum(M))  # возвращает сумму элементов списка (если это числа)
print(prod(M))  # возвращает произведение элементов списка
print(max(M), min(M))  # возвращают максимальный и минимальный элементы списка

print(sorted(M))  # [2, 3, 3, 3, 4, 5] - возвращает отсортированный список элементов
print(sorted('hello3421'))  # ['1', '2', '3', '4', 'e', 'h', 'l', 'l', 'o']

print(reversed(M))  # <list_reverseiterator object at 0x102503b50>
print(list(reversed(M)))  # [3, 3, 3, 2, 5, 4] - развернули элементы списка

print(set(M))  # {2, 3, 4, 5} - убирает копии элементов 
'''



# 🖥 Все методы списков в Python, которые понадобятся на ЕГЭ

# Метод .append() используется для добавления элемента в конец списка. Пример:
'''
my_list = [1, 2, 3]
my_list.append(4)
my_list.append(5)
print(my_list)  # Вывод: [1, 2, 3, 4, 5]
'''

# Можно реализовать через конкатенацию (склеивание) списков:
'''
my_list = [1, 2, 3]
my_list = [0] + my_list + [4, 5]
print(my_list)  # Вывод: [0, 1, 2, 3, 4, 5]
'''


# Метод .reverse() изменяет порядок элементов в списке на обратный. Пример:
'''
my_list = [1, 2, 3, 4]
my_list.reverse()
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# Можно записать по другому через срез:
'''
my_list = [1, 2, 3, 4]
my_list = my_list[::-1]
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# Метод .count() возвращает количество вхождений заданного элемента в список. Пример:
'''
my_list = [1, 2, 2, 3, 4, 2]
print(my_list.count(2))  # Вывод: 3
'''


# Метод .remove() удаляет первое вхождение указанного элемента из списка. Пример:
'''
my_list = [1, 2, 3, 2, 4]
my_list.remove(2)  # Первая найденная двойка
print(my_list)  # Вывод: [1, 3, 2, 4]
'''

# Можно удалить элемент через его индекс используя del:
'''
# i        0  1  2  3  4
my_list = [1, 2, 3, 2, 4]
del my_list[1]  # Индекс удаляемого элемента
print(my_list)  # Вывод: [1, 3, 2, 4]
'''


# Метод .index() возвращает индекс первого вхождения заданного элемента в списке. Пример:
'''
# i        0  1  2  3  4
my_list = [1, 2, 3, 2, 4]
print(my_list.index(2))  # Вывод: 1
'''


# Метод .sort() сортирует элементы списка по возрастанию (по умолчанию) или в обратном порядке, если передан аргумент reverse=True. Пример:
'''
my_list = [4, 1, 3, 2]
my_list.sort()
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list.sort(reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# Скажу честно я не любитель этого метода, считаю, что удобнее будет использовать функцию sorted():
'''
my_list = [4, 1, 3, 2]
my_list = sorted(my_list)
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list = sorted(my_list, reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# Генераторы списков: [что кладем | откуда берем | при каком условии]
'''
M = [x for x in range(1, 10)]  # [1, 2, 3, 4, 5, 6, 7, 8, 9]

M = [x for x in range(1, 10) if x % 2 == 0]  # [2, 4, 6, 8]


M = [int(x) for x in str(123456789)[1::2] ]  # [2, 4, 6, 8]
M = [int(x) for x in str(123456789) if int(x) % 2 == 0]  # [2, 4, 6, 8]
M = [int(x) for x in str(123456789) if x in '02468']  # [2, 4, 6, 8]


a = 'abcde'
M = [x for x in a if x in 'ae']  # ['a', 'e']

# Открытие файла для 17 номера
M = [int(x) for x in open('0. files/17.txt')]


# Открытие файла для 9 номера
for s in open('0. files/9.csv'):
    M = [int(x) for x in s.split(',')]
    print(s, M) # '66,39,77,31,132,117'  [66, 39, 77, 31, 132, 117]
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке: # Функции строк + Методы строк
