# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Единицы измерения информации
# 1 бит - минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# № 19557 (Уровень: Базовый)

# photo_bit = pixels * i, где i - это кол-во бит на пиксель
# colors = 2 ** i
'''
pixels = 1920 * 1080
colors = 2048  # 2 ** i >= 2048
i = 11
photo_bit = pixels * i
print(photo_bit)
photos_313 = photo_bit * 313
print(photos_313 / 2**23)  # 851.0833
'''
# Ответ: 852


# № 15319 Досрочная волна 2024 (Уровень: Базовый)
'''
pixels = 2764 * 1793
colors = 7026  # 2 ** 13 >= 7026
i = 13
photo_bit = pixels * i
photos_148 = photo_bit * 148
print(photos_148 / 18_349_566)  # 519.63
'''


# № 14409 (Уровень: Средний)
'''
pixels = 1280 * 1024
i = 16  # 2 ** 16 >= colors (65536)
photo_bit = pixels * i
print((24*60*60) / 20)  # 4320
print((photo_bit * 4320) / 2**23)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 4, 5, 6, 8, 12, 13, 14, 15, 16, 23]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Egor 7/10 -> 40 вторичных баллов +[1, 4, 5, 10, 12, 13] -[2, 6, 8]
