# region Домашка: ******************************************************************


# № 17548 Основная волна 08.06.24 (Уровень: Базовый)
'''
# colors = 2 ** i
# V = pixels * i

# 2048 >= 2 ** 11
i = 11
v = 1024 * 960 * i  # Одна фотка
m = 96_468_992 * 280   # Объем всего пакета фоток

print(m / v)  # 2497.93
'''

# colors = 2 ** i
# V = pixels * i


# № 17626 Основная волна 19.06.24 (Уровень: Базовый)
'''
m = 1_966_080 * 280   # Объем всего пакета фоток
V = m / 39
pixels = 1280 * 1024
i = V / pixels
print(i)  # 10.7692307
print(2**10)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Задание 11 https://education.yandex.ru/ege/task/8cdef5ec-7247-4ed7-aa24-502481f2a4c8
'''
# pin: symbols = 4, alphabet = 10 (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

symbols = 163
alphabet = 10 + 1500
# alphabet = 2 ** i , 2**i >= alphabet
print(2**11)
i = 11  # бит на один символ
bit = symbols * i  # бит
print(bit / 8)  # 224.125
byte = 225
print((byte * 65536) / 2**10)
'''


# https://education.yandex.ru/ege/task/fe6ce526-abbb-40cd-8a91-ccfd1a766e1d
'''
symbols = 64
alphabet = 26 * 2
print(2**6)  # 2**6 >= 52
i = 6
bit = symbols * i
print(bit / 8)  # 48.0

byte = 48
print(((byte + 64) * 768) / 2**10)
'''


# https://education.yandex.ru/ege/task/30431c9e-dfcf-41dc-8b5d-1c0fd87fcb2e
'''
symbols = 31
alphabet = 10 + 26
i = 6
bit = symbols * i
print(bit / 8)  # 23.25
byte = 24


V = (12 * 2**10) / 128  # вес одного пользователя
print(V - byte)
'''


#
# todo разобрать № 17552 Основная волна 08.06.24 (Уровень: Сложный)
'''
symbols = 261

byte = (31 * 2**20) / 252_500
print(byte)  # 128.736
bit = byte * 8
i = bit / symbols
print(i)
print(2**i)
'''


'''
byte = (11 * 2 ** 20) / 600_000
print(byte)
byte = 19
bit = byte * 8
symbols = 20
i = bit / symbols
print(i)
print(2**7)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 11-, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
