# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Тип 24 №38602
# Текстовый файл состоит из символов P, Q, R и S.
# Определите максимальное количество идущих подряд символов в прилагаемом файле,
# среди которых нет идущих подряд символов P.
'''
s = open('0. files/24.txt').readline()
while 'PP' in s:
    s = s.replace('PP', 'P P')
print(max([len(x) for x in s.split()]))
'''

# Тип 24 №48472
# Текстовый файл содержит только буквы A, C, D, F, O.
# Определите максимальное количество идущих подряд групп символов вида:
'''
s = open('0. files/24.txt').readline()
s = s.replace('O', 'A').replace('C', 'D').replace('F', 'D')
s = s.replace('AAD', '*')
s = s.replace('A', ' ').replace('D', ' ')
print(max([len(x) for x in s.split()]))
'''


# Тип 24 №27699
# Определите максимальную длину цепочки вида LDRLDRLDR...
# (составленной из фрагментов LDR, последний фрагмент может быть неполным).
'''
s = open('0. files/24.txt').readline()
maxi = 0
count = 2
for i in range(len(s)-2):
    if s[i:i+3] in ('LDR', 'DRL', 'RLD'):
        count += 1
        maxi = max(maxi, count)
    else:
        count = 2
print(maxi)
'''

# Тип 24 №39253
# Определите максимальное количество идущих подряд символов,
# среди которых не более одной буквы D.
'''
s = open('0. files/24.txt').readline()
s = s.split('D')
maxi = 0
for i in range(len(s)-2):
    r = 'D'.join(s[i:i+2])
    maxi = max(maxi, len(r))
print(maxi)
'''

# Тип 24 №63073
# Определите максимальное количество идущих подряд символов,
# среди которых каждая из букв C и D встречается не более двух раз.
'''
s = open('0. files/24.txt').readline()
s = s.replace('C', 'C ').replace('D', 'D ')
s = s.split()
maxi = 0
for i in range(len(s) - 4):
    r = ''.join(s[i:i+5])[:-1]  # EKHABHHPED -> EKHABHHPE_
    if r.count('C') == 2 and r.count('D') == 2:
        maxi = max(maxi, len(r))
    
print(maxi)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]

# Второй пробник 28.02.25:
# Егор -
# Михаил 17/29 -> 70 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-16, 18, 19-20, 23, 25] -[5, 7, 10, 13, 17, 21, 22, 24]
