# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
def F(a, b):
    if a >= b or a == 9:
        return a == b
    return F(a+1, b) + F(a*2, b)


print(F(1, 10) * F(10, 20))  # 10 + 8 = 18
'''

'''
def F(a, b, c):
    if a > b:
        return 0
    if a == b:
        c = c.split('.')
        if (('9' in c) + ('10' in c)) == 1:
            print(c)
            return 1
        else:
            return 0

    else:
        return F(a+1, b, c+'.'+str(a)) + F(a*2, b, c+'.'+str(a))


print(F(1, 20, ''))


def F(a, b, c):
    if a >= b:
        c = c.split('.')
        return a == b and (('9' in c) != ('10' in c))
    return F(a + 1, b, c + '.' + str(a)) + F(a * 2, b, c + '.' + str(a))


print(F(1, 20, ''))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Егор -
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]
