# region Домашка: ******************************************************************

from itertools import permutations
print('1 2 3 4 5 6 7 8')
table = '13 15 23 25 26 31 32 37 38 45 48 51 52 54 56 57 58 62 65 73 75 78 83 84 85 87'
graph = 'аз за зж жз жв вж дв вд гд дг ег ге еб бе гв вг гб бг зв вз зб бз аг га гж жг'
for p in permutations('абвгджзе'):
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), p[i - 1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
