# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'195.23.86.50/{mask}', 0)
    if '195.23.80.0' in str(net):
        print(net, net.netmask)

'''


# 21900
'''
def convert(n, b):
    s = ''
    while n > 0:
        s += str(n % b)
        n //= b
    return s[::-1]

for x in range(1, 2300):
    n = 7**350 + 7**150 - x
    s = convert(n, 7)
    if s.count('0') == 200:
        print(x)
'''


# № 16325 Открытый вариант 2024 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    s = ''
    while n > 0:
        s += alp[n % b]
        n //= b
    return s[::-1]

n = 2*729**2014 + 2*243**2016 - 2*81**2018 + 2*27**2020 - 2*9**2022 - 2024
s = convert(n, 27)
print(len([x for x in s if x > '9']))
'''

'''
def F(a, b, c):
    if a > b:
        return 0
    if a == b:
        return 1 and 'AAA' not in c and 'BBB' not in c
    else:
        return F(a+1, b, c+"A") + F(a*2, b, c+'B')

print(F(1, 16, ''))
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:

# Первый пробник 21.12.24:
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]

# Второй пробник 28.02.25:
# Михаил 17/29 -> 70 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-16, 18, 19-20, 23, 25] -[5, 7, 10, 13, 17, 21, 22, 24]
# Егор 16/29 -> 68 вторичных баллов +[1-7, 9, 13, 14-18, 23, 25] -[8, 10, 11, 12, 19-21, 22, 24]

# Третий пробник 20.05.25:
# Михаил 19/29 -> 75 вторичных баллов +[1, 2, 5, 6, 7, 9-16, 18-20, 23-25] -[3, 4, 8, 17, 21, 22]
# Егор 15/29 -> 64 вторичных баллов +[2, 4, 7, 9, 10, 11, 14, 15, 16, 17, 18, 22, 23, 24, 25] -[1, 3, 5, 6, 8, 12, 13, 19-21]
