# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# 8
'''
from itertools import *
cnt = 0
for p in product('012345678', repeat=5):
    num = ''.join(p)
    if num[0] != '0':
        if num.count('3') == 2:
            for el in '1357':
                num = num.replace(el, '*')
            if '*2' not in num and '2*' not in num:  # тут должно быть and и проверка идет после замены (после for)
                cnt += 1
print(cnt)
'''


# 17
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5]
D = [x for x in M if abs(x) % 100 == 22]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 2:
        if (x + y + z) <= max(D):
            R.append(x + y + z)
print(len(R), max(R))
'''

# 19-21

def F(s, n):
    if s >= 184:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s+1, n-1), F(s+5, n-1), F(s*4, n-1)]

    return any(h) if (n-1) % 2 == 0 else all(h)

print([s for s in range(1, 184) if F(s, 2)]) # 45
print([s for s in range(1, 184) if F(s, 3) and not F(s, 2)]) # 40, 44
print([s for s in range(1, 184) if F(s, 4) and not F(s, 2)]) # 39, 43





# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке: 22

# Первый пробник 21.12.24:
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]

# Второй пробник 28.02.25:
# Михаил 17/29 -> 70 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-16, 18, 19-20, 23, 25] -[5, 7, 10, 13, 17, 21, 22, 24]
# Егор 16/29 -> 68 вторичных баллов +[1-7, 9, 13, 14-18, 23, 25] -[8, 10, 11, 12, 19-21, 22, 24]

# Третий пробник 20.05.25:
# Михаил 19/29 -> 75 вторичных баллов +[1, 2, 5, 6, 7, 9-16, 18-20, 23-25] -[3, 4, 8, 17, 21, 22]
# Егор 15/29 -> 64 вторичных баллов +[2, 4, 7, 9, 10, 11, 14, 15, 16, 17, 18, 22, 23, 24, 25] -[1, 3, 5, 6, 8, 12, 13, 19-21]
