# region Домашка: ******************************************************************

'''
def convert(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]


L = []
for n in range(1, 10000):
    s = convert(n, 4)
    print(s)
    if sum(map(int, s)) % 2 == 0:
        s = '31' + s + '02'
    else:
        s = '1' + s + convert(((n % 3) * 7), 4)

    r = int(s, 4)
    if r < 4528:
        L.append(n)
print(max(L))


def ch(x, b):
    s = ''
    while x > 0:
        s = str(x % b) + s
        x = x // b
    if s == '':
        return '0'
    return s

res = []
for n in range(1, 10000):
    s = ch(n, 4)
    if sum(int(e) for e in s) % 2 == 0:
        s = '31' + s + '02'
    else:
        s = '1' + s + ch((n % 3) * 7, 4)
    r = int(s, 4)
    if r < 4528:
        res.append(n)
print(max(res))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ  = []
# на следующем уроке:

# Первый пробник 21.12.24:
# Egor 7/10 -> 40 вторичных баллов +[1, 4, 5, 10, 12, 13] -[2, 6, 8]

# Второй пробник 28.02.25:
# Egor 12/16 -> 56 вторичных баллов +[1-4, 6, 7, 11-14, 16, 23] -[5, 8, 10, 15]
