# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# https://education.yandex.ru/ege/task/8172e3b1-0da6-40a8-96c1-c0a5c2131296
'''
a = 2
b = 56000
c = 16
t = 120

v = a * b * c * t  # бит
u = 32000  # бит / с
T = v / u
print(T)  # 6720.0


a = 2
b = 56000 / 2
c = 16
t = 120

v = a * b * c * t  # бит
u = 32000  # бит / с
T2 = v / u
print(T2)  # 3360.0

print(abs(T2 - T))
'''


# https://education.yandex.ru/ege/task/84fa6081-f218-4027-83d3-677e893ca3f7
'''
sym = 7
alp = 10 + 8188  # alp = 2 ** i
i = 14  # 2 ** 14 >= 8198

bit = sym * i  # бит на один пароль
print(bit / 8)  # 12.25 -> 13
byte = 13

print((20240 * byte) / 2**10)
'''

# https://education.yandex.ru/ege/task/221f688c-b7dd-4fd8-b384-f8c245b17f14
'''
sym = 23
alp = 12
i = 4

bit = sym * i  # бит на один пароль
print(bit / 8)  # 11.5 -> 12
byte = 12

# user = byte + dop

user = 13068 / 297
print(user - byte)  # 32.0
'''


# https://education.yandex.ru/ege/task/96f79e32-9433-4b33-a931-1b2f12d675b1
# Известно, что для хранения сведений
# о 2000 изделий отведено не более 124 Кбайт памяти.

sym = 34
# alp - ?
# i - ?

byte = ((124 * 2**10) / 2000) - 28
print(byte)  # 35.488 -> 35
bit = 35 * 8

i = bit / sym
print(i)  # 8.235 -> 8
i = 8

print(2**i)  # 256

i = 8  # [2**7+1:256]
alp = 33  # i = 6

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке: 11, 22, 24

# Первый пробник 21.12.24:
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]

# Второй пробник 28.02.25:
# Михаил 17/29 -> 70 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-16, 18, 19-20, 23, 25] -[5, 7, 10, 13, 17, 21, 22, 24]
# Егор 16/29 -> 68 вторичных баллов +[1-7, 9, 13, 14-18, 23, 25] -[8, 10, 11, 12, 19-21, 22, 24]
