# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
M = [int(x) for x in open('0. files/17.txt')]
R = []  # сюда будем считать значения


# Три прототипа задач 17 номера:

M = [1, 2, 3, 4, 5]

# 1. Под парой подразумевается два идущих подряд элемента последовательности
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# 2. Под тройкой подразумевается три идущих подряд элемента последовательности
# 123 234 345
for i in range(len(M)-2):
    x, y, z= M[i], M[i+1], M[i+2]

# 3. Под парой подразумевается два различных элемента последовательности
# 12 13 14 15
# 23 24 25
# 34 35
# 45

for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]
'''


# № 21416 Досрочная волна 2025 (Уровень: Базовый)


M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if x < 0]
R = []
for i in range(len(M)-2):
    x, y, z= M[i], M[i+1], M[i+2]
    if max(x, y, z) * min(x, y, z) > sum(A):
        R.append(x + y + z)
print(len(R), max(R))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 17б 18, 19-21, 22, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 9

# Первый пробник 21.12.24:
# Egor 7/10 -> 40 вторичных баллов +[1, 4, 5, 10, 12, 13] -[2, 6, 8]

# Второй пробник 28.02.25:
# Egor 12/16 -> 56 вторичных баллов +[1-4, 6, 7, 11-14, 16, 23] -[5, 8, 10, 15]
