# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

# i  01234
s = 'abcde'
# -i    -1

print(f'Первый элемент строки s: {s[0]}')
print(f'Последний элемент строки s: {s[-1]}')


# Срезы строк:
'''
print(s[1:4])  # bcd
print(s[1:])  # bcde
print(s[:4])  # abcd
print(s[::-1])  # edcba
print(s[::2])  # ace - все четные индексы
print(s[1::2])  # bd - все нечетные индексы
'''

# Поменяем местами элементы строки:
# (чтобы изменить элементы строки - ее необходимо пересоздать)
'''
s = 'abcde'
s = s[-1] + s[1:-1] + s[0]
print(s)  # ebcda
'''


# Функции строк
'''
s = 'abcde'
print(max(s))  # e
print(min(s))  # a
print(len(s))  # 5 - вызвращает длину списка
print(sorted(s))  # ['a', 'b', 'c', 'd', 'e']
print(sorted(s, reverse=True))  # ['e', 'd', 'c', 'b', 'a']
print(set(s))  # {'d', 'c', 'a', 'e', 'b'} - убирает копии элемента
'''

# Методы строк

s = 'abecdee'
print(s.count('e'))  # 3 - три буквы нашлись в строке
print(s.index('e'))  # 2 - индекс первого найденного
print(s.rindex('e'))  # 6 - индекс последнего найденного

s = s.replace('e', '*')
print(s)  # ab*cd** - разом заменили все буквы 'e'

s = s.replace('*', '+', 2)
print(s)  # ab+cd+* - заменил первые две найденные '*'

id = '234.42.231.12'

ID = [int(x) for x in id.split('.')]
print(ID)  # [234, 42, 231, 12]

Id = [str(x) for x in ID]
print(', '.join(Id))  # 234, 42, 231, 12


ID = id.split('.')  # - разбивает строку на список строчных элементов
print(ID)  # ['234', '42', '231', '12']

new_id = ''.join(ID)  # - склеивает список строк обратно в строку
print(new_id)  # 2344223112

new_id = ','.join(ID)
print(new_id)  # 234,42,231,12

new_id = '* *'.join(ID)
print(new_id)  # 234* *42* *231* *12

s = 'ufehr         eruhge        eruighj         erkjfg h'
print(s.split(' '))
# ['ufehr', '', '', '', '', '', '', '', '', 'eruhge', '', ...


s = 'ufehr         eruhge        eruighj         erkjfg h'
print(s.split())
# ['ufehr', 'eruhge', 'eruighj', 'erkjfg', 'h']


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6]
# КЕГЭ  = []
# на следующем уроке:
