# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 1. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение 5 процессов

# 2. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение максимального кол-ва процессов
# а время окончания работы всех процессов минимально.

# 3. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение максимального кол-ва процессов
# а время окончания работы каждого процесса минимально.

# 4. Определите максимальную продолжительность отрезка времени
# в течение которого возможно одновременное выполнение максимального кол-ва процессов

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 22, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Егор -
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]
