# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 18120 (Уровень: Базовый)
'''
from itertools import *
n = 0
cnt = 0
for p in product(sorted('ПРЕСТОЛ'), repeat=5):
    word = ''.join(p)
    n += 1
    if n % 2 != 0:
        if word[-1] in 'ЕО':
            if len([x for x in word if x in 'ПРСТЛ']) <= 3:
                cnt += 1
print(cnt)
'''


# № 18133 (Уровень: Базовый)
'''
from itertools import *
n = 0
for p in product(sorted('КОДИМ'), repeat=5):
    word = ''.join(p)
    n += 1
    if word.count('М') == 2 and 'ММ' not in word:
        print(n)
'''


# № 11294 (Уровень: Базовый)
'''
from itertools import *
cnt = 0
for p in product('ДГШЯБЖ', repeat=6):
    word = ''.join(p)
    if word.count('Я') == 1:
        cnt += 1
print(cnt)
'''


# № 11201 (Уровень: Средний)
'''
from itertools import *
cnt = 0
for p in permutations('ПАЙТОН'):
    word = ''.join(p)
    summa = word.index('А')+1 + word.index('О')+1
    if summa == 6:
        cnt += 1
print(cnt)
'''


# № 11657 (Уровень: Базовый)
'''
from itertools import *
cnt = 0
for p in permutations('01234567', r=6):
    num = ''.join(p)
    if num[0] != '0':
        if '3' not in num:
            for x in '0246':
                num = num.replace(x, '2')
            if '22' in num:
                cnt += 1
print(cnt)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25]
# КЕГЭ  = []
# на следующем уроке: 7, 8, 11, 13, 19-21, 22, 24

# Первый пробник 21.12.24:
# Михаил 8/18 -> 46 вторичных баллов +[2, 4, 6, 12, 14, 15, 16, 23] -[1, 3, 5, 7, 8, 9, 11, 13, 17, 25]

# Второй пробник 28.02.25:
# Михаил 17/29 -> 70 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-16, 18, 19-20, 23, 25] -[5, 7, 10, 13, 17, 21, 22, 24]
# Егор 16/29 -> 68 вторичных баллов +[1-7, 9, 13, 14-18, 23, 25] -[8, 10, 11, 12, 19-21, 22, 24]
