# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Номер 13 Пробник номер 3
'''
from ipaddress import *
for mask in range(0, 32+1):
    net = ip_network(f'195.23.86.50/{mask}', 0)
    if '195.23.80.0' in str(net):
        print(net.netmask)
'''


# Номер 14 Пробник номер 3
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:22]:
    A = int(f'63{x}59685', 22)
    B = int(f'17{x}53', 22)
    C = int(f'36{x}5', 22)
    if (A + B + C) % 21 == 0:
        print((A + B + C) // 21)
'''


# Номер 11 Пробник номер 3
'''
sym = 15
alp = 12
i = 4

bit = sym * i
print(bit / 8)  # 7.5 -> 8

byte = 8

# user = byte + dop

user = 400 / 20
print(user - byte)  # 12 
'''

# 18, 6, 24


# Номер 6 Пробник номер 3


# # endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = [7, 11, ]
# на следующем уроке: немного 5 и переходим к 8, 4, 17, 12, 22, 27, 24, 26


# region 📖 Пробник (Вариант 2)

# Студент #Иван
# Дата: #Пятница #06Марта2026
# ✅ Верно: 1, 2, 3, 6, 7, 9, 11, 13, 14, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 4, 5, 8, 10, 12, 15, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных


# Студент #Egor
# Дата: #Понедельник #16Марта2026
# ✅ Верно: 1, 2, 3, 15, 16, 19, 20, 21, 25
# ⛔️ Неверно: 6
# ❔ Без ответа: 4, 5, 7, 8, 9, 10, 11, 12, 13, 14, 17, 18, 22, 23, 24, 26, 27
# Итог: 9/29 первичных балла ~ 48 вторичных

# region 📖 Пробник (Вариант 2)
