
# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Администратор/Грузоперевозки: =ЕСЛИ(B2<$E$1;1;"")
# Задачи: 24 2944 1275 1395 27636 1304 1207 788 225

# Коржи/Коробки: =ЕСЛИ(B1-A2>=8;A2;B1)
# Задачи: 27779 21910 16335 21424 15341 7096 4712 4604

# Распределение мест  =ЕСЛИ(И(A2=A1;B2-B1=3);B2-2;"")
# Задачи: 1868, 2613, 7274, 3664, 3586, 3230

# Магазин
# Задачи: 2614, 954, 507, 495617643

# Очередь в кассу
# Задачи:

# Организация сортировки
# Задачи:



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [12, 13, 19-21, 24.1, 27б 26.1]
# КЕГЭ = []
# на следующем уроке: 27 номер с досрока

# Получаются: 1, 2, 3, 4, 6, 10, 11, 15, 17, 18, 23
# 50 / 50: 5, 7, 9, 16,
# Не получаются: 8, 14, 22, 25
# Не разбирали: 24, 26


# region 📖 Пробник (Вариант 2)

# Студент #Эллина
# Дата: #Понедельник #16Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 15, 16, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17, 18, 22, 27
# ❔ Без ответа: 6, 14, 24, 26
# Итог: 20/29 первичных балла ~ 78 вторичных

# endregion 📖 Пробник (Вариант 2)



