
# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Администор 24 2944 1275 1395 27636 1304 1207 788 225
# Коробки/коржи
# Места в театре
# Лента магазина
# Очередь покупателей
# Аренда времени


file = open('files/26.txt')
d, e, n = [int(x) for x in file.readline().split()]

M = sorted([int(x) for x in file.readlines()])
D = [x for x in M if x > 500]
E = [x for x in M if x < 500]

R1 = []
while sum(R1) + D[0] <= d:
    R1.append(D[0])
    D = D[1:]

R2 = []
while sum(R2) + E[0] <= e:
    R2.append(E[0])
    E = E[1:]

print(len(R1) + len(R2))


del R1[-1]
for x in D[::-1]:
    if x <= d - sum(R1):
        print(x)
        break


del R2[-1]
for x in E[::-1]:
    if x <= e - sum(R2):
        print(x)
        break

print(977 + 404)




# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [12, 13, 19-21, 24.1, 27б 26.1]
# КЕГЭ = []
# на следующем уроке: 27 номер с досрока

# Получаются: 1, 2, 3, 4, 6, 10, 11, 15, 17, 18, 23
# 50 / 50: 5, 7, 9, 16,
# Не получаются: 8, 14, 22, 25
# Не разбирали: 24, 26


# region 📖 Пробник (Вариант 2)

# Студент #Эллина
# Дата: #Понедельник #16Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 15, 16, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17, 18, 22, 27
# ❔ Без ответа: 6, 14, 24, 26
# Итог: 20/29 первичных балла ~ 78 вторичных

# endregion 📖 Пробник (Вариант 2)



