# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1


#                             0  1  2  3
# sorted([2, 6, 3, 7, 8]) -> [2, 3, 6, 7, 8]
# sorted([2, 6, 3, 7, 8], reverse=True) -> [8, 7, 6, 3, 2]

'''
count = 0
for s in open("files/9.csv"):
    M = sorted([int(x) for x in s.split(",")])
    if len(set(M)) == 5:
        # if (max(M) + min(M)) * 3 <= (sum(M) - (max(M) + min(M))) * 2:
        if (M[0] + M[-1]) * 3 <= (M[1] + M[2] + M[3]) * 2:
            count += 1
print(count)
'''


count = 0
for s in open("files/9.csv"):
    M = sorted([int(x)for x in s.split(",")])
    D = [x for x in M if x % 3 == 0]
    if len(D) == 3:
        if (max(M) - min(M)) <= sum(D):
            count += 1
print(count)


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9-, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25.1]
# КЕГЭ = [12]
# на следующем уроке:
