# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# Открыть файл 17 номера
'''
M = [int(x) for x in open('files/17.txt')]


# Рассмотрим три прототипа задач:
M = [1, 2, 3, 4, 5]

# 1. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# 2. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.
# 123 234 345
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]

# 3. В данной задаче под парой подразумевается два различных элемента последовательности.
# 12 13 14 15
# 23 24 25
# 34 35
# 45
for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]
'''


# № 14952 (Уровень: Средний)
'''
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if str(x)[-3:] == '121']
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    D = [p for p in (x, y, z) if p % 2 == 0 and len(str(abs(p))) == 4]
    if len(D) <= 1:
        if (x + y + z) <= max(A):
            R.append(x + y + z)
print(len(R), max(R))
'''


# № 16383 ЕГКР 27.04.24 (Уровень: Базовый)
'''
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if abs(x) % 100 == 21 and len(str(abs(x))) == 5]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) != (y in A):
        if (x**2 + y ** 2) >= max(A) ** 2:
            R.append(x + y)
print(len(R), max(R))
'''




# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25.1]
# КЕГЭ = [12]
# на следующем уроке: 7, 9, 10,
