# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# bit = pixels * i, где i - это кол-во бит на один пиксель
# colors = 2 ** i

# № 19568 (Уровень: Средний)
'''
pixels = 1280 * 1024
colors = 256  # 2 ** 8 >= 256
i = 8
bit = pixels * i  # вес фотографии в битах


flesh = (4 * 2**33)   # бит на флешке (карте)
photos = flesh // bit  # фотографий на одной карте
print(photos * 34 + 307)
'''


# № 19557 (Уровень: Базовый)
'''
pixels = 1920 * 1080
colors = 2048  # 2 ** i <= 2048
i = 11
bit = pixels * i
bit_all = bit * 313
print(bit_all / 2**23)
'''
# Ответ: 852


# № 18613 (Уровень: Средний)
'''
pixels = 1536 * 1024
colors = 4096  # 2 ** 12 >= 4096
i = 12
bit = (pixels * i) * 0.2  # 100% -> 20% - значит сжали на 80% 

bit_all = bit * 150

U = 288 * 2**13  # кол-во битов пролетает за 1 сек
print((bit_all / U) / 60)  # до сжатия один пакет улетал за 20 мин
'''
# Ответ: 80


# № 19556 (Уровень: Базовый
'''
# bit = a  *  b *  c  * t
# бит = шт * Гц * бит * сек

a = 2
b = 48000
c = 18
# t - ?

bit = 196 * 2**23  # Мбайты перевели в биты
t = bit / (a * b * c)  # сек
print(t / 60)   # 15.85809
'''
# Ответ: 16


# № 11226 (Уровень: Средний)

# bit = a  *  b *  c  * t
# бит = шт * Гц * бит * сек
'''
a = 2  # Шт
b = 4000  # Гц
c = 7 * 2**3  # бит
# t - ?

bit = 86000 * (56*60)  # сек передавалось сообщение
t = bit / (a * b * c)  # сек
print(t / 60)  # 10.75
'''
# Ответ: 11


# № 17934 (Уровень: Средний)
'''
symbols = 99
alphabet = 10 + 510  # alphabet = 2 ** i
i = 10  # 2 ** 10 >= alphabet, где i - кол-во бит на символ
bit = symbols * i

print(bit / 8)  # 123.75 -> 124
byte = 124

user = (543 * 2**10) / 4322  # байт на одного пользователя
dop = user - byte
print(dop)  # 4.65155020 -> 5
'''


# № 17931 (Уровень: Средний)
'''
# symbols - ?
alphabet = 10 + 52 + 1988
i = 12  # 2 ** 12 >= alphabet
byte = (579 * 2**10) / 1974  # 300.35258 - на одного пользователя
byte = 300
bit = byte * 8
symbols = bit / i
print(symbols)
'''


# № 17745 (Уровень: Базовый)
'''
symbols = 256
alphabet = 4080 + 10
i = 12

bit = symbols * i
print(bit / 8)  # 384.0
byte = 384

print((byte * 2**16) / 2**20)  # байт -> Кбайт -> Мбайт
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25.1]
# КЕГЭ = [12, 17]
# на следующем уроке: 7, 9, 10,


# Первый пробник 21.12.24:
# 4/8 -> 27 вторичных баллов +[1, 10, 16, 23] -[2, 4, 12, 15]


