# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************
'''
from itertools import *
R = []
for p in permutations('ПРОСТО'):
    s = ''.join(p)
    if 'ОО' not in s:
        R.append(s)
print(len(set(R)))

from itertools import *

M = []
for x in permutations('ПРОСТО'):
    slovo = "".join(x)
    if "ОО" not in slovo:
        M.append(slovo)
print(len(set(M)))
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25.1]
# КЕГЭ = [7, 11, 12, 17]
# на следующем уроке: 9, 10,


# Первый пробник 21.12.24:
# 4/8 -> 29 вторичных баллов +[1, 10, 16, 23] -[2, 4, 12, 15]

# Второй пробник 28.02.25:
# 10/29 -> 48 вторичных баллов +[1, 2, 4, 10, 12, 14, 15, 16, 23, 25] -[11]
