# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# Вариант: https://kompege.ru/variant?kim=25073855

# Номер 12
'''
for n in range(4,10000):
    s = "1" + "2" * n
    while "12" in s or "322" in s or "222" in s:
        if "12" in s:
            s = s.replace("12","2",1)
        if "322" in s:
            s = s.replace("322","21",1)
        if "222" in s:
            s = s.replace("222","3",1)
    # summa = sum([int(x) for x in s])
    summa = sum(map(int, s))
    if summa == 15:
        print(n)
        break
'''


# Номер 8
'''
from itertools import*
n = 0
for x in product(sorted("ЯНВАРЬ"),repeat = 5):
    word = ''.join(x)
    n += 1
    a, b, c, d, e = word
    if a != 'Я':
        if word.count('Ь') <= 1:
            if 'ЯЯ' not in word:
                print(n)
'''


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25.1]
# КЕГЭ = [7, 11, 12, 17]
# на следующем уроке: 9, 10,


# Первый пробник 21.12.24:
# 4/8 -> 27 вторичных баллов +[1, 10, 16, 23] -[2, 4, 12, 15]


