# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

'''
from math import ceil, floor
def F(a ,s, n):
    if a+s >= 77:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(a+3,s, n-1), F(a,s+3, n-1),F(a*3, s, n-1),F(a, s*3, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)

print([s for s in range(1,65) if F(12,s, 2)])
print([s for s in range(1,65) if F(12,s, 3) and not F(12,s, 1)])
print([s for s in range(1,65) if F(12,s, 4) and not F(12,s, 2)])
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25]
# КЕГЭ = [7, 11, 12, 17, 19-21, 22]
# на следующем уроке: 9, 10,


# Первый пробник 21.12.24:
# 4/8 -> 29 вторичных баллов +[1, 10, 16, 23] -[2, 4, 12, 15]

# Второй пробник 28.02.25:
# 10/29 -> 48 вторичных баллов +[1, 2, 4, 10, 12, 14, 15, 16, 23, 25] -[11]
