# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

'''
M = []
for n in range(1, 1000):
    s = f'{n:b}'  # s = bin(n)[2:]
    s += str(s.count('1') % 2)
    s += str(s.count('1') % 2)
    r = int(s, 2)
    if r > 198:
        M.append(r)
print(min(M))
'''

# Задание 8 https://education.yandex.ru/ege/task/787e3e6e-9284-4a9d-953a-8c3d24123b2a


from itertools import *
k = 0
for p in permutations('АРТЕМ', r=5):
    word = ''.join(p)
    if (word[0] in 'РТМ') or (word[-1] in 'РТМ'):
        print(word)
        k += 1
print(k)






# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 7, 8, 9-, 11, 12, 14, 15, 16, 17-, 18, 19-21, 22, 23, 25.1]
# КЕГЭ = [12]
# на следующем уроке:
