# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# 8
'''
n = 0
from itertools import*
for i in product('бикнорс',  repeat = 6):
    word = ''.join(i)
    n += 1
    if word[0] != 'р':
        if word.count("б") == 2:
            if word.count("к") <= 1:
                print(word, n)
'''


# 17
'''
z = [int(i) for i in open('files/17.txt')]
p = [i for i in z if len(str(abs(i))) == 5]
d = [i for i in z if str(i)[-2:] == '29']
s = []
cnt = 0
for i in range(len(z) - 2):
    a, b, c = z[i], z[i+1], z[i+2]
    if (a in p) + (b in p) + (c in p) == 2:
        if a+b+c <= max(d):
            s.append(a+b+c)
print(len(s), max(s))
'''


# 24
'''
z = open('files/24.txt').readline()
mini = 10**9
z = z.split('T')
for i in range(len(z)-208):
    r = 'T' + 'T'.join(z[i:i+209]) + 'T'
    mini = min(mini, len(r))
print(mini)
'''




# ⛔️ Неверно: 6, 8, 10, 17, 22, 24, 27

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 27]
# КЕГЭ = []
# на следующем уроке:



# Федор
# Легкие/Сложнее: 10 1 2 3 4 5 6 7 8 11 12 13 14 16 19 20 2117 18 22 23 25 27
# Не помню/незнаю: 24 15 26

# Дмитрий
# Легкие:1,2,3,5,8,11,12,13,14,15,16,19,20,21,22
# 50/50: 4,6,7,9,10,23
# Не помню/Сложно:26,24,27,17,18
