# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Голосовое сообщение длительностью 2 минуты было
# закодировано в формате квадро с разрешением 16 бит
# и частотой дискретизации 48000 измерений в секунду и
# передано по каналу связи за 12800 секунд.
#
# Определите пропускную способность канала связи в бит/с.
# В ответе запишите только целое число.

# V = a * b * c * t
'''
t = 120
a = 4
b = 48000
c = 16
V = a * b * c * t
print(V)  # 368640000

T = 12800  # сек передачи
print(V // T)  # 28800 - В ответе запишите только целое число.
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке:
