# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 25354 ЕГКР 13.12.25 (Уровень: Средний)
'''
def F(x, y, A):
    return (78125 != y + 4*x) or (A > x) and (A > y)
# 78125 != y + 4*x -> y != 78125 - 4*x

for A in range(0, 100000):
    if all(F(x, 78125 - 4*x, A) for x in range(1, 20000)):
        print(A)
        break
'''


# № 23265 Основная волна 11.06.25 (Уровень: Базовый)
'''
print(21 * 13 + 14 * 7 - 6 * 12)

import turtle as t
t.tracer(0)
t.screensize(5000, 5000)
t.left(90)
size = 20

# Тут будет псевдокод
for i in range(2):
    t.forward(20 * size)
    t.left(270)
    t.forward(12 * size)
    t.right(90)
t.up()
t.forward(9 * size)
t.right(90)
t.forward(7 * size)
t.left(90)
t.down()
for i in range(2):
    t.forward(13 * size)
    t.right(90)
    t.forward(6 * size)
    t.right(90)

# Тут перебираем точки:
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * size, y * size)
        t.dot(3, 'red')
t.update()
t.done()
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 27]
# КЕГЭ = []
# на следующем уроке:

# Федор
# Легкие/Сложнее: 10 1 2 3 4 5 6 7 8 11 12 13 14 16 19 20 2117 18 22 23 25 27
# Не помню/незнаю: 24 15 26

# Дмитрий
# Легкие:1,2,3,5,8,11,12,13,14,15,16,19,20,21,22
# 50/50: 4,6,7,9,10,23
# Не помню/Сложно:26,24,27,17,18
