# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 28937 ЕГКР 18.04.26 (Уровень: Базовый)
'''
from functools import *

@lru_cache(None)
def G(n):
    if n >= 22560:
        return n / 23 + 33
    if n < 22560:
        return G(n + 11) - 4

@lru_cache(None)
def F(n):
    if n >= 21:
        return F(n - 8) + 1095
    if n < 21:
        return 10 * (G(n - 7) - 36)

for n in range(22600-1, -1, -1):
    G(n)

for n in range(0, 550):
    F(n)

print(F(548))
'''

# № 27076 (Уровень: Средний)
'''
from functools import *

@lru_cache(maxsize=None)
def f(n):
    if n < 43:
        return g(n+4)
    else:
        return 2*f(n-2) - f(n-4) + 2

@lru_cache(maxsize=None)
def g(n):
    if n < 11240:
        return g(n+3) + 2
    else:
        return q(n)

@lru_cache(maxsize=None)
def q(n):
    if n < 21:
        return n+4
    else:
        return q(n-4) + 2

for i in range(0, 12000):
    q(i)

for i in range(12000-1, -1, -1):
    g(i)

for i in range(0, 2030):
    f(i)

print(f(2026))
'''


# F(n) = (n + 4) * F(n - 7)
# F(157163) = (157163 + 4) * F(157156)
# F(157156) = (157156 + 4) * F(157149)
# F(157149) = (157149 + 4) * F(157142) / F(157142)
'''
half1 = ((157163 + 4) * (157156 + 4) * (157149 + 4)) / 234
half2 = (157149 + 4) / 533
print(half1 + half2)
'''



# № 28755 Досрочная волна 2026 (Уровень: Базовый)
# – четыре числа нельзя разбирать на две пары с равными суммами.
'''
cnt = 0
from itertools import permutations
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    if max(M) < sum(M) - max(M):
        if all(P[0] + P[1] != P[2] + P[3] for P in permutations(M, r=4)):
            cnt += 1
print(cnt)
'''


# № 23282 Основная волна 11.06.25 (Уровень: Средний)
'''
def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1):  # не считая самого числа
        if x % j == 0:
            d += [j, x//j]
    return sorted(set(d))

cnt = 0
for x in range(5_400_000+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) > 0:
        M = min(d) + max(d)
        if M > 60000 and str(M) == str(M)[::-1]:
            print(x, M)
            cnt += 1
            if cnt == 5:
                break

'''



# № 28944 ЕГКР 18.04.26 (Уровень: Базовый)
# Напишите программу, которая перебирает целые числа, большие 8 996 452,
# в порядке возрастания и ищет среди них числа, представленные в виде
# произведения ровно двух простых множителей, не обязательно различных,
# каждый из которых содержит в своей записи ровно две цифры 3.
# В ответе в первом столбце таблицы запишите первые 5 найденных чисел в
# порядке возрастания, а во втором столбце - для каждого из чисел
# соответствующий им наибольший из найденных множителей.
'''
def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x//j]
    return sorted(set(d))

cnt = 0
from itertools import product
for x in range(8_996_452+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0 and str(j).count('3') == 2]
    if len(d) > 0:
        for P in product(d, repeat=2):
            if P[0] * P[1] == x:
                print(x, max(P))
                cnt += 1
                break
        if cnt == 5:
            break
'''
# [2, 3, 13, 23, 5021]
# 2 3
# 2 2
# 3 3
# 2 13
# 2 13
# 23 2
# 23 3
# 23 13
# ...


# № 28711 (Уровень: Базовый)
# Напишите программу, которая перебирает целые числа, большие 2 400 000,
# в порядке возрастания и ищет среди них числа, представимые в виде произведения
# ровно трёх различных простых множителей, каждый из которых содержит в своей
# записи хотя бы одну цифру 4 или 7. В ответе запишите первые пять чисел
# в порядке возрастания, справа от каждого числа запишите его
# наибольший простой делитель.

def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x//j]
    return sorted(set(d))

cnt = 0
from itertools import permutations
for x in range(2_400_000+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0 and str(j).count('4') + str(j).count('7') >= 1]
    if len(d) > 0:
        if any(P[0] * P[1] * P[2] == x for P in permutations(d, r=3)):
            print(x, max(d))
            cnt += 1
            if cnt == 5:
                break

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 27]
# КЕГЭ = [8, 15, 16, 23, 25]
# на следующем уроке:


# region 📖 Пробник (Вариант 2)

# Студент #Федор
# Дата: #Вторник #03Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 9, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 6, 8, 10, 17, 22, 24, 27
# ❔ Без ответа: 26
# Итог: 19/29 первичных балла ~ 75 вторичных

# Студент #Вадим
# Дата: #Суббота #04Апреля2026
# ✅ Верно: 1, 2, 7, 10, 11, 12, 13, 14, 15, 16, 19, 20, 23, 25
# ⛔️ Неверно: 3, 4, 5, 6, 8, 9, 18, 21, 22, 24
# ❔ Без ответа: 17, 26, 27
# Итог: 14/29 первичных балла ~ 62 вторичных


# endregion 📖 Пробник (Вариант 2)



