# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


#5
"""def R(N):
    t=N
    y=''
    while t>0:
        y+= str(t%3)
        t=t//3
    y=y[::-1]
    if N%3==0:
        y+=y[-3:]
    else:
        y+=str(N%3)+'0'


    return int(y,3)
for N in range(1, 100):
    if R(N)>150:
        print(N)
        break
"""
"""
#8
def R(N):
    t=''
    while N>0:
        t+=str(N%7)
        N=N//7
    while len(t)<6:
        t+='0'
    t=t[::-1]

    return t
for N in range(7**6-1,0,-1):
    if  (R(N)[0]!='5' and R(N).count('0')==2 and R(N).count('2')<2 ):
        print(N+1)
        break
"""
"""#9
M=[]
r=0
for M in open('9.csv'):
    M=M.split(';')
    M=[int(x) for x in M ]
    t=0
    M=sorted(M)
    s=list(set(M))

    t=sum([M.count(x)==2 for x in s])
    if t==2:
        if((sum(M)-sum(s))/2)<(sum(s)-((sum(M)-sum(s)))/5):
            r+=1

print(r)"""
#24
t=open('24.txt').read()

y=[]
o=[]
for i in range(len(t)):
    if t[i]=='T':
        y.append(i)
o.append(y[209])
o.append(len(t)-y[-209])
for r in range(len(y[:-209])):
    o.append(y[r+209]-y[r])
print(min(o)+1)


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 27]
# КЕГЭ = [15, 23]
# на следующем уроке:


# region 📖 Пробник (Вариант 2)

# Студент #Федор
# Дата: #Вторник #03Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 9, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 6, 8, 10, 17, 22, 24, 27
# ❔ Без ответа: 26
# Итог: 19/29 первичных балла ~ 75 вторичных

# endregion 📖 Пробник (Вариант 2)



# Федор
# Легкие/Сложнее: 10 1 2 3 4 5 6 7 8 11 12 13 14 16 19 20 2117 18 22 23 25 27
# Не помню/незнаю: 24 15 26

# Дмитрий
# Легкие:1,2,3,5,8,11,12,13,14,15,16,19,20,21,22
# 50/50: 4,6,7,9,10,23
# Не помню/Сложно:26,24,27,17,18
