# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print('x y z w F ')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = y and (((not w) or z) == x)
                if F == 0:
                    print(x, y, z, w, int(F))

for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = y and (((not w) or z) == x)
                if F == 1:
                    print(x, y, z, w, int(F))
'''

# 12
'''
print(301 * 7)  # 2107

print(100000 - 2107)

print(97893 / 8)

# 12236


print((301 * 7 + 12236 * 8 + 3))
print((301 * 7 + 12236 * 8 + 3) + (301 + 12236 + 1))
'''



def prime(x):
    if x <= 1:
        return False
    for i in range(2, int(x**0.5)+1):
        if x % i == 0:
            return False
    return True


def d(x):
    a = []
    for i in range(2, int(x ** 0.5) + 1):
        if x % i == 0:
            if prime(i) and prime(x // i):
                if str(i).count('2') == 1 and str(x // i).count('2') == 1:
                    a += [i, x // i]
    return sorted(set(a))

k=0
for i in range(5400001, 10**10):
    a = d(i)
    if len(a)>0:
        M=min(a)+max(a)
        if M>60000:
            if str(M)[::-1] == str(M):
                print(i, M)
                k += 1
                if k==5:
                    break





# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25, 27]
# КЕГЭ = []
# на следующем уроке:



# Федор
# Легкие/Сложнее: 10 1 2 3 4 5 6 7 8 11 12 13 14 16 19 20 2117 18 22 23 25 27
# Не помню/незнаю: 24 15 26

# Дмитрий
# Легкие:1,2,3,5,8,11,12,13,14,15,16,19,20,21,22
# 50/50: 4,6,7,9,10,23
# Не помню/Сложно:26,24,27,17,18
