


# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']  # list (списки)
# -i -5   -4   -3   -2   -1
'''
# 1. Могут хранить неограниченное кол-во элементов
# 2. Все элементы могут быть различных типов данных
# 3. Каждый элемент имеет свой прядковый номер - индекс
# 4. Индексы можно считать слева-направо начиная с 0 илил справа-налево начиная с -1
# 5. Мы можем изменять значение элементов списка через индексы

print(f'Последний элемент списка М: {M[-1]}')


A = [2, 2.0, '2', True, [1, 2, 3], (1, 2, 3)]
for x in A:
    print(type(x), x)
    # <class 'int'> 2
    # <class 'float'> 2.0
    # <class 'str'> 2
    # <class 'bool'> True
    # <class 'list'> [1, 2, 3]
    # <class 'tuple'> (1, 2, 3)


M = ['a', 'b', 'c', 'd', 'e']
print(M)  # 5

for i in range(len(M)):
    # print(i, end=' ')  # 0 1 2 3 4
    print(M[i], end=' ')  # a b c d e
print()

for i in range(len(M)):
    M[i] = M[i] * (2 * i)
print(M)  # ['', 'bb', 'cccc', 'dddddd', 'eeeeeeee']
'''


# Срезы списков
'''
# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']  # list (списки)
# -i -5   -4   -3   -2   -1

print(M[1:3])  # ['b', 'c']
print(M[:3])  # ['a', 'b', 'c']
print(M[2:])  # ['c', 'd', 'e']

print(M[1:-1])  # ['b', 'c', 'd'] - кроме первого и последнего

print(M[:])
print(M[::])  # ['a', 'b', 'c', 'd', 'e']

print(M[0::2])  # ['a', 'c', 'e']
print(M[1::2])  # ['b', 'd']


print(M[::-1])  # ['e', 'd', 'c', 'b', 'a']
'''



# Функции списков
'''
M = [1, 3, 3, 3, 2, 2]
print(len(M))  # 6
print(sum(M))
print(min(M), max(M))

print(sorted(M))  # [1, 2, 2, 3, 3, 3]
print(sorted(M, reverse=True))  # [3, 3, 3, 2, 2, 1]
print(sorted(M)[::-1])  # [3, 3, 3, 2, 2, 1]

print(set(M))  # {1, 2, 3} - удаляет копии элементов 
'''


# 🖥  Все методы списков в Python, которые понадобятся на ЕГЭ  #tpy

# 🚩 .APPEND()
# Метод .append() используется для добавления элемента в конец списка. Пример:
'''
my_list = [1, 2, 3]
my_list.append(4)
my_list.append(5)
print(my_list)  # Вывод: [1, 2, 3, 4, 5]
'''

# Можно реализовать через конкатенацию (склеивание) списков:
'''
my_list = [1, 2, 3]
my_list = [0] + my_list + [4, 5]
print(my_list)  # Вывод: [0, 1, 2, 3, 4, 5]
'''

# 🚩 .REVERSE()
# Метод .reverse() изменяет порядок элементов в списке на обратный. Пример:
'''
my_list = [1, 2, 3, 4]
my_list.reverse()
print(my_list)  # Вывод: [4, 3, 2, 1]
'''
# Можно записать по другому через срез:
'''
my_list = [1, 2, 3, 4]
my_list = my_list[::-1]
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# 🚩 .COUNT()
# Метод .count() возвращает количество вхождений заданного элемента в список. Пример:
'''
my_list = [1, 2, 2, 3, 4, 2]
print(my_list.count(2))  # Вывод: 3
print(my_list.count('2'))  # Вывод: 0
'''

# 🚩 .REMOVE()
# Метод .remove() удаляет первое вхождение указанного элемента из списка. Пример:
'''
my_list = [1, 2, 3, 2, 4]
my_list.remove(2)  # Первая найденная двойка
print(my_list)  # Вывод: [1, 3, 2, 4]
'''

# Можно удалить элемент через его индекс используя del:
'''
my_list = [1, 2, 3, 2, 4]
del my_list[1]  # Индекс удаляемого элемента
print(my_list)  # Вывод: [1, 3, 2, 4]
'''


# 🚩 .SORT()
# Метод .sort() сортирует элементы списка по возрастанию (по умолчанию) или в обратном порядке, если передан аргумент reverse=True. Пример:
'''
my_list = [4, 1, 3, 2]
my_list.sort()
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list.sort(reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# Скажу честно я не любитель этого метода, считаю, что удобнее будет использовать функцию sorted():
'''
my_list = [4, 1, 3, 2]
my_list = sorted(my_list)
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list = sorted(my_list, reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# Генераторы списков
'''

print([x for x in range(2, 15) if x % 2 == 0])  # [2, 4, 6, 8, 10, 12, 14]

print([x ** 2 for x in range(2, 15) if x % 2 == 0])  # [2, 4, 6, 8, 10, 12, 14]


M = [int(x) for x in open('files/17.txt')]

A = [x for x in M if x % 10 == 3 and len(str(abs(x))) == 4]
print(A)  # [-4107, 5853, -9637, -5137, -2887, -6207, 8883, -9597, 1303, -9457, 7413, 5573, -5337, 6303, -5457, -7267, -7117, -3867, 2743, 9903, -1587, -5927, 3043, -7827, -6757, -9977, -9577, 9353, 2273, 1933, 1703, -9467, -9447, -5007, -3377, -8947, 7653, -3197, -5437, 3673, -6177, 7363, 6893, -7887, -9617, 9203, 5053, 9303, -5237, 9343, 6783, -4667, -9287, -5707, 9893, 5433, -7297, 4103, 7173, 6773, -9077, -1447, 7443, -2717, 1603, -3137, -8307, 2463, 9443, -9177, -6677, 2853, 9183, -1667, 2223, -5837, -8377, -2037, 9913, -6387, -7827, 6983, -5757, -1417, -1377, 2623, -1127, 1663, 6273, -9597, -6927, 2093, -7147, -5377, 9873, -2337, 6893]
'''



# № 29346 Открытый вариант 2026(Уровень: Базовый)
# Определите количество цифр с чётным числовым
# значением в 36-ричной записи числа, заданного выражением:
# 5 * 1296 ** 2021 - 4 * 216 ** 2022 + 3*36 ** 2023 - 2*6**2024 - 2025.



#
# № 17869 Демоверсия 2025(Уровень: Базовый)
# Значение арифметического выражения
# 3 * 3125**8 +2*625**7 - 4*625 ** 6+3 * 125 ** 5 -2⋅25**4-2025
# записали в системе счисления с основанием 25.
# Сколько значащих нулей содержится в этой записи?



# № 16325 Открытый вариант 2024(Уровень: Базовый)
# Определите количество цифр с числовым значением, превышающим 9,
# в 27-ричной записи числа, заданного выражением:
# 2*729**2014 +2*243 ** 2016 - 2*81 **2018+2*27 **2020 - 2*9 **2022 - 2024.







