
# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Встроенные функции перевода в Python
'''
n = 100000

print(bin(n))  # 0b11000011010100000
print(bin(n)[2:])  # 11000011010100000
print(f'{n:b}')  # 11000011010100000
print(int('11000011010100000', 2))  # 100000

print(oct(n)[2:])  # 303240
print(f'{n:o}')  # 303240
print(int('303240', 8))  # 100000

print(hex(n)[2:])  # 186a0
print(f'{n:x}')  # 186a0
print(int('186a0', 16))  # 100000
# ValueError: int() base must be >= 2 and <= 36, or 0
'''

# Универсальная функция перевода из 10-й в b-ю систему
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

print(convert(100000, 8))  # 303240
print(int('303240', 8))  # 100000

print(convert(100000, 3))  # 12002011201
print(int('12002011201', 3))  # 100000
'''

# № 31502 Демоверсия 2027(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему
# новое число R следующим образом.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если число N чётное, то к этой записи справа и слева дописываются по две
# единицы;
# б) если число N нечётное, то в конец двоичной записи (справа) дописываются
# два нуля, а в начало (слева) дописывается единица.
# Полученная таким образом запись (в ней на три или четыре разряда больше,
# чем в записи исходного числа N) является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите наименьшее число R, превышающее 95, которое может быть
# результатом работы данного алгоритма. В ответе запишите это число
# в десятичной системе счисления.
'''
# Вариант 1
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    if n % 2 == 0:
        n2 = '11' + n2 + '11'
    else:
        n2 = '1' + n2 + '00'
    r = int(n2, 2)
    if r > 95:
        RES.append(r)

print(min(RES))  # 100


# Вариант 2

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for n in range(1, 10000):
    n2 = convert(n, 2)
    if n % 2 == 0:
        n2 = '11' + n2 + '11'
    else:
        n2 = '1' + n2 + '00'
    r = int(n2, 2)
    if r > 95:
        RES.append(r)

print(min(RES))  # 100
'''



# № 29956 Апробация 14.05.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то слева к нему приписывается «1», а справа «02»;
# б) если число N на 3 не делится, то остаток от деления на 3 умножается на 5,
# переводится в троичную запись и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число N, после обработки которого с помощью этого
# алгоритма получается число R, не меньшее 177.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = '1' + n3 + '02'
    else:
        x = (n % 3) * 5  # то остаток от деления на 3 умножается на 5
        n3 = n3 + convert(x, 3)  # переводится в троичную запись и дописывается в конец числа.
    r = int(n3, 3)
    if r >= 177:
        RES.append(n)
print(min(RES))
'''


# Несколько вариантов взятия суммы цифр строки
'''
s = '432908'

summa = 0
for x in s:
    summa += int(x)
print(summa)

print(sum([int(x) for x in s]))

print(sum(map(int, s)))
'''

# № 29337 Открытый вариант 2026(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если сумма цифр в двоичной записи числа чётная, то к этой записи справа дописывается 0,
# а затем два левых разряда заменяются на 10;
# б) если сумма цифр в двоичной записи числа нечётная, то к этой записи справа дописывается 1,
# а затем два левых разряда заменяются на 11.
# Полученная таким образом запись является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R,
# не превышающее 19. В ответе запишите это число в десятичной системе счисления
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]  # 101010 -> 3
    # if n2.count('1') % 2 == 0:
    if sum(map(int, n2)) % 2 == 0:
        n2 = '10' + n2[2:] + '0'
    else:
        n2 = '11' + n2[2:] + '1'
    r = int(n2, 2)
    if r <= 19:
        RES.append(n)
print(max(RES))
'''



# № 27277 (Уровень: Базовый)
# На вход алгоритма подается натуральное число N. Алгоритм строит по нему новое число R следующим образом:
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
#   а) если число N не делится на 3, то к этой записи справа дописываются три её последние цифры, а слева – цифра 1;
#   б) если число N делится на 3, то сумма цифр троичной записи умножается на 8,
#   переводится в троичную систему счисления и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# Укажите число R, ближайшее к числу 1220, которое может быть получено в результате работы алгоритма.


alp=sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n,b):
    r=""
    while n>0:
        r+= alp[n%b]
        n//= b
    return r[::-1]

RES = []
for n in range(1,10000):
    n3 = convert(n,3)
    if n % 3 ==0:
       x = sum(map(int, n3))*8
       n3 = n3 + convert(x, 3)
    else:
        n3= '1' + n3 + n3[-3:]
    r = int(n3 ,3)
    if 1200 < r < 1240:
        RES.append(r)
print(min(RES))


# № 25344 ЕГКР 13.12.25(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то к этой записи справа дописываются две последние троичные цифры;
# б) если число N на 3 не делится, то вычисляется сумма цифр полученной троичной записи,
# эта сумма умножается на 3, переводится в троичную систему счисления дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.
# Укажите минимальное нечётное число R, большее 208, которое может быть получено с помощью
# описанного алгоритма.

alp=sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n,b):
    r=""
    while n>0:
        r+= alp[n%b]
        n//= b
    return r[::-1]
res=[]
for n in range(1,10000):
    n3 = convert(n,3)
    if n % 3 ==0:
        n3= n3+n3[-2:]
    else:
        summa = sum(map(int, n3)) * 3
        n3 = n3 + convert(summa, 3)
    r = int(n3, 3)
    if r>208 and r % 2 != 0:
        res.append(r)
print(min(res))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [5, 14]
# КЕГЭ = []
# на следующем уроке:









