# region Домашка: ******************************************************************


# if - если, elif - иначе если, else - иначе

n = int(input())
if n % 2 == 0:  # Делится на 2 | Кратно 2 | Четное
    print("Чётное")
else:
    print("Нечётное")



n = int(input())   # 41392
a =  n//10000 # 4
b = (n%10000)//1000  # 1
c = (n%1000) //100  # 3
d = (n % 100) // 10  # 9
e = n % 10  # 2

print(a, b, c, d, e)

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
