# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 23374 Резервный день 19.06.25 (Уровень: Базовый)
# Для какого наименьшего целого положительного числа А выражение
# (x<A)∧(y<3A)∨(2x+y>128)
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?
'''
# Вариант 1
def F(x, y, A):
    return (x<A) and (y<3*A) or (2*x+y>128)

for A in range(1, 10000):
    flag = True
    for x in range(100):
        for y in range(100):
            if F(x, y, A) == False:
                flag = False
                break
    if flag == True:
        print(A)
        break


# Вариант 2
def F(x, y, A):
    return (x<A) and (y<3*A) or (2*x+y>128)

for A in range(1, 10000):
    k = 0
    for x in range(100):
        for y in range(100):
            if F(x, y, A) == True:
                k += 1
    if k == 10000:
        print(A)
        break

# Вариант 3
def F(x, y, A):
    return (x<A) and (y<3*A) or (2*x+y>128)

for A in range(1, 10000):
    if all(F(x, y, A) for x in range(100) for y in range(100)):
        print(A)
        break

# Вариант 4

print(min([A for A in range(1, 10000) if all( ((x<A) and (y<3*A) or (2*x+y>128)) for x in range(100) for y in range(100))]))
'''


# № 23561 Пересдача 03.07.25 (Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральнае число n делится без остатка на натуралиное число m».
# Для какого наибольшего натурального числа А выражение
# ДЕЛ(х,128) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,80))
# истинно (т.е. принимает значение 1) при любом натуральном значении переменной х?
'''
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''


# № 20577 (Уровень: Базовый)
# (М. Попков) Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Определите наибольшее натуральное число A, такое что выражение
# (x & A ≠ 0) → ((x & 698 = 0) → (x & 321 ≠ 0))
# тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной x)?


def F(x, A):
    return (x & A != 0) <= ((x & 698 == 0) <= (x & 321 != 0))


for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 25]
# КЕГЭ  = []
# на следующем уроке:
