# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 25354 ЕГКР 13.12.25 (Уровень: Средний)
'''
def f(x, y):
    return (78125 != (y + 4 * x)) or (A > x) and (A > y)

# 78125 = y + 4x
# y = 78125 - 4x

for A in range(1, 100000):
    if all(f(x, 78125 - 4*x) for x in range(1, 78125 // 4)):
        print(A)
        break
'''


# № 25356 ЕГКР 13.12.25 (Уровень: Базовый)
'''
R = []
a = [int(x) for x in open('0. files/17.txt')]
c = [x for x in a if len(str(abs(x))) == 4]
b = [x for x in a if str(abs(x))[-2:] == '30']
for i in range(len(a) - 2):
    x, y, z = a[i], a[i + 1], a[i + 2]
    if len(str(x)) != 4 and len(str(y)) != 4 and len(str(z)) != 4:
    if (x in c) + (y in c) + (z in c) == 0:
        if x + y + z > max(b):
            R .append(x + y + z)
print(len(R ), max(R))
'''





# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 8, 9, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ  = []
# на следующем уроке:
