# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Как отрывать файл для 17 номера
'''
M = [int(x) for x in open('0. files/17.txt')]
'''

# Какие есть прототипы 17 номера

M = [1, 2, 3, 4, 5]

# 1. Под парой подразумевается два идущих подряд элемента последовательности.
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# 2. Под тройкой подразумевается три идущих подряд элемента последовательности.
# 123 234 345
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]

# 3. Под парой подразумевается два различных элемента последовательности.
# 12 13 14 15
# 23 24 25
# 34 35
# 45
for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]



# № 23757 Демоверсия 2026 (Уровень: Базовый)

# Определите количество пар последовательности,
# в которых только один из элементов является двузначным числом,

# а сумма элементов пары кратна минимальному двузначному элементу
# последовательности.
#
# В ответе запишите количество найденных пар,
# затем максимальную из сумм элементов таких пар.

# В данной задаче под парой подразумевается
# два идущих подряд элемента последовательности.


M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 2]
# len(str(-20)) = 3
# len(str(abs(-20))) = 2
count = 0
maxi = 0
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) % min(A) == 0:
            count += 1
            maxi = max(maxi, x + y)
print(count, maxi)


M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 2]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) % min(A) == 0:
            R.append(x + y)
print(len(R), max(R))



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
