# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

print(M[0])  # начало списка
print(M[-1])  # конец списка

for x in M:
    print(x, end=' ')  # a b c d e
print()


for x in M:
    if x in 'ae':
        print(x, end=' ')  # a e
print()

print(len(M))  # 5 - кол-во элементов в списке

for i in range(len(M)):
    # print(i, end=' ')  # 0 1 2 3 4
    print(M[i], end=' ')  # a b c d e
print()

for i in range(len(M)):
    M[i] = M[i] * i
print(M)  # ['', 'b', 'cc', 'ddd', 'eeee']
'''


# Срезы списков

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1


# СРЕЗ[START:STOP-1:STEP]
'''
print(M[0])  # 'a'
print(M[1:4])  # ['b', 'c', 'd']
print(M[1:])  # ['b', 'c', 'd', 'e']
print(M[:4])  # ['a', 'b', 'c', 'd']
print(M[::2])  # ['a', 'c', 'e'] - все элементы с четными индексами
print(M[1::2])  # ['b', 'd'] - все элементы с нечетными индексами
print(M[::-1])  # ['e', 'd', 'c', 'b', 'a'] - в обратном порядке все элементы
print(M[2::-1])  # ['c', 'b', 'a']
print(M[1:-1])  # ['b', 'c', 'd'] - все элементы кроме первого и последнего


print(M[-2:])  # ['d', 'e'] два последних элемента
print(M[-3:])  # ['c', 'd', 'e'] два последних элемента
print(M[2:])  # ['c', 'd', 'e'] - все элементы начиная с 2 по индексу 
'''


# 🖥 Все методы списков в Python, которые понадобятся на ЕГЭ  #tpy

# 🚩 .APPEND()
'''
# Метод .append() используется для добавления элемента в конец списка. Пример: 
my_list = [1, 2, 3]
my_list.append(4)
my_list.append(5)
print(my_list)  # Вывод: [1, 2, 3, 4, 5]

# Можно реализовать через конкатенацию (склеивание) списков:
my_list = [1, 2, 3]
my_list = [0] + my_list + [4, 5]
print(my_list)  # Вывод: [0, 1, 2, 3, 4, 5]
'''

# 🚩 .REVERSE()
'''
# Метод .reverse() изменяет порядок элементов в списке на обратный. Пример: 
my_list = [1, 2, 3, 4]
my_list.reverse()
print(my_list)  # Вывод: [4, 3, 2, 1]

# Можно записать по другому через срез:
my_list = [1, 2, 3, 4]
my_list = my_list[::-1]
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# 🚩 .COUNT()
'''
# Метод .count() возвращает количество вхождений заданного элемента в список. Пример:
my_list = [1, 2, 2, 3, 4, 2]
print(my_list.count(2))  # Вывод: 3
'''

# 🚩 .REMOVE()
'''
# Метод .remove() удаляет первое вхождение указанного элемента из списка. Пример:
my_list = [1, 2, 3, 2, 4]
my_list.remove(2)  # Первая найденная двойка
print(my_list)  # Вывод: [1, 3, 2, 4]

# Можно удалить элемент через его индекс используя del:
# i        0  1  2  3  4
my_list = [1, 2, 3, 2, 4]
del my_list[1]  # Индекс удаляемого элемента
print(my_list)  # Вывод: [1, 3, 2, 4]
'''

# 🚩 .INDEX()
'''
# Метод .index() возвращает индекс первого вхождения заданного элемента в списке. Пример:
my_list = [1, 2, 3, 2, 4]
print(my_list.index(2))  # Вывод: 1
'''

# 🚩 .SORT()
'''
# Метод .sort() сортирует элементы списка по возрастанию (по умолчанию) или в обратном порядке, если передан аргумент reverse=True. Пример:
my_list = [4, 1, 3, 2]
my_list.sort()
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list.sort(reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]

# Скажу честно я не любитель этого метода, считаю, что удобнее будет использовать функцию sorted():
my_list = [4, 1, 3, 2]
my_list = sorted(my_list)
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list = sorted(my_list, reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# Функции списков
'''
from math import prod

M = [1, 2, 3, 4, 4, 5]
print(max(M))
print(min(M))
print(sum(M))
print(len(M))

print(prod(M))  # произведение всех элементов 

print(set(M))  # {1, 2, 3, 4, 5} - убирает все копии

print(sorted(M))  # [1, 2, 3, 4, 4, 5]
'''

'''
M = []
for i in range(15):
    M.append(i ** 2)
print(M)
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196]

M = [i ** 2 for i in range(15)]
print(M)


M = [x for x in range(1, 100)]
M = [x**2 for x in range(1, 100)]
M = [x for x in range(1, 100) if x % 2 == 0]

from random import randint
M = [randint(1, 100) for _ in range(20)]

chet = [x for x in M if x % 2 == 0]
nechet = [x for x in M if x % 2 != 0]

copied = [x for x in M if M.count(x) > 1]
uncopied = [x for x in M if M.count(x) == 1]
print(copied)
print(uncopied)
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2]
# КЕГЭ  = []
# на следующем уроке:
