# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
for n in range(1, 1000):
    s=f'{n:b}'
    if n%3==0:
        s=s+s[-2:]
    else:
        s=s+f'{(3*(n%3)):b}'
    r=int(s, 2)
    if 120<r<150:
        print(r, n)
        # 142 17
        # 122 30
        # 127 31
        # 133 33
        # 139 34
        # 144 36
'''


'''
from turtle import *
left(90)
screensize(2000, 2000)
tracer(0)
size=10
for i in range(2):
    fd(3*size)
    lt(90)
    bk(10*size)
    lt(90)
up()
bk(10*size)
rt(90)
fd(8*size)
lt(90)
down()
for i in range(2):
    fd(16*size)
    rt(90)
    fd(8*size)
    rt(90)
up()
for x in range(-50, 50):
    for y in range(-50, 50):
        goto(x*size, y*size)
        dot(3, 'purple')
update()
done()
print(2*3)
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = [17, ]
# на следующем уроке: 24, 10


# region 📖 Пробник (Вариант 2)


# Студент #Екатерина
# Пробник №2
# Дата: #Вторник #24Февраля2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15, 16, 17, 18, 19, 20, 21, 23, 25, 27
# ⛔️ Неверно: 13, 14, 22, 24, 26
# ❔ Без ответа: Нет
# Итог: 23/29 первичных балла ~ 85 вторичных

# endregion 📖 Пробник (Вариант 2)


# Топ номеров 11.02.26
# 1. 19-21
# 2. 1
# 3. 2
# 4. 4
# 5. 5
# 6. 9
# 7. 17
# 8. 6
# 9. 23
# 10. 15
# 11. 14
# 12. 13
# 12. 25
# 13. 27
# 14. 18
# 15. 22
# 16. 7
# 17. 11
# 18. 16
# 19. 10