# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# № 21411 Досрочная волна 2025 (Уровень: Базовый)
#    ПОКА нашлось (31) ИЛИ нашлось (211) ИЛИ нашлось (1111)
#      ЕСЛИ нашлось (31)
#        ТО заменить (31, 1)
#      ЕСЛИ нашлось (211)
#        ТО заменить (211, 13)
#      ЕСЛИ нашлось (1111)
#        ТО заменить (1111, 2)
'''
R = []
for n in range(4, 10000):
    s = '3' + '1' * n

    while '31' in s or '211' in s or '1111' in s:
        if '31' in s:
            s = s.replace('31', '1', 1)
        if '211' in s:
            s = s.replace('211', '13', 1)
        if '1111' in s:
            s = s.replace('1111', '2', 1)

    if sum(map(int, s)) == 15:
        R.append(n)
print(min(R))
'''


# Сумма цифр строки
'''
s = '122333444455555'
# summa1 = s.count('1') + s.count('2') * 2 + s.count('3') * 3 + ... +


summa2 = 0
for x in s:
    summa2 += int(x)
print(summa2)

summa3 = sum([int(x) for x in s if x.isdigit()])
print(summa3)

summa4 = sum(map(int, s))
'''

#
# № 20901 Апробация 05.03.25 (Уровень: Базовый)
# Определите количество нулей в строке, получившейся
# в результате применения приведённой ниже программы
# к входной строке, состоящей из единицы,
# за которой следуют 90 нулей подряд.
#
# ПОКА нашлось (1)
#   ЕСЛИ нашлось (10)
#     ТО заменить (10, 0001)
#     ИНАЧЕ заменить (1, 000)


s = '1' + '0' * 90
while '1' in s:
    if '10' in s:
        s = s.replace('10', '0001', 1)
    else:
        s = s.replace('1', '000', 1)
print(s.count('0'))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6]
# КЕГЭ  = []
# на следующем уроке:
