# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 23 23205
'''
def f(a, b):
    if a < b or a==13:
        return 0
    elif a==b:
        return 1
    else:
        return f(a-1, b) + f(a-2, b) + f(a//3, b)
print(f(19, 6) * f(6, 4))


def f(a, b):
    if a <= b or a==13:
        return a==b
    return f(a-1, b) + f(a-2, b) + f(a//3, b)
print(f(19, 6) * f(6, 4))
'''


# №5 23189
'''
b = []
for n in range(10000):
    s = f'{n:b}'
    if n % 3 == 0:
        s = s + s[-3:]
    else:
        s = s + f'{(n % 3)*3:b}'
    r = int(s, 2)
    if r < 130:
        b.append(n)
print(max(b))
'''


# №2
'''
print("x y z w")
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                F = (x <= y) and z and (not w)
                if F == 1:
                    print(x, y, z, w)
'''


# №6 23190
'''
import turtle as t
t.lt(90)
t.screensize(2000, 2000)
t.tracer(0)
size=30
for i in range(2):
    t.fd(3*size)
    t.rt(90)
    t.fd(20*size)
    t.rt(90)
t.up()
t.bk(8*size)
t.rt(90)
t.fd(9*size)
t.lt(90)
t.down()
for i in range(2):
    t.fd(16*size)
    t.rt(90)
    t.fd(8*size)
    t.rt(90)
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x*size, y*size)
        t.dot(3, 'purple')
t.update()
t.done()
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
