# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации
# 1 бит - минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит


# Номер 7

# Прототип №1 КАРТИНКА
# I = pixels * i
# i - сколько бит выделено на один пиксель
# colors = 2 ** i


# Прототипа №1 ЗВУК

# I = a * b * c * t
# a - кол-во каналов (шт)
# b - частота дискретизации (Гц)
# c - глубина кодирования (бит)
# t - время записи (сек)


# Номер 11 аналогично прототипу КАРТИНКА
# Но ищем вес пароля/ID



# № 25346 (Уровень: Базовый)
'''
pixels = 1024 * 960
colors = 16384
i = 14  # 2**14 >= colors

I = pixels * i  # вес одной картинки в бит
I_400 = I * 400
print(I_400 / 2**23)
'''
# 656.25 -> 656


# № 23366 Резервный день 19.06.25 (Уровень: Базовый)
'''
pixels = 2560 * 1440
i = 30
I = pixels * i

pixels2 = 1920 * 1080
i2 = 28
I2 = pixels2 * i2

print(((I - I2) * 130) / 2**13)
'''
# 833625.0 -> 833625


# № 22600 (Уровень: Базовый)
'''
# pixels - ?
colors = 10_000_000
i = 24  # 2 ** 24 >= colors

T = 3*60 # c
U = 2_100_000  # бит/с
I_10 = U * T
I = I_10 / 10
# I = pixels * i
pixels = I / i
print(pixels)  # 1575000 
'''


# № 19556 (Уровень: Базовый)
'''
I = 196 * 2**23
a = 2
b = 48000
c = 18
# t - ?

t = I / (a * b * c)
t = t / 60
print(t)  # 15.85 -> 16
'''


# № 18191 (Уровень: Средний)
'''
t = 60
cnt = 60 * t

pixels = 1920 * 1080
i = 8

a = 2
b = 24000
c = 6

I_music = a * b * c * t
I_photo = (pixels * i) * cnt
I_video = I_music + I_photo
print((I_video * 50) / 2**13)
'''
# 364605468.75


# № 8948 Джобс 02.06.2023 (Уровень: Базовый)
'''
sym = 48
alp = 8  # alp = 2 ** i
i = 3  # 2 ** 3 >= alp
# i - бит на один символ

bit = sym * i  # бит на один пароль
print(bit / 8)  # 18.0 -> 18
byte = 18

# user = byte + dop
user = 5750 / 250
print(user - byte)  # 5.0
'''

# № 8499 Апробация 17.05 (Уровень: Базовый)
'''
sym = 213
alp = 2021 + 10
i = 11  # 2 ** 11 >= alp

bit = sym * i  # бит на один пароль
print(bit / 8)  # 292.875 -> 293
byte = 293

print((byte * 16384) / 2**10)
# 4688
'''

# № 17674 Пересдача 04.07.24 (Уровень: Средний)
'''
alp = 10 + 26 + 450  # 486
i = 9
# sym - ?
# bit - ?

byte = 100 * 2**10 / 575
print(byte)  # 178.08695 -> 179 (отведено более 100 Кбайт памяти)
bit = 179 * 8

# bit = sym * i
sym = bit / i
print(sym)  # 159.111
'''


# № 17552 Основная волна 08.06.24 (Уровень: Сложный)
'''
sym = 261
# alp - ?
# i - ?
# bit - ?


byte = 31 * 2**20 / 252500
print(byte)  # 128.7360 -> 129 (отведено более 31 Мбайт памяти)
bit = 129 * 8

i = bit / sym
print(i)  # 3.95402 -> 4 (отведено более 31 Мбайт памяти)

i = 4
print(f'Максимальная возможная мощность алфавита: {2**4}')
print(f'Минимальная возможная мощность алфавита: {2**3+1}')


print([i for i in range(0, 20)])
print([2**i for i in range(0, 20)])
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
# [1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096, 8192, 16384, 32768, 65536, 131072, 262144, 524288]

alp = 129  # i = 8
alp = 128  # i = 7

alp = 100  # i = 7

alp = 65 # i = 7 -> 2**6+1
alp = 64  # i = 6
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = [17, ]
# на следующем уроке:
