# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# i  01234
s = 'abcde'
'''
print(f'Первый элементы строки s: {s[0]}')
print(f'Последний элементы строки s: {s[-1]}')

# Первый элементы строки s: a
# Последний элементы строки s: e

for x in s:
    print(x, end=' ')  # a b c d e
print()


for i in range(len(s)):
    print(s[i], end=' ')
print()  # a b c d e

# Строки в отличие от списков нельзя изменять в моменте, только если пересоздавать их


s = '12321'  # палиндром
if s == s[::-1]:
    print('палиндром')
else:
    print('нет')


s = '12321'  # 3 заменить на 000
s = s[:2] + '000' + s[3:]
print(s)  # 1200021
'''

# Срезы строк такие же как и у списков
'''
# i  01234
s = 'abcde'

print(s[2:4])  # cd
print(s[:4])  # abcd
print(s[2:])  # cde
print(s[0::2])  # ace
print(s[1::2])  # bd
print(s[::-1])  # edcba
print(s[1:-1])  # bcd
'''


# Функции строк
'''
s = '23121321321'
# print(sum(s)) - нет такой функции
print(len(s))  # - длина строки s
print(min(s), max(s))  # 1 3
print(sorted(s))  # ['1', '1', '1', '1', '2', '2', '2', '2', '3', '3', '3']
print(sorted(s, reverse=True))  # ['3', '3', '3', '2', '2', '2', '2', '1', '1', '1', '1']


alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alphabet)  # ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

print(set(s))  # {'1', '3', '2'}
'''

# 🐍 Все методы строк в Python, которые понадобятся на ЕГЭ #tpy 



# 2⃣ .lower() и .upper()
# Эти методы позволяют изменять регистр строки. lower() преобразует строку в нижний регистр, а upper() – в верхний.
'''
text = "ПрИвЕт"
print(text.lower()) # "привет"
print(text.upper()) # "ПРИВЕТ"
'''


# 3⃣ .replace()
# Метод replace(old, new, count) заменяет подстроку old на new в строке count раз.
'''
text = "Я люблю Python!"
new_text = text.replace("Python", "программирование")
print(new_text) # "Я люблю программирование!"


s = '123213123123'
s = s.replace('1', '*', 3)
print(s)  # *232*3*23123
'''


# 4⃣  .split()
# Метод split(separator) разделяет строку на части по указанному разделителю. Если разделитель не указан, используется пробел.
'''
text = "яблоко груша банан"
fruits = text.split() # по умолчанию разделяет по пробелам
print(fruits) # ['яблоко', 'груша', 'банан']


ip = '123.45.234.9'
print(ip.split('.'))  # ['123', '45', '234', '9']
'''


# 5⃣ .join()
# Метод join(iterable) соединяет элементы списка (или другого итерируемого объекта) в строку с указанным разделителем.
'''
fruits = ['яблоко', 'груша', 'банан']
result = ', '.join(fruits)
print(result)  # "яблоко, груша, банан"

ip = ['123', '45', '234', '9']
print('|'.join(ip))  # 123|45|234|9
'''


# 6⃣ .find()
# Метод find(substring) ищет подстроку в строке и возвращает индекс, с которого начинается первая встреча. Если подстрока не найдена, возвращает -1.
'''
text = "Привет, мир!"
index = text.find("мир")
print(index) # 8

text = "Привет, мир!"
index = text.index("мир")
print(index) # 8


text = "21332132123121"
index_l = text.find("1")
index_r = text.rfind("1")
print(index_l, index_r) # 8

text = "21332132123121"
index_l = text.index("1")
index_r = text.rindex("1")
print(index_l, index_r) # 8
'''


# 7⃣ .count()
# Метод count(substring) возвращает количество вхождений подстроки в строку.
'''
text = "яблоко, груша, яблоко"
count = text.count("яблоко")
print(count) # 2
'''


# 8⃣ .startswith() и .endswith()
# Эти методы проверяют, начинается ли строка с указанной подстроки или заканчивается ли ею.
'''
text = "Привет, мир!"
print(text.startswith("Привет"))  # True
print(text.endswith("мир!"))  # True
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6]
# КЕГЭ  = []
# на следующем уроке:
