# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 20486 (Уровень: Базовый)
'''
def convert(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]


R = []
for n in range(4, 1000):
    # s = f'{n:b}'
    s = convert(n, 2)
    if n % 2 == 0:
        s = s + s[:2+1]
    else:
        s = '1' + s + '01'
    r = int(s, 2)
    if r > 600:
        R.append(r)
print(min(R))
'''

'''
def convert(n,b):
    s = ''
    while n > 0:
        s = s +str(n % b)
        n = n // b
    return s[::-1]


for n in range(1,1000):
    r = convert(n,3)
    if n % 3 == 0 :
        r = r + r[-3:]
    else:
        x = (n % 3) * 3
        r = r + convert(x, 3)
    res = int(r, 3)
    if res > 150:
        print(n)
        break
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
