# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации
# 1 бит - это минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит


# № 21702 ЕГКР 19.04.25 (Уровень: Базовый)
'''
pixels = 7680 * 4320
colors = 2**16
i = 16
photo = pixels * i  # вес одного фото

card = 9 * 2**33  # всего места на карте памяти

cnt = card / photo
print(cnt)  # 145.63 - сколько фото помещается на одну карту памяти

print(4010 // 145)  # 27
print(4010 % 145)  # 95
'''


# https://alex-math.ru/gia/show/zadaniye-7-informatika-yege-yegkr-21122024/
'''
pixels = 3840*2160
colors = 2**24
i = 24
photo = pixels * i  # вес одного фото

card = 16 * 2**33  # всего места на карте памяти

cnt = card / photo
print(cnt)  # 690 - сколько фото помещается на одну карту памяти

print(3742 // 690)  # 5
print(3742 % 690)  # 292
'''


# № 12243 ЕГКР 16.12.23 (Уровень: Базовый)
'''
from math import ceil
sym = 110
alp = 10 + 1020  # colors = alp = 2**i, где i - это кол-во бит на один символ
i = 11  # 2**11 >= 1030 (alp)
# bit = sym * i  - вес нашего пароля в бит
bit = sym * i

print(bit / 8)  # 151.25
byte = 152
# byte = ceil(bit / 8)

print((byte * 32768) / 2**10)  # байт -> кбайт
'''


# № 13883 (Уровень: Базовый)
'''
sym = 35
alp = 26 * 2  # 52
i = 6  # 2**6 >= 52
bit = sym * i

print(bit / 8)  # 26.25
byte = 27

print(byte * 25)
'''


# № 16322 Открытый вариант 2024 (Уровень: Базовый)
'''
sym = 317
alp = 4090 + 10
# print(2**13)
i = 13

bit = sym * i
print(bit / 8)  # 515.125 -> 516
byte = 516

print((byte * 262_144) / 2**20)
'''

# № 17552 Основная волна 08.06.24 (Уровень: Сложный)
'''
sym = 261

byte = (31 * 2**20) / 252_500
print(byte)  # 128.736
byte = 129
bit = byte * 8

print(bit / sym)  # 3.9540

i = 4  # alp[9-16]
# минимально возможную мощность алфавита
'''
# Ответ: 9





# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
