# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# f = open('0. files/17.txt')
# M = []
# for s in f:
#     M.append(int(s))
# print(M)

'''
# Способ открытия файла для 17 номера:
M = [int(x) for x in open('0. files/17.txt')]
R = []


M = [1, 2, 3, 4, 5]
# Рассмотрим три прототипа задач 17 номера:

# 1. Назовём парой два идущих подряд элемента последовательности
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# 2. Назовём тройкой три идущих подряд элемента последовательности
# 123 234 345
for i in range(len(M)-2):
    # x, y, z = M[i], M[i+1], M[i+2]
    x, y, z = M[i:i+3]


# 3. Назовём парой два различных элемента последовательности
# 12 13 14 15
# 23 24 25
# 34 35
# 45
for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]
'''


# № 19486 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
D = [x for x in M if abs(x) % 10 == 7]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x > 0) + (y > 0) == 1:
        if (x + y) < len(D):
            R.append(x + y)
print(len(R), max(R))
'''


# № 19249 ЕГКР 21.12.24 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
D = [x for x in M if abs(x) % 100 == 43 and len(str(abs(x))) == 5]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    # if (x in D) or (y in D) or (z in D):
    if (x in D) + (y in D) + (z in D) >= 1:
        if (x ** 2 + y ** 2 + z ** 2) <= max(D) ** 2:
            R.append(x ** 2 + y ** 2 + z ** 2)
print(len(R), min(R))
'''

'''
M = [int(x) for x in open('0. files/17.txt')]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x % 55 == min(M)) or (y % 55 == min(M)):
        R.append(x+y)
print(len(R), min(R))
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Артур 2/9 -> 14 вторичных баллов +[1, 12] -[2, 5, 6, 8, 12, 14, 16]
# Илья 1/9 -> 7 вторичных баллов +[2] -[1, 3, 5, 6, 8, 12, 14, 16]
