# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Единицы измерения информации
# 1 бит - минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# https://education.yandex.ru/ege/task/30431c9e-dfcf-41dc-8b5d-1c0fd87fcb2e
'''
sym = 31
alp = 10 + 26  # alp = 2 ** i, i - это кол-во бит на один символ
i = 6  # 2 ** 6 >= 36  (бит)

bit = sym * i  # вес одного пароля в бит
print(bit / 8)  # 23.25 -> 24
byte = 24  #  вес одного пароля в байт

# user = byte + dop
user = (12*2**10) / 128
print(user - byte)
'''


# https://education.yandex.ru/ege/task/d60b216e-85cb-45b3-9ebd-ef508c14c5db
'''
sym = 48
alp = 8
i = 3
bit = sym * i
print(bit / 8)  # 18.0
byte = 18

user = 5750 / 250
print(user - byte)
'''


# № 21897 Открытый вариант 2025 (Уровень: Базовый)
# Известно, что для хранения 703 569 серийных номеров
# доступно не более 77 Мбайт памяти.

# Определите максимально возможную мощность алфавита
'''
# bit = sym * i
sym = 246
byte = (77 * 2**20) / 703_569
print(byte)  # 114.758 -> 114
bit = 114 * 8

i = bit / sym
print(i)  # 3.707 -> 3

print(f'Максимальная мощность алфавита: {2 ** 3}')
print(f'Минимальная мощность алфавита: {2 ** 2 + 1}')


alp = 16  # i = 4
alp = 17  # i = 5
alp = 32  # i = 5
alp = 33  # i = 6

i = 5  # alp [17 : 32]
i = 5  # alp [2**4+1 : 2**5]
'''


# № 21706 ЕГКР 19.04.25 (Уровень: Базовый)
# Известно, 125 300 серийных номеров занимают
# более 23 Мбайт памяти.

# Определите минимально возможную мощность алфавита
'''
sym = 119

byte = 23 * 2**20 / 125_300
print(byte)  # 192.476 -> 193

bit = 193 * 8
i = bit / sym

print(i)  # 12.974 -> 13

print(2**12 + 1)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 9, 11, 12, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 7


# Первый пробник 21.12.24:
# Артур 2/9 -> 14 вторичных баллов +[1, 12] -[2, 5, 6, 8, 12, 14, 16]
# Илья 1/9 -> 7 вторичных баллов +[2] -[1, 3, 5, 6, 8, 12, 14, 16]
