# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 17562 Основная волна 08.06.24 (Уровень: Базовый)
# У исполнителя есть три команды, которым присвоены номера:
# A. Прибавить 1
# B. Прибавить 2
# C. Прибавить 3
# Сколько существует программ, которые преобразуют число 5 в число 11,
# и при этом траектория вычислений содержит число 7?
'''
def F(a, b):
    if a > b:
        return 0
    elif a == b:
        return 1
    else:
        return F(a+1, b) + F(a+2, b) + F(a+3, b)


print(F(5, 7) * F(7, 11))


def F(a, b):
    if a >= b:
        return a == b
    return F(a+1, b) + F(a+2, b) + F(a+3, b)


print(F(5, 7) * F(7, 11))
'''


# № 17534 Основная волна 07.06.24 (Уровень: Базовый)
'''
def F(a, b):
    if a < b:
        return 0
    elif a == b:
        return 1
    else:
        return F(a-1, b) + F(a // 2, b)

print(F(30, 8) * F(8, 1))
'''


# № 19253 ЕГКР 21.12.14 (Уровень: Базовый)
# A. вычти 1
# B. вычти 6
# C. найди целую часть от деления на 2
# Сколько существует таких программ, которые исходное
# число 34 преобразуют в число 6, и при этом траектория вычислений
# содержит числа 19 и 29 и не содержит числа 24?

'''
def F(a, b):
    if a <= b or a == 24:
        return a == b
    return F(a - 1, b) + F(a - 6, b) + F(a // 2, b)


print(F(34, 29) * F(29, 19) * F(19, 6))


def F(a, b, c):
    if a <= b:
        c = c.split()
        return a == b and ('19' in c) and ('29' in c) and ('24' not in c)
    return F(a - 1, b, c+' '+str(a)) + F(a - 6, b, c+' '+str(a)) + F(a // 2, b, c+' '+str(a))


print(F(32, 6, ''))
'''
# True ['32', '31', '30', '29', '23', '22', '21', '20', '19', '13', '6']
'''
def F(a, b, c):
    if a < b:
        return 0
    if a == b:
        c = c.split()
        if ('19' in c) and ('29' in c) and ('24' not in c):
            # print(a == b, c)
            return 1
        else:
            return 0
    return F(a - 1, b, c+' '+str(a)) + F(a - 6, b, c+' '+str(a)) + F(a // 2, b, c+' '+str(a))


print(F(32, 6, ''))
'''

# № 4490 (Уровень: Средний)
'''
def F(a, b, c):
    if a >= b:
        return a == b and c.count('3') <= 2
    return F(a+1, b, c+'1') + F(a+2, b, c+'2') + F(a*2, b, c+'3')


print(F(2, 12, ''))
'''


# № 4489 (Уровень: Средний)
'''
def F(a, b, c):
    if a >= b:
        # return a == b and all(p not in c for p in '22 23 32 33'.split())
        return a == b and '22' not in c and '23' not in c and '32' not in c and '33' not in c
    return F(a+1, b, c+'1') + F(a*2, b, c+'2') + F(a*3, b, c+'3')


print(F(1, 30, ''))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14, 16, 23]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Артур 2/9 -> 14 вторичных баллов +[1, 12] -[2, 5, 6, 8, 12, 14, 16]
# Илья 1/9 -> 7 вторичных баллов +[2] -[1, 3, 5, 6, 8, 12, 14, 16]
