# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Адрес сети = Узла сети & Маска сети

# № 21708 ЕГКР 19.04.25 (Уровень: Базовый)
# Сеть задана IP-адресом одного из входящих
# в неё узлов 11.92.135.56 и сетевой маской 255.224.0.0.
'''
from ipaddress import *
net = ip_network('11.92.135.56/255.224.0.0', 0)
for ip in net:
    print(ip)
'''
# Адрес сети и широковещательный адрес
# не могут быть использованы для адресации сетевых устройств.


# № 11782 (Уровень: Базовый)
# Сеть задана IP-адресом 129.128.0.0 и маской сети 255.128.0.0.
# Определите минимальное количество нулей в двоичной записи IP-адреса в этой сети.
'''
from ipaddress import *
net = ip_network('129.128.0.0/255.128.0.0', 0)
R = []
for ip in net:
    b = f'{ip:b}'
    R.append(b.count('0'))
print(min(R))
'''


# № 11779 (Уровень: Базовый)
# Сеть задана IP-адресом 151.192.0.0 и маской сети 255.224.0.0.
# Сколько в этой сети IP-адресов, у которых количество единиц
# и количество нулей в двоичной записи IP-адреса одинаково?
'''
from ipaddress import *
net = ip_network('151.192.0.0/255.224.0.0')
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') == b.count('0'):
        cnt += 1
print(cnt)
'''

# № 11771 (Уровень: Базовый)
# Для узла с IP-адресом 121.74.179.135 адрес сети равен 121.74.179.128.
# Чему равно наибольшее количество возможных адресов в этой сети?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'121.74.179.135/{mask}', 0)
    if '121.74.179.128' in str(net):
        print(net, net.num_addresses)
'''


# № 11769 (Уровень: Базовый)
# Для узла с IP-адресом 157.17.164.129 адрес сети равен 157.17.128.0.
# Чему равно наименьшее возможное значение третьего слева байта маски?

from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'157.17.164.129/{mask}', 0)
    if '157.17.128.0' in str(net):
        print(net, net.netmask)
        # 157.17.128.0/17 255.255.128.0
        # 157.17.128.0/18 255.255.192.0

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Артур 2/9 -> 14 вторичных баллов +[1, 12] -[2, 5, 6, 8, 12, 14, 16]
# Илья 1/9 -> 7 вторичных баллов +[2] -[1, 3, 5, 6, 8, 12, 14, 16]
