# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 28926 ЕГКР 18.04.26 (Уровень: Базовый)
'''
M = []
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n,b):
    s = ''
    while n > 0:
        s = alphabet[n % b] + s
        n //= b
    return s


for N in range(1,10000):
    s = convert(N,3)
    if N % 3 == 0:
        s = s + s[-2:]
    if N % 3 != 0:
        x = sum([int(x) for x in s])
        z = x * 2
        s = s + convert(z,3)
    R = int(s,3)
    if R % 2 != 0 and R > 520:
        M.append(R)
print(min(M))
'''



# № 20569 (Уровень: Базовый)

print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((w <= z) == (x <= (not y))) and (x or z)
                if F == 0:
                    print(x, y, z, w, int(F))
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((w <= z) == (x <= (not y))) and (x or z)
                if F == 1:
                    print(x, y, z, w, int(F))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = [9, 13]
# на следующем уроке: 17, 7, 11


# region 📖 Пробник (Вариант 2)

# Студент #Илья
# Дата: #Вторник #03Марта2026
# ✅ Верно: 1, 2, 4, 6, 7, 10, 14, 16, 17, 18, 19, 20, 21, 23
# ⛔️ Неверно: 3, 8, 15
# ❔ Без ответа: 5, 9, 11, 12, 13, 22, 24, 25, 26, 27
# Итог: 14/29 первичных балла ~ 62 вторичных

# endregion 📖 Пробник (Вариант 2)
