# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print('x y z w')
for x in 0,1:
    for y in 0,1:
        for z in 0,1:
            for w in 0,1:
                F = (not z) and (w or x) and (not(x ==y))
                if F == 1:
                    print(x,y,z,w)
'''


# Вариант ЕГКР ЕГКР 13.12.25 вариант 2
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]
# print(convert(8, 2))  # 1000

RES = []
for n in range(1, 10000):
    s = convert(n, 3)
    if n % 3 == 0:
        s = s + s[-2:]
    else:
        # summa = sum(map(int, s))
        summa = sum([int(x) for x in s])
        x = summa * 3
        s = s + convert(x, 3)
    r = int(s, 3)
    if r > 155 and r % 2 == 0:
        RES.append(r)
print(min(RES))
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [7, 11, 23]
# на следующем уроке: 8, 9, 25 (10, 24, 26)



'''
# Савелий = [10,12,2,1,4,3,5,6,13,14,16,15,18,19-21,11,7,8,9,17,22,23,25,27,24,26]
print(len('10,12,2,1,4,3,5,6,13,14,16,15,18,19,20,21,11,7,8,9,17,22,23,25,27,24,26'.split(',')))

# Ярик = 1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24
print(len(set('1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24'.split())))
# 5 11 16 17 22
'''


# region 📖 Пробник (Вариант 2)

# Студент #Савелий
# Дата: #Среда #04Марта2026
# ⛔️ Неверно: 5
# ❔ Без ответа: 6, 8, 9, 13, 14, 15, 17, 18, 22, 24, 25, 26, 27
# Итог: 13/29 первичных балла ~ 59 вторичных

# endregion 📖 Пробник (Вариант 2)
