# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


def divisors(x):
    d = []
    for g in range (1,int(x**0.5)+1):
        if x % g == 0:
            d.append(g)
            d.append(x//g)
    return sorted(set(d))

print(divisors(24))
cnt = 0
for x in range (1125000+1,10**10):
    d= [i for i in divisors(x) if i  % 10 == 7 and i != 7 and i != x]
    if len(d) > 0:
        print(x,min(d))
        cnt += 1
        if cnt == 5:
            break


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [7, 11, 16, 23]
# на следующем уроке: 9, 17, 8, 22, 25, 27 (10, 24, 26)



'''
# Савелий = [10,12,2,1,4,3,5,6,13,14,16,15,18,19-21,11,7,8,9,17,22,23,25,27,24,26]
print(len('10,12,2,1,4,3,5,6,13,14,16,15,18,19,20,21,11,7,8,9,17,22,23,25,27,24,26'.split(',')))

# Ярик = 1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24
print(len(set('1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24'.split())))
# 5 11 16 17 22
'''


# region 📖 Пробник (Вариант 2)

# Студент #Савелий
# Дата: #Среда #04Марта2026
# ⛔️ Неверно: 5
# ❔ Без ответа: 6, 8, 9, 13, 14, 15, 17, 18, 22, 24, 25, 26, 27
# Итог: 13/29 первичных балла ~ 59 вторичных

# endregion 📖 Пробник (Вариант 2)
