# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print(16 * 24 + 253 * 399 - 19 * 13)
print(253 * 399 + 3 * 24 + 5 * 13)

import turtle as t
t.screensize(5000, 5000)
t.tracer(0)  # Отключает анимацию отрисовки
t.down()
t.left(90)
size = 20

for i in range(7):
    t.forward(15 * size)
    t.right(90)
    t.fd(23* size)
    t.right(90)
t.up()
t.fd(3* size)
t.rt(90)
t.fd(5* size)
t.lt(90)
t.down()
for i in range(7):
    t.fd(252* size)
    t.rt(90)
    t.fd(398* size)
    t.rt(90)
# Тут рисуем точки:
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * size, y * size)
        t.dot(2, 'red')
t.update()
t.done()
'''

'''
from ipaddress import *
net = ip_network('167.66.136.176/255.254.0.0', 0)
for ip in net.hosts():
    print(ip)
    break

print(167 + 66 + 1)
'''

'''
sym = 102
# alp - ?
# i - ?
# bit - ?

byte = 53 * 2**20 / 282_952
# Байт на один серийный номер
print(byte)  # 196.40973 -> 196 (отведено не более 53 Мбайт)
bit = 196 * 8
# bit = sym * i
i = bit / sym
print(i)  # 15.372 -> 15 (отведено не более 53 Мбайт)

i = 15
print(f'Максимальную мощность алфавита: {2 ** i}')
print(f'Минимальную мощность алфавита: {2 ** 14 + 1}')


alp = 128  # i = 7

alp = 100  # i = 7 

alp = 65  # i = 7
alp = 64  # i = 6
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = []
# на следующем уроке: 10, 12, 24, 26
