# region Домашка: ******************************************************************
from wsgiref.validate import bad_header_value_re


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# ¬(y) - (not y)
# ∧ - and
# ∨ - or
# → - <=
# ≡ - ==

# flag - собирательный образ регулировщика

# № 20584 (Уровень: Базовый)

import time
start = time.time()

'''
def F(x, A):
    return ((405 % x == 0) <= (81 % x == 0)) or (A - x > 162)

for A in range(1, 5000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
        break
'''

# Вариант 2
'''
def F(x, A):
    return ((405 % x == 0) <= (81 % x == 0)) or (A - x > 162)

for A in range(1, 5000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        print(A)
        break
'''

# Вариант 3
'''
def F(x, A):
    return ((405 % x == 0) <= (81 % x == 0)) or (A - x > 162)

RES = []
for A in range(1, 5000):
    if all(F(x, A)  for x in range(1, 10000)):
        RES.append(A)
print(min(RES))


# Вариант 3.2
print(min([A for A in range(1, 5000) if all( (((405 % x == 0) <= (81 % x == 0)) or (A - x > 162))  for x in range(1, 10000))]))

end = time.time()
print(end - start)  # 0.00725
'''


# № 20584 (Уровень: Базовый)
# Для какого наименьшего натурального числа А формула
# (ДЕЛ(405, x) → ДЕЛ(81, x)) ∨ (A – x > 162) тождественно истинна ?
'''
def F(x, A):
    return ((405 % x == 0) <= (81 % x == 0)) or (A - x > 162)

RES = []
for A in range(1, 5000):
    if all(F(x, A)  for x in range(1, 10000)):
        RES.append(A)
print(min(RES))
'''


# № 20809 Апробация 05.03.25 (Уровень: Базовый)
# Пусть на числовой прямой дан отрезок B = [60,80].
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(x,А) ∨ ((x∈B) → ¬ДЕЛ(x,22))
# истинно при любом целом положительном значении переменной х?
'''
def F(x, A):
    B = 60 <= x <= 80
    return (x % A == 0) or (B <= (x % 22 != 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A)  for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 22433 (Уровень: Базовый)
# Для какого наименьшего неотрицательного целого числа А логическое выражение
# (x&117=0)∧(x&91=0)→¬(x&А=0)
# истинно при любом неотрицательном целом значении переменной х?
'''
def F(x, A):
    return ((x & 117 != 0) and (x&91 == 0)) <= (x&A != 0)

RES = []
for A in range(1, 1000):
    if all(F(x, A)  for x in range(1, 100000)):
        RES.append(A)
print(min(RES))
'''

# № 23374 Резервный день 19.06.25 (Уровень: Базовый)
# Для какого наименьшего целого положительного числа А выражение
# (x<A) ∧ (y<3A) ∨ (2x+y>128)
# истинно при любых целых положительных х и у?
'''
def F(x, y, A):
    return (x < A) and (y < 3*A) or (2*x + y > 128)

RES = []
for A in range(1, 1000):
    if all(F(x, y, A)  for x in range(1, 100) for y in range(1, 100)):
        RES.append(A)
print(min(RES))
'''



# № 23755 Демоверсия 2026 (Уровень: Базовый)
# На числовой прямой даны два отрезка: P = [25; 64] и Q = [40; 115].
# Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
#  (x∈P)→(((x∈Q)∧¬(x∈A))→¬(x∈P))
# истинно (т.е. принимает значение 1) при любом значении переменной х.

def F(x, a1, a2):
    P = 25 <= x <= 64
    Q = 40 <= x <= 115
    A = a1 <= x <= a2
    return P <= ((Q and (not A)) <= (not P))

RES = []
M = [x / 4 for x in range(10 * 4, 130 * 4)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 14, 15]
# КЕГЭ = []
# на следующем уроке:
