# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print('1 2 3 4 5 6')
from itertools import permutations
table = '13 16 24 25 26 31 34 35 42 43 46 52 53 61 62 64'
graph = 'AD DA BD DB AC CA AF FA FE EF EC CE EB BE BC CB'
for p in permutations('ABCDEF'):
    new_table = table
    for i in range(1, 6+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''

'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((not z) and y and x and (not w)) or ((not z) and y and (not x) and (not w)) or (z and y and x and (not w))
                if F == 1:
                    print(x, y, z, w)
'''
'''
for n in range(1, 10000):
    s = f'{n:b}'
    if n % 3 == 0:
        s = s + s[-2:]
    else:
        x = (n % 3) * 3
        s = s + f'{x:b}'
    r = int(s, 2)
    if 125 <= r <= 130:
        print(r, n)
'''

'''
RES = []
for n in range(1, 10000):
    s = f'{n:b}'
    if n % 2 ==0:
        s = '10' + s
    else:
        s = '1' + s + '01'
    r = int(s,2)
    if n > 18:
        RES.append(r)
print(min(RES))
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [7, 11, 23]
# на следующем уроке: 8, 9, 25 (10, 24, 26)



'''
# Савелий = [10,12,2,1,4,3,5,6,13,14,16,15,18,19-21,11,7,8,9,17,22,23,25,27,24,26]
print(len('10,12,2,1,4,3,5,6,13,14,16,15,18,19,20,21,11,7,8,9,17,22,23,25,27,24,26'.split(',')))

# Ярик = 1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24
print(len(set('1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24'.split())))
# 5 11 16 17 22
'''


# region 📖 Пробник (Вариант 2)

# Студент #Савелий
# Дата: #Среда #04Марта2026
# ⛔️ Неверно: 5
# ❔ Без ответа: 6, 8, 9, 13, 14, 15, 17, 18, 22, 24, 25, 26, 27
# Итог: 13/29 первичных балла ~ 59 вторичных

# endregion 📖 Пробник (Вариант 2)
