# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 27771 Апробация 04.03.26 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print((F(2024) - 2 * F(2023)) / F(2022))
'''

# Вариант 2
'''
from functools import *
@lru_cache(None)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

for n in range(2025):
    F(n)

print((F(2024) - 2 * F(2023)) / F(2022))
'''


# 16
# № 21902 Открытый вариант 2025 (Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=n при n≥2025;
# F(n)=n×2+F(n+2), если n<2025.
# Чему равно значение выражения F(82)–F(81)?
'''
from functools import *
@lru_cache(None)
def F(n):
    if n >= 2025:
        return n
    if n < 2025:
        return n * 2 + F(n + 2)

for n in range(90-1, -1, -1):
    F(n)

print(F(82) - F(81))
'''

# № 20824 (Уровень: Базовый)
# (Д. Бахтиев) Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=111 при n<222;
# F(n)=2⋅(n+4)+F(n−3), если n≥222
# Чему равно значение выражения F(55555)−F(55543)?
'''
from functools import *
@lru_cache(None)
def F(n):
    if n < 222:
        return 111
    if n >= 222:
        return 2 * (n + 4) + F(n - 3)

for n in range(60000):
    F(n)

print(F(55555) - F(55543))
'''


# № 18123 (Уровень: Базовый)
# (Д. Бахтиев) Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями
# F(n)=n, при n≥2010;
# F(n)=F(n+3)+F(n+2)+F(n+1), если n<2010
# Чему равно значения выражения (F(2000)−2⋅(F(2002)+F(2003))) / F(2004)
'''
def F(n):
    if n >= 2010:
        return n
    if n < 2010:
        return F(n+3)+F(n+2)+F(n+1)
    
print((F(2000) - 2 * (F(2002)+F(2003))) / F(2004))
'''


# № 25355 ЕГКР 13.12.25 (Уровень: Базовый)
# Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−4)+3580, если n≥19;
# F(n)=6×(G(n−7)−36), если n<19;
# G(n)=n/20+28, если n≥248045;
# G(n)=G(n+9)−4, если n<248045.
# Чему равно значение функции F(673)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n >= 19:
        return F(n - 4) + 3580
    if n < 19:
        return 6 * (G(n - 7) - 36)

@lru_cache(None)
def G(n):
    if n >= 248045:
        return n / 20 + 28
    if n < 248045:
        return G(n + 9) - 4

for n in range(250000-1, -1, -1):
    G(n)

for n in range(700):
    F(n)

print(F(673))
'''

# № 24891 (Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n –– целое число, задан следующими соотношениями:
# F(n)=n при n≤10;
# F(n)=n−7+F(n−21), если n>10
# Чему равно значение выражения (F(185734)−F(185650))/F(40)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n <= 10:
        return n
    if n > 10:
        return n - 7 + F(n - 21)

for n in range(186000):
    F(n)
    
print((F(185734) - F(185650)) / F(40))
'''


# № 24211 (Уровень: Базовый)
# (М. Рубцова) Алгоритм вычисления значений функций
# F(n) и G(n), где n — целое число, задан следующими соотношениями:
# F(n)=3⋅(G(n−2)+5);
# G(n)=3⋅n, если n<8;
# G(n)=G(n−3)+2, если n≥8.
# Чему равно значение выражения F(12_345)?
'''
from functools import *

@lru_cache(None)
def F(n):
    return 3 * (G(n - 2) + 5)

@lru_cache(None)
def G(n):
    if n < 8:
        return 3 * n
    if n >= 8:
        return G(n - 3) + 2

for n in range(15000):
    G(n)
    
print(F(12345))
'''


# № 25400 (Уровень: Средний)
# (Р. Косов) Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n+4)+3020, если n<31054;
# F(n)=3×(G(n−2)−15), если n≥31054;
# G(n)=G(n−5)−15, если n≥28;
# G(n)=3×n−4, если n<28.
# Чему равно значение функции F(15)?

from functools import *
@lru_cache(None)
def F(n):
    if n< 31054:
        return F(n+4)+3020
    if n>= 31054:
        return 3*(G(n-2)-15)

@lru_cache(None)
def G(n):
    if n>= 28:
        return G(n-5)-15
    if n < 28:
        return 3* n - 4

for n in range(35000):
    G(n)
for n in range(35000, - 1, -1):
    F(n)
print(F(15))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [7, 11, 16, 23]
# на следующем уроке: 9, 17, 8, 22, 25, 27 (10, 24, 26)



'''
# Савелий = [10,12,2,1,4,3,5,6,13,14,16,15,18,19-21,11,7,8,9,17,22,23,25,27,24,26]
print(len('10,12,2,1,4,3,5,6,13,14,16,15,18,19,20,21,11,7,8,9,17,22,23,25,27,24,26'.split(',')))

# Ярик = 1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24
print(len(set('1 2 4 3 5 6 10 12 13 14 15 18 16 17 19 20 21 11 7 8 9 22 23 25 26 27 24'.split())))
# 5 11 16 17 22
'''


# region 📖 Пробник (Вариант 2)

# Студент #Савелий
# Дата: #Среда #04Марта2026
# ⛔️ Неверно: 5
# ❔ Без ответа: 6, 8, 9, 13, 14, 15, 17, 18, 22, 24, 25, 26, 27
# Итог: 13/29 первичных балла ~ 59 вторичных

# endregion 📖 Пробник (Вариант 2)
