# region Домашка: ******************************************************************

# № 21909 Открытый вариант 2025 (Уровень: Базовый)
# https://stepik.org/lesson/1038816/step/3?unit=1062780
'''
def divisors(n):
    d = []
    for j in range(1, int(n**0.5)+1):
        if n % j == 0:
            d.append(j)
            d.append(n // j)
    return sorted(set(d))

cnt = 0
for x in range(500_000+1, 10**10):
    d = divisors(x)
    R = sum(d)
    if R % 10 == 6:
        print(x, R)
        cnt += 1
        if cnt == 5:
            break
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 192.168.12.207 - четыре числа в диапазоне 0 <= x <= 255
# На каждое число выделяется по 1 байту = 8 бит
# Максимальое восьмибитное число: 11111111_2 -> 255_10

# Адрес сети = Узел сети & Маска сети
# 192.168.12.207 -> 11000000.10101000.00001100.11001111
# 255.192.0.0    -> 11111111.11000000.00000000.00000000
# Адрес сети:       11000000.10000000.00000000.00000000


# № 23857 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('192.168.12.207/255.192.0.0', 0)
for ip in net.hosts():
    s = f'{ip:b}'
    if s.count('1') == s.count('0'):
        print(ip)
'''


# № 15326 Досрочная волна 2024 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('105.224.200.224/255.255.255.224', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 4 == 0:
        cnt += 1
print(cnt)
'''

# № 21899 Открытый вариант 2025 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('98.81.154.195/255.252.0.0', 0)
for ip in net.hosts():
    print(ip)
'''


# № 21747 (Уровень: Базовый)
# Для узла с IP адресом 84.23.84.23
# адрес сети равен 84.23.84.0.
# Чему равно наибольшее значение суммы
# третьего и четвёртого слева байтов маски?
'''
from ipaddress import *
for mask in range(1, 32+1):
    net = ip_network(f'84.23.84.23/{mask}', 0)
    if '84.23.84.0' in str(net):
        print(net, mask, net.netmask)
'''


# № 18159 (Уровень: Базовый)
'''
from ipaddress import *
for mask in range(1, 32+1):
    net = ip_network(f'205.154.212.20/{mask}', 0)
    if '205.154.192.0' in str(net):
        print(net, net.netmask)
'''


# № 17709 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('235.53.0.0/255.255.224.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 5 == 0:
        if s[-3:] == '110':
            cnt += 1
print(cnt)  # 165
'''


# № 16260 Джобс 03.05.24 (Уровень: Средний)
'''
from ipaddress import *
for mask in range(1, 32+1):
    net1 = ip_network(f'123.20.103.136/{mask}', 0)
    net2 = ip_network(f'123.20.103.151/{mask}', 0)
    if net1 != net2:
        print(net1.netmask)
'''


# 15326
from ipaddress import *
net = ip_network('105.224.200.224/255.255.255.224')
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 4 == 0:
        cnt += 1
print(cnt)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 8, 13, 14, 15, 16, 23, 19-21, 25]
# КЕГЭ = []
# на следующем уроке:
