# region Домашка: ******************************************************************

'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (x or y) and (not(y == z)) and (not w)
                if F == 1:
                    print(x, y, z, w)
'''
from tkinter import image_names

# Решу ЕГЭ № 18483 (Уровень: Базовый)
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((y <= w) == (x <= (not z))) and (x or w)
                if F == 0:
                    print(x, y, z, w, int(F))

for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((y <= w) == (x <= (not z))) and (x or w)
                if F == 1:
                    print(x, y, z, w, int(F))
'''


# № 20569 (Уровень: Базовый)
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((w <= z) == (x <= (not y))) and (x or z)
                if F == 0:
                    print(x, y, z, w, int(F))

for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((w <= z) == (x <= (not y))) and (x or z)
                if F == 1:
                    print(x, y, z, w, int(F))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 23743 Демоверсия 2026 (Уровень: Базовый)

# В начальный момент Черепаха находится в начале координат,
# её голова направлена вдоль положительного направления оси ординат,
# хвост опущен.

# Черепахе был дан для исполнения следующий алгоритм.
# Повтори 2 [Вперёд 14 Налево 270 Назад 12 Направо 90]
# Поднять хвост
# Вперёд 9 Направо 90 Назад 7 Налево 90
# Опустить хвост
# Повтори 2 [Вперёд 13 Направо 90 Вперёд 6 Направо 90]

import turtle as t  # Подключение библиотеки с коротким именем t
t.screensize(5000, 5000)  # Для ползунков по холсту
t.tracer(0)  # Отключает анимацию отрисовки / мгновенная отрисовка
t.left(90)  # Необходимо сделать по условию, чтобы черепаха смотрела "вверх"
s = 30  # Переменная ответственная за масштаб фигур

# Повтори 2 [Вперёд 14 Налево 270 Назад 12 Направо 90]
for i in range(2):
    t.forward(14 * s)
    t.left(270)
    t.backward(12 * s)
    t.right(90)

t.up()  #  Поднять хвост

# Вперёд 9 Направо 90 Назад 7 Налево 90
t.fd(9 * s)
t.rt(90)
t.bk(7 * s)
t.lt(90)

t.down()  # Опустить хвост

t.color('blue')  # меняем цвет второй фигуры

# Повтори 2 [Вперёд 13 Направо 90 Вперёд 6 Направо 90]
for i in range(2):
    t.forward(13 * s)
    t.right(90)
    t.forward(6 * s)
    t.right(90)

# Тут отрисовываем точки:
t.up()
for x in range(-50, 50):  # Перебираем координаты точек
    for y in range(-50, 50):
        t.goto(x * s, y * s)  # Прыгаем в конкретную координату
        t.dot(3, 'red')  # Рисуем точку красного цвета и толщиной 3

t.update()  # Для корректной работы t.tracer()
t.done()  # Для того, чтобы зафиксировать окно отрисовки





# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Женя 5/7 -> 34 вторичных баллов +[2, 5, 8, 12, 14] -[6, 10]

# Второй пробник 28.02.25:
# Женя 10/29 -> 51 вторичных баллов +[2, 5, 6, 10, 13, 14, 15, 16, 23, 25] -[8, 12]
