# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

#
# № 27623 Апробация 04.03.26 (Уровень: Базовый)

alp = 10 + 26 + 8164
# print(alp, 2**14)
i = 14  # 2 ** 14 >= alp

byte = 156 * 2**10 / 835
print(byte)  # 191.3101 -> 192
bit = 192 * 8


# bit = sym * i
sym = bit / i
print(sym)


# № 27766 Апробация 04.03.26 (Уровень: Базовый)
'''
alp = 10 + 26 + 34
print(alp, 2**7)
i = 7  # 2 ** 7 >= alp

byte = 305 * 2**10 / 1142
print(byte)  # 273.485 -> 274
bit = 274 * 8


# bit = sym * i
sym = bit / i
print(sym)  # 313.14
'''
# i = 7
# 2 ** 7 = 128
# 2**6+1 = 65

# endregion Урок: *************************************************************
#
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке: 4, 22, 24, 26


# region 📖 Пробник (Вариант 2)

# Студент #Женя
# Дата: #Четверг #26Февраля2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17, 27
# ❔ Без ответа: 22, 24, 26
# Итог: 23/29 первичных балла ~ 85 вторичных

# Студент #Кирилл
# Дата: #Четверг #26Февраля2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 19, 20, 21, 23
# ⛔️ Неверно: 17, 18, 22, 24, 25, 26, 27
# ❔ Без ответа: Нет
# Итог: 20/29 первичных балла ~ 78 вторичных

# Студент #Дима
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 10, 11, 12, 13, 15, 16, 19, 20, 21, 23
# ⛔️ Неверно:
# ❔ Без ответа: 8, 9, 14, 17, 18, 22, 24, 25, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных

# endregion 📖 Пробник (Вариант 2)

