# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 11780 (Уровень: Базовый)
'''
from ipaddress import *
R = []
net = ip_network('185.8.0.0/255.255.128.0', 0)
for ip in net:
    ip2 = f'{ip:b}'
    R.append(ip2.count('1'))
print(max(R))
'''


# № 10773 (Уровень: Базовый)

# 133.57.64.130 = 1 байт 1 байт 1 байт 1 байт
# 1 байт = 8 бит ->   8  8  8  8  бит  -> 32 бит
'''
from ipaddress import *
cnt = 0
for mask in range(0, 32+1):
    net = ip_network(f'133.57.64.130/{mask}', 0)
    if '133.57.64.0' in str(net):
        print(net, net.netmask)
        cnt += 1
print(cnt)
'''


# № 23372 Резервный день 19.06.25 (Уровень: Базовый)
'''
from ipaddress import *
R = []
net = ip_network('185.8.0.0/255.255.128.0', 0)
for ip in net:
    print(ip)
'''


# endregion Урок: *************************************************************
#
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке: 4, 22, 24, 26


# region 📖 Пробник (Вариант 2)

# Студент #Женя
# Дата: #Четверг #26Февраля2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17, 27
# ❔ Без ответа: 22, 24, 26
# Итог: 23/29 первичных балла ~ 85 вторичных

# Студент #Кирилл
# Дата: #Четверг #26Февраля2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 19, 20, 21, 23
# ⛔️ Неверно: 17, 18, 22, 24, 25, 26, 27
# ❔ Без ответа: Нет
# Итог: 20/29 первичных балла ~ 78 вторичных

# Студент #Дима
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 10, 11, 12, 13, 15, 16, 19, 20, 21, 23
# ⛔️ Неверно:
# ❔ Без ответа: 8, 9, 14, 17, 18, 22, 24, 25, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных

# endregion 📖 Пробник (Вариант 2)

