# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 20911 Апробация 05.03.25 (Уровень: Базовый)

from math import dist
# i          0    1   2
clustersA = [[], []]
clustersB = [[], [], []]

for s in open('files/27A.txt'):
    s = s.replace(',', '.')
    x, y = [float(x) for x in s.split()]
    if y > 0:
        clustersA[0].append([x, y])
    else:
        clustersA[1].append([x, y])

for s in open('files/27B.txt'):
    s = s.replace(',', '.')
    x, y = [float(x) for x in s.split()]
    if y > 5:
        clustersB[0].append([x, y])
    if -5 < y < 5:
        clustersB[1].append([x, y])
    if y < -5:
        clustersB[2].append([x, y])

# Будем называть центром кластера точку этого кластера,
# сумма расстояний от которой до всех остальных точек кластера минимальна.
'''
def d(A, B):
    x1, y1 = A
    x2, y2 = B
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5

print(d([3, 4], [5, 6]))

from math import dist
print(dist([3, 4], [5, 6]))
'''

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        # print(summa, p)
        R.append([summa, p])
    return min(R)[1]

# Для каждого файла определите координаты центра каждого кластера
# Затем вычислите два числа:
# Px – среднее арифметическое абсцисс центров кластеров, и
# Py – среднее арифметическое ординат центров кластеров.
# В ответе запишите четыре числа: в первой строке сначала целая часть
# абсолютного значения произведения
# Px × 10000, затем целая часть абсолютного значения произведения
# Py × 10000 для файла А, во второй строке – аналогичные данные для файла B.

print(center(clustersA[0]))  # [3.7046261187, 5.757797218]
print(center(clustersA[1]))  # [2.0161619849, -3.6989345413]
PxA = (3.7046261187 + 2.0161619849) / 2 * 10000
PyA = (5.757797218 + -3.6989345413) / 2 * 10000
print(int(abs(PxA)), int(abs(PyA)))

print(center(clustersB[0]))  # [10.6474896077, 9.7540330133]
print(center(clustersB[1]))  # [3.6152550029, -0.0975921536]
print(center(clustersB[2]))  # [4.1152564179, -13.0184433974]

PxB = (10.6474896077 + 3.6152550029 + 4.1152564179) / 3 * 10000
PyB = (9.7540330133 + -0.0975921536 + -13.0184433974) / 3 * 10000
print(int(abs(PxB)), int(abs(PyB)))


# endregion Урок: *************************************************************
#
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 19-21, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке:
