# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации:
# 1 бит - минимальная единица измерения информации
# 1 байт = 8 бит = 2**3 бит
# 1 Кбайт = 1024 байт = 2**10 байт = 2**13 бит
# 1 Мбайт = 1024 Кбайт = 2**20 байт = 2**23 бит
# 1 Гбайт = 1024 Мбайт = 2**30 байт = 2**33 бит

'''
sym = 4
alp = 10   # - мощность алфавита
# alp = 2 ** i
i = 4  # 2 ** 4 >= 10

# i - это бит на один символ
bit = sym * i  # сколько битов уходит на один пароль

print(bit / 8)  # 2.0 -> 2  (всегда округялем вверх)
byte = 2
'''


# https://education.yandex.ru/ege/task/b931a5bf-94b1-4fb8-86ec-e452222a1723
'''
sym = 11
alp = 9540
i = 14  # 2 ** 14 >= alp

bit = sym * i  # вес одного пароля в бит
print(bit / 8)  # 19.25 -> 20
byte = 20  # вес одного пароля в байт

print((21504 * byte) / 2**10)
'''


# № 21897 Открытый вариант 2025 (Уровень: Базовый)
# Известно, что для хранения 703 569 серийных номеров доступно не более 77 Мбайт памяти.
'''
sym = 246
# alp - ?
# i - ?

byte = (77 * 2**20) / 703_569  # байт на один пароль
print(byte)  # 114.758 -> 114
byte = 114
bit = byte * 8
i = bit / sym
print(i)  # 3.707
i = 3
'''
# i = 3 - максимальная мощность алфавита: 8
# i = 3 - минимальная мощность алфавита: 5


# i = 4: alp[2**3+1:2**4]
# alp = 16  # i = 4
# alp = 17  # i = 5


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Ульяна 5/8 -> 34 вторичных баллов +[1, 2, 4, 6, 12] -[5, 13, 14]

# Второй пробник 28.02.25:
# Ульяна 10/29 -> 51 вторичных баллов +[1-4, 6, 10, 13, 15, 16, 23] -[5, 8, 9, 12, 14, 17, 25]
