# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации:
# 1 бит - минимальная единица измерения информации
# 1 байт = 8 бит = 2**3 бит
# 1 Кбайт = 1024 байт = 2**10 байт = 2**13 бит
# 1 Мбайт = 1024 Кбайт = 2**20 байт = 2**23 бит
# 1 Гбайт = 1024 Мбайт = 2**30 байт = 2**33 бит

# 5 Мбайт = 5*2**23 бит
# 7 Кбайт = 7*2**10 байт

# pixels = x * y
# colors = 2 ** i
# bit = pixels * i

# colors = 16
# i = 4 - бит на один пиксель

# https://education.yandex.ru/ege/task/5511c181-ed14-4583-aadc-4a8a2d07ecd0
'''
pixels = 640 * 480
bit = 40 * 2**13  # бит
i = bit / pixels
print(i)  # 1.0666
print(2 ** 1)  # 2
'''


# https://education.yandex.ru/ege/task/7ca1cc68-b078-47db-b54a-e21af25f782d
'''
pixels = 1280 * 960
bit = 320 * 2**13
i = bit / pixels
print(i)  # 2.1333 -> 2
print(2 ** 2)


print(2.5 * 2**10)
'''

# https://education.yandex.ru/ege/task/7832cb97-c76a-492e-82c1-cb1a4ed6a954
'''
# bit = a (шт) * b (Гц) * c (бит) * t (сек)

a = 1
b = 32000
c = 16
# t - ?   Какова продолжительность голосового сообщения в секундах?

T = 5
bit = 1024000 * T


t = bit / (a * b * c)
print(t)
'''


# https://education.yandex.ru/ege/task/7954f17b-5247-4104-b3ac-b8f0d668abb2


pixels = 1280 * 960
colors = 2048  # 2 ** 11 >= 2048
i = 11
bit_photo = pixels * i  # вес одного кадра в бит
bit_photo = bit_photo * 10 # 10 кадров в секунду
# t - ? -

# bit_music = a * b * c * t
a = 1
b = 32000
c = 16
# t - ?

u = 96_468_992 # бит/с.
T = 200
bit_video = u * T

# bit_video = (a * b * c * t) + (bit_photo * t)
# bit_video = ((a * b * c) + bit_photo) * t
t = bit_video / ((a * b * c) + bit_photo)
print(t)  # 142.20075


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Ульяна 5/8 -> 34 вторичных баллов +[1, 2, 4, 6, 12] -[5, 13, 14]

# Второй пробник 28.02.25:
# Ульяна 10/29 -> 51 вторичных баллов +[1-4, 6, 10, 13, 15, 16, 23] -[5, 8, 9, 12, 14, 17, 25]
