# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 21412 Досрочная волна 2025 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('143.168.72.213/255.255.255.240', 0)
for ip in net:
    print(ip)
'''
import reprlib

# 143.168.72.222 -> 14316872222


# № 20959 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('203.68.128.0/255.255.192.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 7 != 0:
        cnt += 1
print(cnt)
'''

'''
from ipaddress import *
net = ip_network('203.68.128.0/255.255.192.0', 0)
print(net)
'''

# № 18928 Новогодний вариант 2025 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('192.168.248.176/255.255.255.240', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') == b.count('0'):
        cnt += 1
print(cnt)
'''


# № 18159 (Уровень: Базовый)
'''
from ipaddress import *
for mask in range(32+1):  # кол-во единиц в маске сети (двоичная запись)
    net = ip_network(f'205.154.212.20/{mask}', 0)
    if '205.154.192.0' in str(net):
        print(net, mask, net.netmask)
'''
'''
from ipaddress import *
for mask in range(32+1):  # кол-во единиц в маске сети (двоичная запись)
    net = ip_network(f'205.154.212.20/{mask}', 0)
    print(net, net.netmask)
'''


'''
from ipaddress import *
for mask in range(32+1):  # кол-во единиц в маске сети (двоичная запись)
    net1 = ip_network(f'123.20.103.136/{mask}', 0)
    net2 = ip_network(f'123.20.103.151/{mask}', 0)
    if net1 != net2:
        print(net1.netmask)
'''

# № 21413 Досрочная волна 2025 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:21]:
    A = int(f'82934{x}2', 21)
    B = int(f'2924{x}{x}7', 21)
    C = int(f'67564{x}8', 21)
    if (A + B + C) % 20 == 0:
        print((A + B + C) // 20)
'''


# № 19880 (Уровень: Базовый)
'''
n = 15625**16 - 3125**3 * 25**19 + 625**4 - 2005
R = []
while n > 0:
    # R.append(n % 25)
    R = [n % 25] + R
    n //= 25
# R.reverse()
print(R.count(0))
'''


# № 21709 ЕГКР 19.04.25 (Уровень: Базовый)

M = []
for x in range(1, 3000+1):
    n = 4**210 + 4**110 - x
    R = []
    while n > 0:
        R.append(n % 4)
        n //= 4
    R.reverse()
    if R.count(0) == 105:
        print(x)
    M.append([R.count(0), x])

print(max(M))



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Ульяна 5/8 -> 34 вторичных баллов +[1, 2, 4, 6, 12] -[5, 13, 14]

# Второй пробник 28.02.25:
# Ульяна 10/29 -> 51 вторичных баллов +[1-4, 6, 10, 13, 15, 16, 23] -[5, 8, 9, 12, 14, 17, 25]
