# region Домашка: ******************************************************************


# Монетный размен: количество и остаток
'''
rub = int(input())
nominal = int(input())
print(rub // nominal)
print(rub % nominal)
'''


# n = 123
# print(n // 100)  # 1
# print((n // 10) % 10)  # 2
# print(n % 10)  # 3


# Произведение и сумма цифр пятизначного числа
'''
n = int(input())  # 54378
a = n // 10000
b = (n // 1000) % 10
c = (n // 100) % 10
d = (n // 10) % 10
e = n % 10
print(a * b * c * d * e)
print(a + b + c + d + e)


# Вариант 2
a = int(input())  # 54378
a1 = a // 10000
a2 = (a - (a1 * 10000)) // 1000
a3 = (a - (a1 * 10000 + a2 * 1000)) // 100
a4 = (a - (a1 * 10000 + a2 * 1000 + a3 * 100)) // 10
a5 = (a - (a1 * 10000 + a2 * 1000 + a3 * 100 + a4 * 10))
print(a1 * a2 * a3 * a4 * a5)
print(a1 + a2 + a3 + a4 + a5)

# Вариант 3
A = input()  # str
# i   01234
# A = 54378
a = int(A[0])
b = int(A[1])
c = int(A[2])
d = int(A[3])
e = int(A[4])
print(a * b * c * d * e)
print(a + b + c + d + e)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Условные операторы (ветвление): if, elif, else

# if - если
# elif - иначе если
# else - иначе

# x = int(input('x: '))
# y = int(input('y: '))
'''
x, y = -5, 5

if x > 0 and y > 0:
    print('Первая четверть')
elif x < 0 and y > 0:
    print('Вторая четверть')
elif x < 0 and y < 0:
    print('Третья четверть')
elif x > 0 and y < 0:
    print('Четвертая четверть')
else:
    print('Лежит на осях')

print('Продолжаем программу')
'''


'''
k = 1
k = k + 1
print(k)  # 2

k += 1
print(k)  # 3

k //= 3
print(k)  # 1
'''


# Каскадные условные операторы
'''
x = int(input('x: '))
y = int(input('y: '))

if x > 0:
    if y > 0:  # x > 0, y > 0
        print('Первая четверть')
    else:  # x > 0, y <= 0
        print('Четвертая четверть')
else:  # x <= 0
    if y > 0:  # x <= 0, y > 0
        print('Вторая четверть')
    else:  # x <= 0, y <= 0
        print('Третья четверть')
'''


# Логические связки: and, or, not, in, ^, !=, ==
'''
flag = True
print(not flag)  # False
print(not(not flag))  # True

s = '2134235'
for x in s:  # Пробегаем все элементы строки s
    if x in '02468':  # Если элемент строки X лежит в наборе целых цифр
        print(x)

a, b = 5, 4
print(a == b)  # False
print(a != b)  # True

a, b, c = 5, -6, 7
if a > 0 and b > 0:
    print('and - гарантирует, что все условия выполняются')
if a > 0 or b > 0:
    print('or - говорит о том, что хотя бы одно выполняется')
if (a > 0) ^ (b > 0):
    print('^, != - гарантируют, что только одно условие выполняется')
if (a > 0) != (b > 0):
    print('!=, ^ - гарантируют, что только одно условие выполняется')


print(True + False + True)  # 2


a, b, c = 5, -6, 7
#   True   +  False  +  True
if (a > 0) + (b > 0) + (c > 0) == 2:
    print('Только два условия выполняются')
if (a > 0) + (b > 0) + (c > 0) <= 2:
    print('Не более двух выполняются')
'''


# Подключение библиотек в Python
'''
M = [1, 2, 3, 4, 5]

# ctrl + B
import math
print(math.prod(M))  # 120

import math as m  # Переименовали библиотеку в короткое имя
print(m.prod(M))  # 120

from math import prod, sqrt  # Подключили только конкретные функции из библиотеки math
print(prod(M))  # 120

from math import *  # Подключили сразу все функции
print(prod(M))  # 120
print(sqrt(16))  # 4.0
print(16 ** (1/2))
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
