# region Домашка: ******************************************************************

# Сколько раз?
'''
s = input()
print('Символ + встречается', s.count('+'), 'раз')
print(f'Символ * встречается {s.count("*")} раз')
'''

'''
s = 'это неизбежная часть процесса обучения и роста'
words = [x for x in s.split()]
# ['это', 'неизбежная', 'часть', 'процесса', 'обучения', 'и', 'роста']

words = [len(x) for x in s.split()]
# [3, 10, 5, 8, 8, 1, 5]
print(max(words))
'''
'''
s = input()
words = [len(x) for x in s.split()]
print(max(words))
'''


# «two»
'''
s = input()  # 1221221
s = s.replace('22', 'two')
print(s)  # 1two1two1
'''


# Перевод в троичную
'''
n = int(input())
b = 3
r = ''
while n > 0:
    r += str(n % b)
    n //= b  # n = n // b
r = r[::-1]
print(r)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Задание 12 https://education.yandex.ru/ege/task/50343d35-5e5e-4947-8e25-107f7693eecd
'''
s = '5' + '4' * 57
while '5454' in s or '554' in s or '444' in s:
    if '5454' in s:
        s = s.replace('5454', '2', 1)
    else:
        s = s.replace('554', '45', 1)
    s = s.replace('444', '54', 1)
print(s)
'''

R = []
for n in range(4, 1000):
    s = '3' + '5' * n
    while '333' in s or '555' in s:
        if '555' in s:
            s = s.replace('555', '3', 1)
        else:
            s = s.replace('333', '5', 1)
    summa = sum(map(int, s))
    R.append(summa)  # Добавляем новый элемент в список
print(max(R))


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6, 12]
# КЕГЭ  = []
# на следующем уроке:
