# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

#
# № 19255 ЕГКР 21.12.24 (Уровень: Базовый)
# Среди натуральных чисел, не превышающих 10**10,
# найдите все числа, соответствующие маске 54?1?3*7,
# делящиеся на 18579 без остатка.

'''
from fnmatch import *
for x in range(18579, 10**10, 18579):
    if fnmatch(str(x), '54?1?3*7'):
        print(x, x // 18579)
'''


'''
import time
start = time.time()

# def divisors(x):
#     div = []
#     for j in range(1, x+1):
#         if x % j == 0:
#             div.append(j)
#     return div


def divisors(x):
    div = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


print(divisors(100_000_000))

print(time.time() - start)  # 2.8222 -> 0.00035
'''


#
# № 17879 Демоверсия 2025 (Уровень: Базовый)
'''
def divisors(x):
    div = []
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


k = 0
for x in range(800_000+1, 10**10):
    d = divisors(x)
    if len(d) >= 2:
        M = max(d) + min(d)
        if M % 10 == 4:  # M оканчивается на
            print(x, M)
            k += 1
            if k == 5:
                break
'''


# № 17686 Пересдача 04.07.24 (Уровень: Базовый)
# которых есть натуральный делитель, оканчивающийся на цифру 7
# и не равный ни самому числу, ни числу 7

def divisors(x):
    div = []
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


k = 0
for x in range(700_000+1, 10**10):
    d = [j for j in divisors(x) if j % 10 == 7 and j != 7]
    if len(d) > 0:
        print(x, min(d))
        k += 1
        if k == 5:
            break

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Ульяна 5/8 -> 14 вторичных баллов +[1, 2, 4, 6, 12] -[5, 13, 14]
