

# Типы данных переменных
'''
a = 5  # int (integer) - целочисленные значения
print(type(a))  # <class 'int'>

b = 5.0  # float (число с плавающей точкой) - вещественное значение
print(4 / 2, type(4 / 2))  # 2.0 <class 'float'>

c = '5'  # str (string) - строковый тип данных для хранения текста
print(c * 4)  # 5555 - при умножении строки на число - строка дублируется
print('hello ' * 4)  # hello hello hello hello

c1 = 'Hello,'
c2 = ' world!'
c = c1 + c2
print(c)  # Hello, world! - операция конкатенации строк (склеивание)
# TypeError: can only concatenate str (not "int") to str


d1 = True  # bool (Boolean) - Основы Булевой алгберы / математическая логика
d0 = False
print(4 < 10)  # True
print(4 == 10)  # False
'''


# Типы данных коллекций (последовательностей)
'''
L = [1, 2, 3, 4, 5]  # list (список)
# 1. Могут хранить неограниченное кол-во элементов
# 2. Элементы могут быть в различных типа данных (в отличие от массивов)
# 3. Каждый элемент имеет свой порядковый номер - индекс
# 4. Индексы могут считаться слева-направо начиная с 0 или справа-налево начиная с -1
# 5. В списках можно изменять значение элементов через индексы (в отличие от кортежей и множеств)

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

M[0], M[-1] = M[-1], M[0]
print(M)  # ['e', 'b', 'c', 'd', 'a']

for i in range(len(M)):
    M[i] = M[i] * i
print(M)  # ['', 'b', 'cc', 'ddd', 'aaaa']


# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

print(f'Первый элемент списка М: {M[0]}')
print(f'Последний элемент списка М: {M[4]}')
print(f'Последний элемент списка М: {M[-1]}')


M = [2, '2', 2.0, True, [1, 2, 3]]
for x in M:
    print(type(x), x)
    # <class 'int'> 2
    # <class 'str'> 2
    # <class 'float'> 2.0
    # <class 'bool'> True
    # <class 'list'> [1, 2, 3]

T = (1, 2, 3, 4, 5)  # tuple (кортеж)
# 1. Полностью идентичный спискам, но изменять значение элементов нельзя

S = {1, 2, 2, 3, 3, 3}  # set (множество)
# 1. Не могут содрежать копии элементов
print(S)  # {1, 2, 3}
'''

# Немного про теорию множеств
'''
# N = {1, 2, 3, ..., + inf}
# Z = {-inf, ..., -2, -1, 0, 1, 2, ...., +inf} - Множество N принадлежин множеству Z

P = {2, 3, 5, 7, 11, 13, ...}
C = {4, 6, 8, 9, 10, 12, 14, ...}
'''


# Конвертация типов данных
'''
a = 5
print(type(a), a)  # <class 'int'> 5

a = str(a)
print(type(a), a)  # <class 'str'> 5

a = float(a)
print(type(a), a)  # <class 'float'> 5.0

a = int(a)
print(type(a), a)  # <class 'int'> 5


A = [1, 2, 2, 3, 3, 3]
print(type(A), A)  # <class 'list'> [1, 2, 2, 3, 3, 3]

A = tuple(A)
print(type(A), A)  # <class 'tuple'> (1, 2, 2, 3, 3, 3)

A = set(A)
print(type(A), A)  # <class 'set'> {1, 2, 3}

A = list(A)
print(type(A), A)  # <class 'list'> [1, 2, 3]
'''


# Ввод данных с клавиатуры
'''
age = int(input('Введите возраст: '))
print(age, type(age))

name = input('Введите имя пользователя: ')
print(f'Привет, {name}!')
'''


# f-строка
'''
name = input('Введите имя пользователя: ')
weather = 'облачно'
temperature = 24

# Привет, name! Сегодня weather, а температура temperature градусов!
print('Привет, ', name, '! Сегодня ', weather, ', а температура ', temperature, ' градусов! ')
print('Привет, ' + name + '! Сегодня ' + weather + ', а температура ' + str(temperature) + ' градусов! ')
print('Привет, {}! Сегодня {}, а температура {} градусов!'.format(name, weather, temperature))
print(f'Привет, {name}! Сегодня {weather}, а температура {temperature} градусов!')
'''


# Базовая арифметика
'''
a, b = 7, 2

print(f'{a} + {b} = {a + b} \n'  # \n - это переход на новую строку
      f'{a} - {b} = {a - b} \n'
      f'{a} * {b} = {a * b}')

print()  # В каждой функции print() есть переход на новую строку \n

print(f'{a} / {b} = {a / b}')  # - Обыкновенное вещественное деление (результат всегда float)
print(f'{a} // {b} = {a // b}')  # - Взятие только целой части (результат всегда int)
print(f'{a} % {b} = {a % b}')  # Взятие остатка от деления (результат всегда int)


n = 123
print(n // 10)  # 12
print(n % 10)  # 3

print(n // 100)  # 1
print(n % 100)  # 23

print(n % 1000)  # 123


if n % 2 == 0:
      print('Кратно 2 | Делится на 2 | Четное')
else:
      print('Не кратное | Не делится | Нечетное')


print(2 ** 3)  # 8
print(2 ** 4)  # 16
print(2 ** 5)  # 32

print(16 ** (1 / 2))  # 4
print(27 ** (1 / 3))  # 3
'''





