# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 7618 Досрочная волна 2023(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – натуральное число, задан следующими соотношениями:
# F(n)=n при n≥2025;
# F(n)=n+F(n+2), если n<2025.
# Чему равно значение выражения F(2022)−F(2023)?
'''
def F(n):
    if n >= 2025:
        return n
    if n < 2025:
        return n + F(n + 2)

print(F(2022) - F(2023))
'''

# № 31513 Демоверсия 2027(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=n×F(n−1), если n>1.
# Чему равно значение выражения (F(3038)+5×F(3037))/F(3036)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print( (F(3038) + 5 * F(3037)) // F(3036)  )
'''
#   [Previous line repeated 996 more times]
# RecursionError: maximum recursion depth exceeded



# № 17557 Основная волна 08.06.24(Уровень: Базовый)
# Алгоритм вычисления значения функции F(n), где n – натуральное число,
# задан следующими соотношениями:
# F(n)=1 при n=1;
# F(n)=2×n×F(n–1), если n>1.
# Чему равно значение выражения (F(2024)/16−F(2023))/F(2022)?
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return 2 * n * F(n - 1)


print(  (F(2024) // 16 - F(2023)) // F(2022) )
'''
#     print(  (F(2024)/16 - F(2023))/F(2022) )
#              ~~~~~~~^~~
# OverflowError: integer division result too large for a float



# № 18931 Новогодний вариант 2025(Уровень: Базовый)
# (М. Попков) Снежная Королева создала волшебную функцию F(n), которая
# помогает ей вычислять силу зимы. Эта функция определяется следующим
# образом:
# F(n)=n−1, при n⩽3;
# F(n)=F(n−2)+n/2−F(n−4), если n>3 и n чётно;
# F(n)=F(n−1)×n+F(n−2), если n>3 и n нечётно, где n – целое неотрицательное число.
# Королева решила узнать, насколько велика сила зимы в её королевстве.
# Для этого вычислите значение выражения: F(4952)+2×F(4958)+F(4964).
'''
from functools import *

@lru_cache(None)
def F(n):
    if n <= 3:
        return n - 1
    if n > 3 and n % 2 == 0:
        return F(n - 2) + n / 2 - F(n - 4)
    if n > 3 and n % 2 != 0:
        return F(n - 1) * n + F(n - 2)

for n in range(5000):
    F(n)

print(F(4952)+2 * F(4958)+F(4964))
'''



# № 14336 (Уровень: Базовый)
# (Л. Шастин) Алгоритм вычисления значения функции
# F(n), где n – целое число, задан следующими соотношениями:
# F(n)=n+6 при n>10000;
# F(n)=2⋅n+8+F(n+4), если n≤10000.
# Чему равно значение выражения F(1092)−F(1104)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n > 10000:
        return n + 6
    if n <= 10000:
        return 2 * n + 8 + F(n + 4)

for n in range(10010-1, -1, -1):
    F(n)

print(F(1092) - F(1104))
'''


# № 23375 Резервный день 19.06.25(Уровень: Базовый)
# Алгоритм вычисления значения функции
# F(n) и  G(n), где n – целое число, задан следующими соотношениями:
# F(n)=G(n−1)+G(n−3);
# G(n)=3×n, если n≤9.
# G(n)=G(n−4)+2, если n>9.
# Чему равно значение выражения F(42999)?
'''
from functools import *

def F(n):
    return G(n - 1) + G(n - 3)

@lru_cache(None)
def G(n):
    if n <= 9:
        return 3 * n
    if n > 9:
        return G(n - 4) + 2

for n in range(43000):
    G(n)

print(F(42999))
'''



#
# № 25355 ЕГКР 13.12.25(Уровень: Базовый)
# Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−4)+3580, если n≥19;
# F(n)=6×(G(n−7)−36), если n<19;

# G(n)=n/20+28, если n≥248045;
# G(n)=G(n+9)−4, еслиn<248045.
# Чему равно значение функции F(673)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n >= 19:
        return F(n - 4) + 3580
    if n < 19:
        return 6 * (G(n - 7) - 36)

@lru_cache(None)
def G(n):
    if n >= 248045:
        return n / 20 + 28
    if n <= 248045:
        return G(n + 9) - 4

for n in range(250_000-1, -1, -1):
    G(n)

for n in range(700):
    F(n)

print(F(673))
'''


# № 25397 (Уровень: Средний)
# (Р. Косов) Алгоритм вычисления функций
# F(n) и G(n), где n - целое число, задан следующими соотношениями:
# F(n)=F(n−4)+3020, если n>40;
# F(n)=3×(G(n−2)−15), если n≤40;

# G(n)=10×n+50, если n≥301208;
# G(n)=G(n+7)−21, если n<301208.
# Чему равно значение функции F(2026)?



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10, 14, 16, 19-21]
# КЕГЭ = []
# на следующем уроке:



