# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# № 31502 Демоверсия 2027(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# Алгоритм строит по нему новое число R следующим образом.
# 1. Строится двоичная запись числа N.
'''
for n in range(1, 10000):
    n2 = bin(n)[2:]

# Двоичную восьмибитную запись

for n in range(1, 255+1):
    n2 = bin(n)[2:].zfill(8)
    print(n2)

for n in range(128, 255+1):
    n2 = bin(n)[2:].zfill(8)
    print(n2)
'''



# № 564 (Уровень: Средний)
# Автомат обрабатывает натуральное число N < 128 по следующему алгоритму:
# 1. Строится восьмибитная двоичная запись числа N.
# 2. Инвертируются разряды исходного числа (0 заменяется на 1, 1 на 0).
# 3. К полученному двоичному числу прибавляют единицу.
# 4. Полученное число переводится в десятичную систему счисления.
# Для какого числа N результат работы алгоритма равен 153?
'''
for n in range(129, 255+1):
    n2 = bin(n)[2:]
    n2 = n2.replace('1', '*')
    n2 = n2.replace('0', '1')
    n2 = n2.replace('*', '0')
    n2 += '1'
    r = int(n2, 2)
    if r == 153:
        print(n)
'''

'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alp[:2])  # ['0', '1']
print(alp[:8])  # ['0', '1', '2', '3', '4', '5', '6', '7']
'''

# № 31360 Пересдача 08.07.26(Уровень: Базовый)
# Операнды арифметического выражения записаны в системе счисления с основанием 22.

# 27x98966_22 + 26x33_22 + 522x5_22

# В записи чисел переменной х обозначена неизвестная цифра из алфавита 22-ричной
# системы счисления. Определите наибольшее значение х, при котором значение
# данного арифметического выражения кратно 21. Для найденного х вычислите
# частное от деления значения арифметического выражения на 21 и укажите его
# в ответе в десятичной системе счисления. Основание системы счисления
# указывать не нужно.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:22]:
    A = int(f'27{x}98966', 22)
    B = int(f'26{x}33', 22)
    C = int(f'522{x}5', 22)
    if (A + B + C) % 21 == 0:
        print((A + B + C) // 21)
'''


# Пример задачки номер 14 из статграда:
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:17]:
    A = int(f'AB{x}12', 17)
    B = int(f'4E{x}3F', 17)
    if (A + B) % 16 == 0:
        print(x, (A + B) // 8)
'''

# Универсальная функция для перевода в b-ю систему счисления
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

print(convert(8, 2))  # 1000
print(int('1000', 2))  # 8


print(convert(10**8, 16))  # 5F5E100
print(int('5F5E100', 16))  # 100000000'''


# Пример задачки номер 14 из статграда:
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

for x in range(1, 2000):
    n = 11 * 15 ** 13 + 14 * 15 ** 8 - x
    n15 = convert(n, 15)
    if n15.count('0') % 2 != 0:
        print(x)
'''

'''
for x in range(1, 2000):
    n = 11 * 15 ** 13 + 14 * 15 ** 8 - x
    cnt0 = 0
    while n > 0:
        if n % 15 == 0:
            cnt0 += 1
        n //= 15
    if cnt0 % 2 != 0:
        print(x)


RES = []
for x in range(1, 8410):
    n = 29 ** 293 + 29 ** 271 - x
    cnt0 = 0
    while n > 0:
        if n % 29 == 0:
            cnt0 += 1
        n //= 29
    RES.append(cnt0)
print(max(RES))
'''


# № 19484 (Уровень: Базовый)
'''
n = 5 * 729 ** 2024 + 3 * 243 ** 1413 - 7 * 81 ** 169 - 2 * 9 ** 107 + 3017
summa = 0
while n > 0:
    ostat = n % 27
    if ostat % 2 == 0 and ostat <= 25:
        summa += ostat
    n //= 27
print(summa)
'''



# № 29974 Апробация 14.05.26(Уровень: Базовый)
# 1 куча: -3, -7,  /4 (до меньшего)  |  s <= 15  |  s > 15
'''
from math import floor, ceil
def F(s, n):
    if s <= 15:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s - 3, n - 1), F(s - 7, n - 1), F(floor(s / 4), n - 1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)
    return any(h) if (n - 1) % 2 == 0 else any(h)

print(19, [s for s in range(16, 1000) if F(s, n=2)])
print(20, [s for s in range(16, 1000) if F(s, n=3) and not F(s, n=1)])
print(21, [s for s in range(16, 1000) if F(s, n=4) and not F(s, n=2)])
'''

# № 29351 Открытый вариант 2026(Уровень: Базовый)
# 2 кучи: s1+4, s2+4, s1*3, s2*3 | s1 + s2 >= 154 | s1 = 11 | 1 ≤ s2 ≤ 142

def F(s1, s2, n):
    if s1 + s2 >= 154:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s1 + 4, s2, n-1), F(s1, s2 + 4, n-1), F(s1 * 3, s2, n-1), F(s1, s2 * 3, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)
    return any(h) if (n - 1) % 2 == 0 else any(h)

print(19, [s2 for s2 in range(1, 142+1) if F(11, s2, n=2)])
print(20, [s2 for s2 in range(1, 142+1) if F(11, s2, n=3) and not F(11, s2, n=1)])
print(21, [s2 for s2 in range(1, 142+1) if F(11, s2, n=4) and not F(11, s2, n=2)])

# после неудачного хода, после некоторого




# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10, 14, 19-21]
# КЕГЭ = []
# на следующем уроке:



