# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


'''
# Узел ести
# Маска сети

# Адрес сети = Узел ести & Маска сети

# for ip in Адрес сети:
# ip-адреса сети




# ip = 154.141.n.190  0 <= n <= 255 - диапазон восьмибитных чисел
# байт  1   1  1  1
# бит   8   8  8  8


print(bin(255)[2:])  # 11111111 - это самое большое восьмибитое число

print(bin(8)[2:])  # 1000
print(bin(8)[2:].zfill(8))  # 00001000 - восьмибитое число






# Маска сети - это число которое имеет длину 32 бита
# Важное сво-во макски ее структура: 111111...000 - сначала единицы, затем нули

# Итого мы получаем, что у нас есть 32 маски:

for mask in range(1, 32):  # - это кол-во единиц в Маске сети
    # print(mask, 32 - mask)  # кол-во единиц и кол-во нулей
    print('1' * mask + '0' * (32 - mask))
    # 10000000000000000000000000000000
    # 11000000000000000000000000000000
    # 11100000000000000000000000000000
    # 11110000000000000000000000000000
    # 11111000000000000000000000000000
    # 11111100000000000000000000000000
    # 11111110000000000000000000000000
    # 11111111000000000000000000000000
    # 11111111100000000000000000000000
    # 11111111110000000000000000000000
    # 11111111111000000000000000000000
    # 11111111111100000000000000000000
    # 11111111111110000000000000000000
    # 11111111111111000000000000000000
    # 11111111111111100000000000000000
    # 11111111111111110000000000000000
    # 11111111111111111000000000000000
    # 11111111111111111100000000000000
    # 11111111111111111110000000000000
    # 11111111111111111111000000000000
    # 11111111111111111111100000000000
    # 11111111111111111111110000000000
    # 11111111111111111111111000000000
    # 11111111111111111111111100000000
    # 11111111111111111111111110000000
    # 11111111111111111111111111000000
    # 11111111111111111111111111100000
    # 11111111111111111111111111110000
    # 11111111111111111111111111111000
    # 11111111111111111111111111111100
    # 11111111111111111111111111111110



# № 31507 Демоверсия 2027(Уровень: Базовый)
# Даны адрес узла 192.168.159.86 и маска 255.255.252.0.
# Найдите адрес сети. В ответе укажите сумму числовых значений октетов найденного IP-адреса.

# Адрес сети = Узел ести & Маска сети
# & - операция побитовой конъюкнции

# 192.168.159.86 - узел сети
# 255.255.252.0 - маска сети
print(192 & 255, 168 & 255, 159 & 252, 86 & 0)  # 192 168 156 0
print(sum([192, 168, 156, 0]))  # 516


# Решение руками
print('.'.join([bin(int(x))[2:].zfill(8) for x in '192.168.159.86'.split('.')]))
print('.'.join([bin(int(x))[2:].zfill(8) for x in '255.255.252.0'.split('.')]))
# 11000000.10101000.10011111.01010110 - узел сети
# 11111111.11111111.11111100.00000000 - маска сети
# 11000000.10101000.10011100.00000000 - Адрес сети
print([int(x, 2) for x in '11000000.10101000.10011100.00000000'.split('.')])
# [192, 168, 156, 0]
print(sum([192, 168, 156, 0]))  # 516
'''


# № 31507 Демоверсия 2027(Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('192.168.159.86/255.255.252.0', 0)  # - адрес сети
print(net)  # 192.168.156.0/22 - 22 это кол-во единиц в маске сети mask
# Если эту маску 255.255.252.0 перевести в двоичную запись, то там будет 22 единицы
print('1' * 22 + '0' * (32 - 22))  # 11111111111111111111110000000000
'''


# № 29966 Апробация 14.05.26(Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 146.180.173.153
# и сетевой маской 255.192.0.0. Найдите наибольший в данной сети IP-адрес,
# который может быть назначен компьютеру. В ответе укажите найденный IP-адрес
# без разделителей.
'''
from ipaddress import *
net = ip_network('146.180.173.153/255.192.0.0', 0)
for ip in net:
    print(ip)  # 146.191.255.254 - берем предпоследний так как последний широковещательный адрес и его брать нельзя

print(f'Укажите найденный IP-адрес без разделителей: {146191255254}')
print(f'Укажите сумму числовых значений октетов: {146 + 191 + 255 + 254}')
print(f'Укажите сумму двух первых байт: {146 + 191}')
print(f'Укажите сумму двух последних байт: {255 + 254}')
print(f'Укажите сумму первого и последнего байта: {146 + 254}')
'''

# № 31221 Резерв 22.06.26(Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 64.237.228.143 и сетевой маской 255.255.248.0.
# Найдите IP-адрес сети. В ответе укажите сумму числовых значений октетов найденного IP-адреса.
'''
from ipaddress import *
net = ip_network('64.237.228.143/255.255.248.0', 0)
for ip in net:
    print(ip)  # 64.237.224.0 - ip-адрес сети это самый первый ip-адрес
    break
'''


# № 31359 Пересдача 08.07.26(Уровень: Базовый)
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 154.141.198.190 и сетевой маской 255.255.192.0.
# Найдите её широковещательный IP-адрес. В ответе укажите сумму числовых значений октетов найденного IP-адреса.
'''
from ipaddress import *
net = ip_network('154.141.198.190/255.255.192.0', 0)
for ip in net:
    print(ip)  # 154.141.255.255 - широковещательный IP-адрес это самый последний ip-шник
print(154 + 141 + 255 + 255)
'''




# № 17867 Демоверсия 2025(Уровень: Базовый)
# Сеть задана IP-адресом 172.16.168.0 и маской сети 255.255.248.0.
# Сколько в этой сети IP-адресов, для которых количество единиц в двоичной
# записи IP-адреса не кратно 5?
'''
cnt = 0
from ipaddress import *
net = ip_network('172.16.168.0/255.255.248.0', 0)
for ip in net:
    if f'{ip:b}'.count('1') % 5 != 0:
        cnt += 1
print(cnt)  # 1663
'''


# № 12947 (Уровень: Базовый)
# Сеть, в которой содержится узел с IP-адресом 203.111.195.0, задана маской
# сети 255.255.240.0. Сколько в этой сети IP-адресов, в двоичной записи которых
# количество нулей кратно трём, а также содержатся три подряд идущие единицы
# и три подряд идущих нуля одновременно?
'''
cnt = 0
from ipaddress import *
net = ip_network('203.111.195.0/255.255.240.0', 0)
for ip in net:
    b = f'{ip:b}'
    if b.count('0') % 3 == 0:
        if '111' in b and '000' in b:
            cnt += 1
print(cnt)  # 1043
'''


# № 14360 (Уровень: Базовый)
# Для узла с IP-адресом 153.202.16.37 адрес сети равен 153.202.16.32.
# Определите наибольшее возможное значение суммы последних двух байтов маски.

from ipaddress import *
for mask in range(1, 32+1):
    net = ip_network(f'153.202.16.37/{mask}', 0)
    if '153.202.16.32' in str(net):
        print(net, net.netmask)
        # 153.202.16.32/27 255.255.255.224
        # 153.202.16.32/28 255.255.255.240
        # 153.202.16.32/29 255.255.255.248
print(255 + 248)  # 503



# № 14359 (Уровень: Базовый)
# Два узла, находящиеся в разных подсетях, имеют IP-адреса 157.127.172.56 и 157.127.191.78.
# Известно, что в масках обеих подсетей содержится одинаковое количество единиц.
# Определите наименьшее возможное количество единиц в масках этих подсетей.

RES = []
from ipaddress import *
for mask in range(1, 32+1):
    net1 = ip_network(f'157.127.172.56/{mask}', 0)
    net2 = ip_network(f'157.127.191.78/{mask}', 0)
    if net1 != net2:
        RES.append(mask)
print(min(RES))  # Наименьшее кол-во единиц


RES = []
from ipaddress import *
for mask in range(1, 32+1):
    net1 = ip_network(f'157.127.172.56/{mask}', 0)
    net2 = ip_network(f'157.127.191.78/{mask}', 0)
    if net1 != net2:
        RES.append(32 - mask)
print(min(RES))  # Наименьшее кол-во нулей




# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [10]
# КЕГЭ = []
# на следующем уроке:



