# region Домашка: ******************************************************************
'''
a = int(input())
b = int(input())
c = int(input())
print(a - b)
print(a + c)
print(a % b)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Условные операторы (ветвление): if, elif, else

'''
n = int(input('n: '))
if n % 2 == 0:  # if - если
    print('Четное число')
else:  # else - иначе
    print('Не четное число')
'''


'''
# x = int(input('x: '))
# y = int(input('y: '))
x, y = 5, 6

if x > 0 and y > 0:  # if - если
    print('Первая четверть')
elif x < 0 and y > 0:  # elif - иначе если
    print('Вторая четверть')
elif x < 0 and y < 0:
    print('Третья четверть')
elif x > 0 and y < 0:
    print('Четвертая четверть')
else:  # else - иначе
    print('Лежит на осях')
'''

# Каскадные условные операторы
'''
x = int(input('x: '))
y = int(input('y: '))
if x > 0:
    if y > 0:  # x > 0, y > 0
        print('Первая четверть')
    else:  # x > 0, y <= 0
        print('Четвертая четверть')
else:
    if y > 0:  # x <= 0, y > 0
        print('Вторая четверть')
    else:  # x <= 0, y <= 0
        print('Четвертая четверть')
'''


# Логические связки: and, or, not, in, ^, !=, ==
'''
flag = True
print(not flag)  # False
print(not(not flag))  # True


n = 5
if n % 2 == 0:  # == - равняется
    print('Четное')
elif n % 2 != 0:  # != - не равняется
    print('Нечетное')


n = '8'
if n in '02468':  # in - проверяет лежит ли элемент в наборе элементов 
    print('Четное')
elif n in '13579':
    print('Нечетное')


a, b, c = 4, -5, 6

if a > 0 and b > 0:
    print('and')  # and - Гарантирует, что все условия выполняются
if a > 0 or b > 0:
    print('or')  # or - Говорит о том, что хотя бы одно выполняется
if (a > 0) ^ (b > 0):
    print('^')  # ^ - Гарантирует, что только одно выполняется
if (a > 0) != (b > 0):
    print('!=')  # != - Гарантирует, что только одно выполянется

print(a > 0)  # True
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
