# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# № 21895 Открытый вариант 2025 (Уровень: Базовый)
'''
cnt = 0
for s in open('0. files/9.csv'):
    M = [int(x) for x in s.split(';')]
    if len(set(M)) == len(M):
        M = sorted(M)
        if M[-1] + M[-2] <= sum(M[:3]):
            cnt += 1
print(cnt)
'''


# № 21704 ЕГКР 19.04.25 (Уровень: Базовый)
'''
for s in open('0. files/9.csv'):
    M = [int(x) for x in s.split(';')]
    # if sorted(M, reverse=True) == M:
    if sorted(M)[::-1] == M:
        if (min(M) + max(M)) / 2 > sum(M[1:-1]) / 5:
            print(M, sum(M))
            break
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = [8, 9]
# на следующем уроке: {24, 26, 27}
