# region Домашка: ************************************************************
from pprint import pformat

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# № 21712 ЕГКР 19.04.25 (Уровень: Базовый)

# Определите количество троек последовательности, в которых
# ровно один элемент является четырёхзначным числом и оканчивается на 6

# а сумма элементов тройки не больше минимального положительного
# элемента последовательности, являющегося четырёхзначным числом,
# которое оканчивается на 6.
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4 and abs(x) % 10 == 6]
B = [x for x in M if len(str(abs(x))) == 4 and abs(x) % 10 == 6 and x > 0]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 1:
        if (x + y + z) <= min(B):
            R.append(x + y + z)
print(len(R), max(R))
'''


# № 21416 Досрочная волна 2025 (Уровень: Базовый)

# в которых произведение максимального и минимального элементов тройки
# больше суммы всех отрицательных элементов последовательности.
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if x < 0]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if max(x, y, z) * min(x, y, z) > sum(A):
        R.append(x + y + z)
print(len(R), max(R))
'''


# № 19249 ЕГКР 21.12.24 (Уровень: Базовый)

# в которых хотя бы один элемент является
# пятизначным числом и оканчивается на 43

# а сумма квадратов элементов тройки не больше квадрата
# максимального элемента последовательности,
# являющегося пятизначным числом и оканчивающегося на 43.
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5 and str(x)[-2:] == '43']
A = [x for x in M if len(str(abs(x))) == 5 and abs(x) % 100 == 43]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) >= 1:
        if (x**2 + y**2 + z**2) <= max(A) ** 2:
            R.append(x**2 + y**2 + z**2)
print(len(R), min(R))
'''
M = [int(x) for x in open('0. files/17.txt')]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x % 16 == min(M)) or (y % 16 == min(M)):
        R.append(x + y)
print(len(R))


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 8 {22, 24, 26, 27}
