# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

#
# № 17862 Демоверсия 2025 (Уровень: Базовый)
#
# Определите количество 12-ричных пятизначных чисел,
# в записи которых ровно одна цифра 7 и не более трёх цифр
# с числовым значением, превышающим 8.
'''
from itertools import *
cnt = 0
for p in product('0123456789AB', repeat=5):
    num = ''.join(p)
    if num[0] != '0':
        if num.count('7') == 1:
            D = [x for x in num if x > '8']
            if len(D) <= 3:
                cnt += 1
print(cnt)
'''
from macholib.mach_o import rpath_command

# № 11660 (Уровень: Базовый)
'''
symbols = 35
alphabet = 4090 + 10  # colors = 2 ** i
print(2**13)
i = 13  # бит на один символ
bit = symbols * i

print(bit / 8)  # 56.875
byte = 57


# user = password + dop
user = 96000 / 300
# password == byte
dop = user - byte
print(dop)  # 263.0
'''


# № 11832 (Уровень: Базовый)

symbols = 16
alphabet = 26 * 2 + 10
print(alphabet)
i = 6

bit = symbols * i
print(bit / 8)  # 12.0
byte = 12

dop = 20

disk = 10 * 2 ** 10  # байт

users = disk /  (dop + byte)
print(users)


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:
