# region Домашка: ************************************************************

# Напишите программу, которая принимает три числа и выполняет следующее действие:
# считает и выводит сумму только тех чисел, которые кратны 7, но не кратны 49 или являются кратными 40.
'''
a = int(input())
b = int(input())
c = int(input())
summa = 0
if (a % 7 == 0 and a % 49 != 0) or (a % 40 == 0):
    summa += a
if (b % 7 == 0 and b % 49 != 0) or (b % 40 == 0):
    summa += b
if (c % 7 == 0 and c % 49 != 0) or (c % 40 == 0):
    summa += c
print(summa)


a = int(input())
b = int(input())
c = int(input())
summa = 0
for x in (a, b, c):
    if (x % 7 == 0 and x % 49 != 0) or (x % 40 == 0):
        summa += x
print(summa)
'''

a = int(input())
b = int(input())
c = int(input())
x = int(input())
if x in (a, b, c):
    print('Да')
else:
    print('Нет')


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
