# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


'''
from ipaddress import *
net = ip_network('123.222.111.192/255.255.255.248', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s[24:].count('0') % 3 != 0:
        cnt += 1
print(cnt)

# s[0:32] s[:8] s[8:16] s[16:24] s[24:]
'''


# № 21747 (Уровень: Базовый)
#  Для узла с IP адресом 84.23.84.23 адрес сети равен 84.23.84.0.
#  Чему равно наибольшее значение суммы третьего и четвёртого слева байтов маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'84.23.84.23/{mask}', 0)
    if '84.23.84.0' in str(net):
        print(net, net.netmask)
'''

'''
def F(a, b):
    if a < b or a == 24:
        return 0
    if a == b:
        return 1
    else:
        return F(a-2, b) + F(a-3, b) + F(a//4, b)


print(F(36, 13))
'''


def F(a, b):
    if a > b or a == 8:
        return 0
    if a == b:
        return 1
    else:
        return F(a+1, b) + F(a+2, b) + F(a*2, b)


print(F(3, 14) * F(14, 18))

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = [8, 9]
# на следующем уроке: 7, 11
