# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (z <= x) and ((not y) and ((not w) == y))
                print(x, y, z, w, int(F))
'''

'''
print((28 * 13) + (84 * 78) - (24 * 7))

import turtle as t
t.left(90)  # поворот головы по оси y вверх из условия
t.tracer(0)  # отключение анимации отрисовки, то есть мгновенное рисование
t.screensize(-2000, 2000)  # регулирование окна отрисовки (ползунки)
size = 20  # наша переменная для регулирования масштаба


# Тут пишется псевдокод:
for i in range(3):
    t.forward(27 * size)  # 28 * 13 = 364
    t.right(90)
    t.forward(12 * size)
    t.right(90)

t.up()  # Поднять хвост
t.forward(4 * size)
t.right(90)
t.forward(6 * size)
t.left(90)

t.down()  # Опустить хвост
for _ in range(4):
    t.fd(83 * size)  # 84 * 78 = 6468
    t.rt(90)
    t.fd(77 * size)
    t.rt(90)

# Тут перебираем координаты:
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * size, y * size)  # Прыгаем в определенную координату
        t.dot(3, 'red')  # Рисуем точку толщиной 3 и цвет 'red'

t.update()  # Для корректной работы t.tracer(0)
t.done()  # Фиксация окна отрисовки
'''


import turtle as t
t.left(90)
t.tracer(0)
t.screensize(-2000, 2000)
size = 20

for i in range(9):
    t.fd(27*size)
    t.rt(90)
    t.fd(30*size)
    t.rt(90)
t.up()
t.fd(3*size)
t.rt(90)
t.fd(6*size)
t.lt(90)
t.down()
for i in range(9):
    t.fd(77 * size)
    t.rt(90)
    t.fd(66 * size)
    t.rt(90)
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * size, y * size)  # Прыгаем в определенную координату
        t.dot(3, 'red')  # Рисуем точку толщиной 3 и цвет 'red'

t.update()  # Для корректной работы t.tracer(0)
t.done()



# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 6, 14, 15, 17
