# region Домашка: ************************************************************

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# № 11946 (Уровень: Средний)
'''
cnt = 0
for s in open('0. files/9.csv'):
    k = 0
    M = [int(x) for x in s.split(';')]
    pov = [x for x in M if M.count(x) == 3]
    pazl = [x for x in M if M.count(x) == 1]
    if len(pov) == 3 and len(pazl) == 4:
        k += 1
    if sorted(M) == M:
        k += 1
    if k <= 1:
        cnt += 1

print(cnt)
'''

def F(s, n):
  if s >= 67:
    return n % 2 == 0
  if n == 0:
    return 0
  h = [F(s+1, n-1), F(s+4, n-1), F(s*3, n-1)]
  return any(h) if (n-1) % 2 == 0 else all(h)
print([s for s in range(1, 67) if F(s, 2)])
print([s for s in range(1, 67) if F(s, 3) and not F(s, 1)])
print([s for s in range(1, 67) if F(s, 4) and not F(s, 2)])



# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = [8, 9]
# на следующем уроке: {24, 26, 27}
