# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# Тип 5 №14767
'''
for n in range(1000, 9999+1):
    a, b, c, d = [int(i) for i in str(n)]
    M = sorted([a + b, b + c, c + d])
    if str(M[1]) + str(M[2]) == '613':
        print(n)
        break
'''


# Тип 5 №16381

# n = 13
# s = f'{n:b}'  # s = bin(n)[2:]
# s = s[:-1]
# if n % 2 != 0:
#     s = s + '10'
# else:
#     s += '01'
# r = int(s, 2)
# print(r)
'''
R = []
for n in range(2, 10000):
    s = f'{n:b}'  # s = bin(n)[2:]
    s = s[:-1]
    if n % 2 != 0:
        s = s + '10'
    else:
        s += '01'
    r = int(s, 2)
    if r == 2018:
        R.append(n)

print(max(R))
'''


# Тип 5 №27291
'''
R = []
for n in range(1, 1000):
    s = f'{n:b}'
    for i in range(2):
        s = s + str(s.count('1') % 2)
    r = int(s, 2)
    if r < 90:
        R.append(r)

print(max(R))
'''


# Тип 5 №17370
'''
R = []
for n in range(100, 3000+1):
    s = bin(n)[2:]
    s = s[1:]
    r = int(s, 2)
    res = n - r
    R.append(res)

print(len(set(R)))
'''


# Тип 5 №16809
'''
for n in range(0, 255+1):
    s = f'{n:b}'.zfill(8)
    s = s.replace('0', '*').replace('1', '0').replace('*', '1')
    r = int(s, 2)
    res = r - n
    if res == 133:
        print(n)
'''



# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12]
# КЕГЭ = []
# на следующем уроке:
