# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# КЕГЭ № 17630 Основная волна 19.06.24 (Уровень: Средний)
'''
# sym - ?
alp = 10 + 26 + 450
i = 9  # 2 ** 9 >= 486
# bit = sym * i

byte708 = 213 * 2 ** 10
byte = byte708 / 708
print(byte)  # 308.06779
byte = 309  # так как отведено БОЛЕЕ

bit = byte * 8
sym = bit / i
print(sym)  # 274.666
'''
# В ответе запишите только целое число.
# Ответ: 274


# КЕГЭ № 17524 Основная волна 07.06.24 (Уровень: Средний)
'''
# sym - ?
alp = 10 + 52 + 458  # 520
i = 10  # 2 ** 10 >= 520
# bit = sym * i

byte862 = 276 * 2 ** 10
byte = byte862 / 862
print(byte)  # 327.8700 -> 327
byte = 327

bit = byte * 8
sym = bit / i
print(sym)  # 261.6
'''
# Ответ: 261


# № 20805 Апробация 05.03.25 (Уровень: Средний)
'''
sym = 248
# alp - ?
# i - ?

# bit = sym * i

byte_75_600 = 16 * 2 ** 20  # байт
byte = byte_75_600 / 75_600
print(byte)  # 221.9208 -> 222 так как у нас БОЛЕЕ
byte = 222

bit = 222 * 8
i = bit / sym
print(i)  # 7.161 -> 8 бит на один символ

print(2 ** 7)  # [65:128]
print(2 ** 8)  # [129:256]
'''
# Минимально возможную мощность алфавита
# Ответ: 129


# № 20904 Апробация 05.03.25
'''
def convert(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]
'''

'''
def convert(n, b):
    r = ''
    while n > 0:
        r = str(n % b) + r
        n //= b
    return r

for x in range(1, 2030+1):
    n = 3**100 - x
    s = convert(n, 3)
    if s.count('0') == 1:
        print(x)
'''
# Ответ: 1823


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 6, 14, 15, 17
