# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# Тип 14 №45248
'''
n = 7*512**1912 + 6*64**1954 - 5*8**1991 - 4*8**1980 - 2022
print(oct(n)[2:].count('7'))
'''


# Тип 14 №23914
'''
n = 9**11 * 3**20 - 3**9 - 27
b = 3
R = []
while n > 0:
    R.append(n % b)
    n //= b
R = R[::-1]
print(R.count(2))
'''


# № 17633 Основная волна 19.06.24 (Уровень: Базовый)
'''
for x in range(2030+1):
    n = 6 ** 260 + 6 ** 160 + 6**60 - x
    b = 6
    R = []
    while n > 0:
        R.append(n % b)
        n //= b
    R = R[::-1]
    if R.count(0) == 202:
        print(x)
        break
'''

#
# № 17555 Основная волна 08.06.24 (Уровень: Базовый)
'''
for x in range(2031):
    n = 7**91 + 7**160 - x
    osn = 7
    spis = []
    while n > 0:
        spis.append(n % osn)
        n = n // osn
    spis.reverse()
    if spis.count(0) == 70:
        print(x)
'''

alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:13]:
    for y in alphabet[:13]:
        A = int(f'8{x}78{y}', 13)
        B = int(f'79{x}{y}7', 18)
        if (A + B) % 9 == 0:
            print((A + B) // 9)


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14]
# КЕГЭ = []
# на следующем уроке:
