# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# 19722 (Уровень: Базовый)
'''
from fnmatch import *
for x in range(12602, 10**10, 12602):  #  делящиеся на 12602 без остатка.
    if fnmatch(str(x), '*45?49*24'):
        print(x)
'''


# № 19723 (Уровень: Базовый)
'''
def divisors(x):
    div = []
    # for j in range(1, int(x ** 0.5)+1):
    for j in range(2, int(x ** 0.5)+1):  # не считая единицы и самого числа.
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


cnt = 0
for x in range(500_000+1, 10**10):
    d = divisors(x)
    if len(d) > 0:
        R = sum(d)
        if R % 10 == 9:
            print(x, R)
            cnt += 1
            if cnt == 5:
                break
'''

# № 19778 (Уровень: Средний)
'''
def D(x):
    div = []
    for j in range(2, int(x ** 0.5)+1):  #  не считая самого числа.
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


cnt = 0
for x in range(9_500_000+1, 10**10):
    d = [j for j in D(x) if len(D(j)) == 0]
    if len(d) > 0:
        F = sum(d) // len(d)  # среднего арифметического
        if F != 0 and F % 813 == 0:
            print(x, F)
            cnt += 1
            if cnt == 5:
                break
'''

'''
# Нашли все простые числа
print([x for x in range(2, 100) if len(divisors(x)) == 0])
# [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

# Нашли все составные числа
print([x for x in range(2, 100) if len(divisors(x)) != 0])
# [4, 6, 8, 9, 10, 12, 14, 15, 16, 18, 20, 21, 22, 24, 25, 26, 27, 28, 30, 32, 33, 34, 35, 36, 38, 39, 40, 42, 44, 45, 46, 48, 49, 50, 51, 52, 54, 55, 56, 57, 58, 60, 62, 63, 64, 65, 66, 68, 69, 70, 72, 74, 75, 76, 77, 78, 80, 81, 82, 84, 85, 86, 87, 88, 90, 91, 92, 93, 94, 95, 96, 98, 99]
'''


# № 19776 (Уровень: Средний)
'''
def D(x):
    div = []
    for j in range(2, int(x ** 0.5)+1):
        if x % j == 0:
            div.append(j)
            div.append(x // j)
    return sorted(set(div))


cnt = 0
for x in range(23_600_000+1, 10**10):
    d = [j for j in D(x) if len(D(j)) == 0]
    if len(d) > 0:
        # M = d[0] + d[-1]
        M = min(d) + max(d)
        if M % 213 == 171:  # значение M при делении на 213 даёт в остатке 171
            print(x, M)
            cnt += 1
            if cnt == 6:
                break
'''



# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 17, 23
