# region Домашка: ************************************************************
from pprint import pformat

# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# № 13088 (Уровень: Средний)
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in M if str(x)[-2:] == '17']
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x % 5 == 0) + (y % 5 == 0) + (z % 5 == 0) >= 1:
        if (x in A) + (y  in A) + (z in A) == 2:
            if (x + y + z) > max(B):
                R.append(x + y + z)
print(len(R), max(R))
'''



# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = []
# на следующем уроке: 8 {22, 24, 26, 27}
