# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

'''
s = sorted('98127849817234')
# Функция sorted() сортирует любой итерируемый объект (списки, строки, кортежи, словари),
# но в качестве результата возвращает отсортированный список
'''

# Тип 8 №3700
# Все 5-буквенные слова, составленные из букв Б, К, Ф, Ц, записаны
# в алфавитном порядке и пронумерованы. Вот начало списка:
# 1. БББББ
# 2. ББББК
# 3. ББББФ
# 4. ББББЦ
# 5. БББКБ
#
# Запишите слово, которое стоит на 486-м месте от начала списка.

# Вариант 1
'''
s = sorted('БКФЦ')
print(s)  # ['Б', 'К', 'Ф', 'Ц']
n = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    slovo = a + b + c + d + e
                    n += 1
                    if n == 486:
                        print(n, slovo)
'''

# Вариант 2
'''
from itertools import *
n = 0
for p in product(sorted('БКФЦ'), repeat=5):
    slovo = ''.join(p)
    n += 1
    if n == 486:
        print(n, slovo)
'''


# Вариант 3
'''
from itertools import *
for n, p in enumerate(product(sorted('БКФЦ'), repeat=5), 1):
    slovo = ''.join(p)
    if n == 486:
        print(n, slovo)
'''


# Способы подключения библиотек
'''
# ctrl + B: Наведись и получи инфу про библиотеку 

import math  # - Самый простой способ, везде нужно таскать math.
print(math.sqrt(16))

import math as m  # - Переименовали библиотеку math в просто m
print(m.sqrt(16))

from math import sqrt, pow, gcd  # Подключили конкретные функции из библиотеки
print(sqrt(16))

from math import *  # Подключаем сразу все содержимое библиотеки
print(sqrt(16))
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6, 8, 12]
# КЕГЭ = []
# на следующем уроке:
