# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

# Единицы измерения информации
# 1 бит - минимальная единица измерения 1010.1010 - 8 бит информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# V - вес картинки в бит
# V = pixels * i, где i это кол-во бит на один пиксель
# colors = 2 ** i

# V = a (шт) * b (Гц) * c (бит) * t (сек)


'''

# № 20365 (Уровень: Средний)# № 20425 (Уровень: Средний)
# '''
# pixels = 3840 * 2160
# # colors - ?
# # 60 фоток за 1 секунду видео
# count_photos = 90 * 60  # фотографий
#
# a = 2  # кол-во каналов
# b = 48000  # Гц
# c = 16
# t = 90
# V_music = a * b * c * t
#
# V_all = 54691875 * 2 ** 13  # бит
#
# V_photos = V_all - V_music
# V_photo = V_photos / count_photos
# i = V_photo / pixels  # 10.0
# colors = 2 ** i
# print(colors)  # 1024 - цветов
'''
a = 4
b = 48000
c = 24
t = 70
V_music = a * b * c * t

pixels = 1920 * 1080
print(2**24, 16777216)
i = 24
V_photo = pixels * i
count_photos = 30 * t
V_photos = V_photo * count_photos

V_all = V_photos + V_music
V_disk = 1 * 2**43  # бит
print(V_disk / V_all)  # 83.9065
'''
# Ответ: 83


# № 20363 (Уровень: Средний)
'''
V_disk = 3123 * 2 ** 23

pixels = 1920 * 1080
i = 16
V_photo = pixels * i

a = 2
b = 44000
c = 16

t = V_disk / (V_photo * 20 + (a * b * c))
print(t)
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:
