# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


#
# № 19240 ЕГКР 21.12.24 (Уровень: Базовый)
'''
from itertools import *
n = 0
for p in product(sorted('ЯНВАРЬ'), repeat=5):
    word = ''.join(p)
    n += 1
    if word[0] != 'Я' and word.count('Ь') <= 1:
        if 'ЯЯ' not in word:
            print(n)
'''

# № 18923 Новогодний вариант 2025 (Уровень: Базовый)
'''
from itertools import *
cnt = 0
for p in product('ВЬЮГА', repeat=6):
    word = ''.join(p)
    if 'ЮГ' in word:
        cnt += 1
print(cnt)
'''
# 2976


# № 18260 (Уровень: Базовый)
'''
from itertools import *
cnt = 0
for p in product('0123456789AB', repeat=6):
    num = ''.join(p)
    if num[0] != '0':
        if num.count('B') == 1:
            chet = [x for x in num if x in '02468A']
            nechet = [x for x in num if x in '13579B']
            if len(chet) == len(nechet):
                print(num)
                cnt += 1
print(cnt)
'''


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 14, 15]
# КЕГЭ = []
# на следующем уроке: 9, 12, 23, 25, 26/27


# Первый пробник 7.03.25:
# Лев 8/46 -> _ вторичных баллов +[2, 5, 15, 16, 19, 20, 23, 25] -[8, 9, 12, 21]
