# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************

'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = w and ((y <= x) <= z)
                print(x, y, z, w, int(F))
'''

'''
def F(x, y, A):
    return (5 < y) or (x > 32) or (x + 2*y < A)


for A in range(1, 10000):
    if all(F(x, y, A) for x in range(1, 300) for y in range(1, 300)):
        print(A)
'''

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 14, 15, 19-21, 23]
# КЕГЭ = []
# на следующем уроке: 12, 25, 26/27


# Первый пробник 7.03.25:
# Лев 8/46 -> _ вторичных баллов +[2, 5, 15, 16, 19, 20, 23, 25] -[8, 9, 12, 21]
