# region Домашка: ************************************************************


# endregion Домашка: ************************************************************
# #
# #
# region Урок: ************************************************************


# № 21903 Открытый вариант 2025 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
# A = [x for x in M if len(str(abs(x))) == 3 and str(x)[-2:] == '15']
A = [x for x in M if len(str(abs(x))) == 3 and abs(x) % 100 == 15]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x > 0 and y > 0 and z > 0) or (x < 0 and y < 0 and z < 0):
        if min(x, y, z) * max(x, y, z) > min(A) ** 2:
            R.append(min(x, y, z) * max(x, y, z))
print(len(R), min(R))
'''
# 3507 863808



# № 21712 ЕГКР 19.04.25 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4 and abs(x) % 10 == 6]
B = [x for x in A if x > 0]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 1:
        if (x + y + z) <= min(B):
            R.append(x + y + z)
print(len(R), max(R))
'''


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 14, 15, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 26/27


# Первый пробник 7.03.25:
# Лев 8/46 -> _ вторичных баллов +[2, 5, 15, 16, 19, 20, 23, 25] -[8, 9, 12, 21]
