# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации:
# 1 бит - Минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# большее всегда делится на меньшее
# все измерения лучше производить в бит

# v = pixels * i, где i - это бит на один пиксель
# colors = 2 ** i


# v = a * b * c * t
#   кол-во каналов * частоту * глубину кодирования * время

# https://education.yandex.ru/ege/task/5b2df675-96d3-460d-b1ed-e3dfb6ed7c63
'''
pixels = 2560 * 1440
v = 2**33 / 200
i = v / pixels
print(i)  # 11.650
print(2 ** 11)
'''


# https://education.yandex.ru/ege/task/ceddc23d-72f7-4523-87fc-761db29eff27
'''
pixels = 640 * 860
v = 500 * 2 ** 13  # бит
v = v * 1.23
print(v / pixels)  # 9.15348
'''


# https://education.yandex.ru/ege/task/26133fed-3f76-4e26-9b4a-a96c4160e69c
'''
pixels = 1536 * 1024
count = 6
v6 = 9 * 2**23
v = v6 / 6
i = v / pixels
print(i)
'''


# https://education.yandex.ru/ege/task/ce57772b-890f-46fc-814d-c8818d3e67ca
'''
a = 4
b = 48000
c = 16
t = 3 * 60  # сек
v = a * b * c * t
T = v / 3200
print(T / 3600)  # 48
'''

# https://education.yandex.ru/ege/task/97232e31-d97b-4f20-badf-1c38458126c4
'''
a = 2
b = 48000
# 1024 уровнями квантования.
c = 10  # 2 ** 10 = 1024


u = 256000
T = 18 * 60
v = T * u  # сжатый
v = (v / 60) * 100  # вес не сжатого
t = v / (a * b * c)
print(t / 60)
'''

print((48 * 1.5) / 3 )
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Лиза 11/29 -> 54 вторичных баллов +[1-2, 4, 5, 10, 12-14, 16, 23, 25] -[3, 6, 8]

# Второй пробник 28.02.25:
# Лиза 17/29 -> 70 вторичных баллов +[1-17, 23, 25] -[]
