# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации:
# 1 бит - Минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# https://education.yandex.ru/ege/task/221f688c-b7dd-4fd8-b384-f8c245b17f14
'''
sym = 23
alp = 12  # colors = 2 ** i
i = 4  # 2 ** i >= 12, i - это бит выделяется на один символ

bit = sym * i  # вес одного пароля в бит
print(bit / 8)  # 11.5
byte = 12  # вес одного пароля в байт


# user = byte +
user = 13068 / 297
print(user - byte)  # 32.0
'''
# pin
# sym = 4
# alp = 10


# https://education.yandex.ru/ege/task/f2ae72ec-dd45-47c0-996a-69d1b524b2e9
'''
sym1 = 10
alp1 = 26
i1 = 5
bit1 = sym1 * i1


sym2 = 10
alp2 = 10
i2 = 4
bit2 = sym2 * i2

bit = bit1 + bit2
print(bit / 8)  # 11.25
byte = 12

user = 600 / 20
print(user - byte)  # 18.0
'''


# https://education.yandex.ru/ege/task/298579d9-a483-4edc-8be5-167e3464430f

# sym - ?
alp = 10 + 26 + 26
i = 6

byte = 10 * 2**13 / 1000
print(byte)  # 10.24
byte = 10

bit = byte * 8
sym = bit / i
print(sym)  # 13.33





# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Лиза 11/29 -> 54 вторичных баллов +[1-2, 4, 5, 10, 12-14, 16, 23, 25] -[3, 6, 8]

# Второй пробник 28.02.25:
# Лиза 17/29 -> 70 вторичных баллов +[1-17, 23, 25] -[]
