# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 17558 Основная волна 08.06.24 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
krat = [x for x in M if abs(x) % 32 == 0]
A = []
for i in range(len(M) - 1):
    x, y = M[i], M[i + 1]
    if (x < 0) + (y < 0) >= 1:
        if (x + y) < len(krat):
            A.append(x + y)
print(len(A), max(A))
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Лиза 11/29 -> 54 вторичных баллов +[1-2, 4, 5, 10, 12-14, 16, 23, 25] -[3, 6, 8]

# Второй пробник 28.02.25:
# Лиза 17/29 -> 70 вторичных баллов +[1-17, 23, 25] -[]
