# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************
'''
from string import punctuation

s = open('0. files/9.txt').read()
p = '!"#$%&()*+,./:;<=>?@[]^_`{|}~'
for x in p:
    s = s.replace(x, ' ')

cnt = 0
for x in s.split():
    if x == 'как':
        cnt += 1
print(cnt)
'''


# Определите минимальное время, через которое завершится
# выполнение всей совокупности процессов


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 24, 26, 27


# Первый пробник 21.12.24:
# Лиза 11/29 -> 54 вторичных баллов +[1-2, 4, 5, 10, 12-14, 16, 23, 25] -[3, 6, 8]

# Второй пробник 28.02.25:
# Лиза 17/29 -> 70 вторичных баллов +[1-17, 23, 25] -[]
