





# - это однострочный комментарий

"""
- это многострочный комментарий
"""


# x = 5  # - переменная это удобный способо взаимодействия с данными
#
# name = 'Илья'
# age = 24
# print(f'Имя пользователя: {name}, а возраст: {age}')


# Типы данных переменных
'''
a = 5  # int (integer) - целочисленные значения
print(a, type(a))  # 5 <class 'int'>


b = 5.0  # float (число с плавающей точкой) - вещественные значения (дроби)
print(4 / 2, type(4 / 2))  # 2.0 <class 'float'>


c = '5'  # str (string) - это стороковый тип данных для хранения текста и символов
print(a, c)  # 5 5
print(a * 4, c * 4)  # 20 5555

print('Hello ' * 4)  # Hello Hello Hello Hello - при умножении строки на целое число строка дублируется

c1 = 'Hello, '
c2 = 'world!'
c = c1 + c2  # - операция конкатенации строк (склеивание)
print(c)  # Hello, world!

print('7' + '3' * 5)  # 733333

print('4' * 3 + '3' + '6' * 2)  # 444366


d1 = True  # bool (Boolean) - основы Булевой алгебры | математическая логика
d0 = False
print(4 < 10)  # True
print(4 == 10)  # False 
print(4 != 4)  # False 

# = - присваивание данных к новой переменной 
# == - сравниваю два значения (равны ли)
# != - сравниваю два значения (не равны ли)
'''


# Конвертация типов данных
'''
a = 5
print(type(a), a)  # <class 'int'> 5

a = str(a)
print(type(a), a)  # <class 'str'> 5

a = float(a)
print(type(a), a)  # <class 'float'> 5.0

a = int(a)
print(type(a), a)  # <class 'int'> 5
'''


# Ввод данных с клавиатуры input()
'''
name = input('Введите имя: ')
age = int(input('Введите возраст: '))
# ValueError: invalid literal for int() with base 10: 'гушкрпушкгрп'
# ValueError: invalid literal for int() with base 10: '5.0'
if age >= 18:
    print(f'Имя пользователя: {name}, а возраст: {age} - доступ открыт.')
else:
    print(f'Имя пользователя: {name}, а возраст: {age} - доступ закрыт.')
'''


# Работа с f-строкой
'''
# Имя пользователя: name, а возраст: age - доступ открыт.

name = input('Введите имя: ')
age = int(input('Введите возраст: '))

print('Имя пользователя: ', name, ', а возраст: ', age, ' - доступ открыт.')
print('Имя пользователя: ' + name + ', а возраст: ' + str(age) + ' - доступ открыт.')
print('Имя пользователя: {}, а возраст: {} - доступ открыт.'.format(name, age))

print(f'Имя пользователя: {name}, а возраст: {age} - доступ открыт.')  # python >= 3.9
'''



# Базовая арифметика
'''
a, b = 7, 2

print(f'{a} + {b} = {a + b} \n'
      f'{a} - {b} = {a - b} \n'
      f'{a} * {b} = {a * b}')

print()  # В каждой функции print() есть переход на новую строку /n


# Три вида деления в программировании:

a, b = 7, 2
print(f'{a} / {b} = {a / b}')  # 3.5 - обыкновенное вещественное деление (результат float)
print(f'{a} // {b} = {a // b}')  # 3 - взятие только целой части от деления (результат int)
print(f'{a} % {b} = {a % b}')  # 1 - взятие остатка от деления (результат int)


n = 435
print(n / 10)  # 43.5
print(n // 10)  # 43
print(n % 10)  # 5 - берет последнюю цифру

print(n // 100)  # 4
print(n % 100)  # 35 - берет две последние цифры


n = int(input('n: '))
if n % 2 == 0:
    print('Четное | Делится на 2 | Кратно 2')
if n % 2 != 0:
    print('Нечетное | Не делится на 2 | Не кратно 2')

if n % 5 == 0:
    print('Число делитсян на 5 | кратно 5')



print(f'Возведем число 2 в степень 5: {2 ** 5}')  # 32

print(f'Взять квадратный корень от числа 16: {16 ** (1/2)}')
print(f'Взять кубический корень от числа 26: {27 ** (1/3)}')
'''



# Напишите программу, которая запрашивает у пользователя три числа и выводит следующие
# арифметические операции: разность первого и второго чисел, сумму первого и третьего
# числа, остаток от деления первого числа на второе.
# Результаты каждой операции должны быть выведены на экран, каждое на отдельной строке.








# todo На следующем уроке: проговорить типы данных коллекций












