



# № 31511 Демоверсия 2027(Уровень: Базовый)
# Операнды арифметического выражения записаны в системе счисления с основанием 22.
# 27x98876_22 + 26x51_22 + 711x5_22
#
# В записи чисел переменной x обозначена неизвестная цифра из алфавита 22-ричной системы счисления.
# Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 21.
# Для найденного x вычислите частное от деления значения арифметического выражения на 21
# и укажите его в ответе в десятичной системе счисления.

alp = sorted("0123456789QWERTYUIOPASDFGHJKLZXCVBNM")
for x in alp[:9]:
    for y in alp[:9]:
        A = int(f"2{y}66{x}", 9)
        B = int(f"{x}0{y}1", 12)
        if (A + B) % 170 == 0:
            print((A + B) // 170)
