# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# 	№ 25353 ЕГКР 13.12.25(Уровень: Базовый)
# Значение арифметического выражения
# 3⋅27**9 + 2⋅27**6+27 **3−x, где х - целое положительное число,
# не превышающее 27 000, записали в 27-ричной системе счисления.
# Определите наименьшее значение х, при котором в 27-ричной записи
# числа, являющегося значением данного арифметического выражения,
# содержится ровно 6 нулей.
'''
for x in range(1, 27001):
    num = 3*27**9 + 2*27**6+ 27**3 - x
    count = 0
    while num > 0:
        if num % 27 == 0:
            count += 1
        num //= 27
    if count == 6:
        print(x)
        break
'''


# № 21703 ЕГКР 19.04.25(Уровень: Базовый)
# Все шестибуквенные слова, в составе которых могут быть только
# буквы П, О, Б, Е, Д, А, записаны в алфавитном порядке и пронумерованы
# начиная с 1. Ниже приведено начало списка.
# 1. AAAAAA
# 2. АААААБ
# 3. АААААД
# 4. AAAAAE
# 5. АААААО
# 6. АААААП
# ...
# Определите последний чётный номер слова, которое начинается
# с буквы О и в котором каждая буква встречается ровно один раз.
'''
n = 0
s = sorted('ПОБЕДА')
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        word = a + b + c + d + e + f
                        n += 1
                        if n % 2 == 0:
                            if word[0] == 'О':
                                if len(word) == len(set(word)):
                                    print(n)

n = 0
from itertools import product
for p in product(sorted('ПОБЕДА'), repeat=6):
    word = ''.join(p)
    n += 1
    if n % 2 == 0:
        if word[0] == 'О':
            if len(word) == len(set(word)):
                print(n)
'''


# № 20954 (Уровень: Базовый)
'''
n = 0
from itertools import product
for p in product(sorted('МАКС'), repeat=6):
    word = ''.join(p)
    n += 1
    if 'С' not in word:
        if 'М' not in word:
            if 'КК' not in word:
                print(n)
'''

# № 21407 Досрочная волна 2025(Уровень: Базовый)
# Виктор составляет таблицу кодовых слов для передачи сообщений,
# каждому сообщению соответствует своё кодовое слово. В качестве
# кодовых слов Виктор использует 5-буквенные слова, в которых могут
# быть только буквы Д, Г, И, А, Ш, Э, причём слово не должно начинаться
# с гласной и не должно заканчиваться согласной. Сколько различных
# кодовых слов может использовать Виктор?

cnt = 0
from itertools import product
for p in product('ДГИАШЭ', repeat=5):
    word = ''.join(p)
    if word[0] not in 'АИЭ':
        if word[-1] in 'АИЭ':
            cnt += 1
print(cnt)



# № 14412 (Уровень: Базовый)
# (Л. Шастин) Вася составляет 6-буквенные слова, в которых могут
# быть использованы только буквы А, Л, Г, О, Р, И, Т, М, причём
# буква Л используется не более одного раза. Каждая из других допустимых
# букв может встречаться в слове любое количество раз или не встречаться совсем.
# Слово не должно начинаться с буквы Р и оканчиваться согласными буквами.
# Словом считается любая допустимая последовательность букв, не обязательно
# осмысленная. Сколько существует таких слов, которые может написать Вася?
'''
cnt = 0
from itertools import product
for p in product('АЛГОРИТМ', repeat=6):
    word = ''.join(p)
    if word.count('Л') <= 1:
        if word[0] != 'Р':
            if word[-1] not in 'ЛГРТМ':
                cnt += 1
print(cnt)
'''

# № 14413 (Уровень: Базовый)
# (Л. Шастин) Леонид составляет коды перестановкой букв слова СОРТИРОВКА.
# При этом в кодах никакие три согласные или три гласные буквы не должны
# стоять рядом. Сколько различных кодов может составить Леонид?
'''
from itertools import permutations
RES = []
for p in permutations('СОРТИРОВКА'):
    word = ''.join(p)
    slovo = word
    for x in 'ОИА':
        word = word.replace(x, 'А')
    for x in 'СРТВК':
        word = word.replace(x, 'В')
    if 'ААА' not in word and 'ВВВ' not in word:
        RES.append(slovo)
print(len(set(RES)))  # 185760
'''

# № 12917 PRO100 ЕГЭ 26.01.24(Уровень: Базовый)
# Петя составляет слова путём перестановки букв в слове ПРОСТО.
# Сколько он сможет составить слов, если запрещено ставить рядом две одинаковые буквы?
'''
RES = []
from itertools import permutations
for p in permutations('ПРОСТО'):
    word = ''.join(p)
    if 'ОО' not in word:
        RES.append(word)
print(len(set(RES)))
'''



# № 20898 Апробация 05.03.25(Уровень: Базовый)
# Определите количество девятеричных пятизначных чисел,
# в записи которых ровно одна цифра 0, при этом никакая
# нечётная цифра не стоит рядом с цифрой 0.
'''
from itertools import product
cnt = 0
for p in product('012345678', repeat=5):
    num = ''.join(p)
    if num[0] != '0':
        if num.count('0') == 1:
            for x in '1357':
                num = num.replace(x, '*')
            if '*0' not in num and '0*' not in num:
                cnt += 1
print(cnt)
'''


# № 17862 Демоверсия 2025(Уровень: Базовый)
# Определите количество 12-ричных пятизначных чисел, в записи которых ровно одна цифра 7 и не более трёх цифр с числовым значением, превышающим 8.










# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [5, 8, 13, 14, 18]
# КЕГЭ = []
# на следующем уроке:

