# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Встроенные функции перевода
'''
n = 1000
print(bin(n))  # 0b1111101000 - Перевод в двоичную систему счисления
print(bin(n)[2:])  # 1111101000 - Перевод в двоичную систему счисления
print(oct(n)[2:])  # 1750 - Перевод в восьмеричную систему счисления
print(hex(n)[2:])  # 3e8 - Перевод в 16-ю систему счисления

print(f'{n:b}') # 1111101000

print(f'Способ перевода в двоичную систему: {n:b}')  # 1111101000
print(f'Способ перевода в двоичную систему: {n:o}')  # 1750
print(f'Способ перевода в двоичную систему: {n:x}')  # 3e8
'''


# № 31502 Демоверсия 2027(Уровень: Базовый)
'''
RES = []
for n in range(1, 10000):
    # n2 = bin(n)[2:]
    n2 = f'{n:b}'
    if n % 2 == 0:
        n2 = '11' + n2 + '11'
    else:
        n2 = '1' + n2 + '00'
    r = int(n2, 2)
    if r > 95:
        RES.append(r)
print(min(RES))
'''


# № 31351 Пересдача 08.07.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если сумма цифр в двоичной записи числа чётная, то к этой записи
# справа дописывается 0, а затем два левых разряда заменяются на 10;
# б) если сумма цифр в двоичной записи числа нечётная, то к этой записи
# справа дописывается 1, а затем два левых  разряда заменяются на 11.
# Полученная таким образом запись является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число N, после обработки которого с помощью этого
# алгоритма получается число R, не меньшее 16. В ответе запишите это
# число в десятичной системе счисления.
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    # summa = sum([int(x) for x in n2])
    summa = sum(map(int, n2))
    if summa % 2 == 0:
        n2 = '10' + n2[2:] + '0'
    else:
        n2 = '11' + n2[2:] + '1'
    r = int(n2, 2)
    if r >= 16:
        RES.append(n)
print(min(RES))
'''


# № 31143 Основная волна 19.06.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если число чётное, то к двоичной записи числа слева дописывается 10;
# б) если число нечётное, то к двоичной записи числа слева дописывается 1
# и справа дописывается 01.
# Полученная таким образом запись является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число N, после обработки которого с помощью
# этого алгоритма получается число R, не меньшее 190. В ответе
# запишите это число в десятичной системе счисления.
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    if n % 2 == 0:
        n2 = '10' + n2
    else:
        n2 = '1' + n2 + '01'
    r = int(n2, 2)
    if r >= 190:
        RES.append(n)
print(min(RES))
'''


# № 29956 Апробация 14.05.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то слева к нему приписывается «1»,
# а справа «02»;
# б) если число N на 3 не делится, то остаток от деления на 3
# умножается на 5, переводится в троичную запись и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число N, после обработки которого с помощью этого
# алгоритма получается число R, не меньшее 177.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = '1' + n3 + '02'
    else:
        n3 = n3 + convert((n % 3) * 5, 3)
    r = int(n3, 3)
    if r >= 177:
        RES.append(n)
print(min(RES))
'''

# № 29956 Апробация 14.05.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то слева к нему приписывается «1»,
# а справа «02»;
# б) если число N на 3 не делится, то остаток от деления на 3
# умножается на 5, переводится в троичную запись и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число N, после обработки которого с помощью этого
# алгоритма получается число R, не меньшее 177.

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')


def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = '1' + n3 + '02'
    else:
        n3 = n3 + convert((n % 3) * 5, 3)
    r = int(n3, 3)
    if r >= 177:
        RES.append(n)
print(min(RES))

# № 28926 ЕГКР 18.04.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если число N делится на 3, то к этой записи справа дописываются две последние троичные цифры;
# б) если число N на 3 не делится, то вычисляется сумма цифр полученной троичной записи,
# эта сумма умножается на 2, переводится в троичную систему счисления и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное нечётное число R, большее 520, которое может быть получено с помощью
# описанного алгоритма.


alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')


def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = n3 + n3[-2] + n3[-1]
    else:
        summa = sum(map(int, n3))
        n3 = n3 + convert(summa * 2, 3)
    r = int(n3, 3)
    if r > 520 and r % 2 != 0:
        RES.append(r)
print(min(RES))

# № 27275 (Уровень: Базовый)
# На вход алгоритма подается натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
#   а) если число N делится на 3, то к этой записи справа дописываются цифры 21, а слева – цифра 1;
#   б) если число N на 3 не делится, то остаток от деления числа N на 3 умножается на 5,
#   переводится в троичную систему счисления и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# Укажите максимальное нечётное число N, после обработки которого с помощью этого
# алгоритма получается число R, не превышающее 1130.

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')


def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = '1' + n3 + '21'
    else:
        n3 = n3 + convert((n % 3) * 5, 3)
    r = int(n3, 3)
    if r <= 1130 and n % 2 != 0:
        RES.append(n)
print(max(RES))

# № 24302 (Уровень: Базовый)
# (В. Лашин) На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если сумма цифр троичной записи числа кратна 9, то к этой записи справа дописывается 2
# б) если сумма цифр троичной записи числа не кратна 9, то к этой записи справа
# дописывается троичная запись остатка от деления суммы цифр записи на 9;
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число R, которое может быть результатом работы данного алгоритма,
# при условии, что N больше 166.

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')


def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if sum(map(int, n3)) % 9 == 0:
        n3 = n3 + '2'
    else:
        n3 = n3 + convert(sum(map(int, n3)) % 9, 3)
    r = int(n3, 3)
    if n > 166:
        RES.append(r)
print(min(RES))

#
# № 23264 Основная волна 11.06.25(Уровень: Базовый)

# На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то к этой записи дописываются две последние троичные цифры;
# б) если число N на 3 не делится, то остаток от деления умножается на 5, переводится
# в троичную запись и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число R, большее 150, которое может быть получено с помощью описанного
# алгоритма. В ответе запишите это число в десятичной системе счисления.

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')


def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = n3 + n3[-2] + n3[-1]
    else:
        n3 = n3 + convert(sum(map(int, n3)) * 5, 3)
    r = int(n3, 3)
    if r > 150:
        RES.append(r)

print(min(RES))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [5, 14]
# КЕГЭ = []
# на следующем уроке:

