# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Единицы измерения информации
# 1 бит - минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит

# 64 Мбайт = 64 * 2 ** 23 бит
# 7 Гбайт = 7 * 2**20  Кбайт


# № 20804 Апробация 05.03.25 (Уровень: Базовый)
'''
pixels = 1280 * 960  # разрешение экрана
colors = 2048  # 2 ** i >= 2048
i = 11  # бит на один пиксель

bit = pixels * i

u = 96_468_992  # бит / с
bit_all = u * 132

count = bit_all / bit
print(count)  # 942.08
'''


# № 19568 (Уровень: Средний)
'''
pixels = 1280 * 1024
i = 8
bit = pixels * i
bit_all = 4 * 2**33  # бит
count = int(bit_all / bit)
print(count)  # 3276 - на одной карте
print(count * 34 + 307)
'''
# Ответ: 111691


# № 19556 (Уровень: Базовый)
# bit = a (шт) * b (Гц) * c (бит) * t (сек)
'''
a = 2
b = 48000
c = 18
# t - ?

bit = 196 * 2 ** 23
t = bit / (a * b * c)
print(t / 60)
'''


# № 20425 (Уровень: Средний)
# Ваня снимал видео в разрешении 3840 x 2160 пикселей
# с цветовой палитрой в x цветов и частотой 60 кадров
# в секунду. Звуковая дорожка записывалась в стерео
# формате с частотой дискретизации 48 кГц и глубиной
# кодирования 16 бит. Видео длилось 1,5 минуты и заняло
# 54691875 Кбайт. Найдите чему равно максимальное количество
# цветов в палитре, используемой Ваней при съёмке этого видео.

pixels = 3840 * 2160
# colors = ?
count_photos = 60 * 90

a = 2
b = 48000
c = 16
t = 90
bit_music = a * b * c * t
bit_video = 54_691_875 * 2**13  # бит
bit_photo = bit_video - bit_music
i = bit_photo / (pixels * count_photos)
print(i)  # 10.0
print(2 ** 10)




# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Дима 4/9 -> 27 вторичных баллов +[1, 12, 14, 16] -[5, 8, 13, 23, 25]
# Максим 11/14 -> 54 вторичных баллов +[1, 2, 3, 4, 5, 8, 13, 14, 16, 23, 25] -[7, 11, 12]

# Второй пробник 28.02.25:
# Дима 10/29 -> 51 вторичных баллов +[1, 4, 7, 8, 13-16, 23, 25] -[5, 9, 12, 17]
# Максим 16/29 -> 67 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-17, 19, 23, 25] -[5, 7, 13, 18]