# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Единицы измерения информации
# 1 бит - минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит


# https://education.yandex.ru/ege/task/84fa6081-f218-4027-83d3-677e893ca3f7
'''
sym = 7
alp = 10 + 8188  # alp = 2 ** i
i = 14  # 2 ** i >= alp (тут всегда берем либо равно, либо больше)

# i - это кол-во бит на один символ
bit = sym * i  # бит на один ID
print(bit / 8)  # 12.25 - всегда округляем вверх
byte = 13  # байт на один ID

print((byte * 20240) / 2**10)
'''


# https://education.yandex.ru/ege/task/07d4d900-6a81-4061-bf9e-8de8c7f04c60
'''
sym = 235
alp = 30
i = 5
bit = sym * i
print(bit / 8)  # 146.875
byte = 147

print((byte * 71_698) / 2**20)
'''


# https://education.yandex.ru/ege/task/221f688c-b7dd-4fd8-b384-f8c245b17f14
'''
sym = 23
alp = 12
i = 4
bit = sym * i
print(bit / 8)  # 11.5
byte = 12

# user = byte + dop

user = 13_068 / 297  # вес в байт одного пользователя
print(user - byte)  # 32.0
'''


# https://education.yandex.ru/ege/task/6096e1ad-bf88-4fe5-8c23-f7d44f90c90a

sym = 163
# alp - ?
# i - ?

byte = 3264 * 2 ** 10 / 32_768
print(byte)  # 102.0

bit = byte * 8

print(bit / sym)  # 5.006
i = 5

# Определите минимальное количество различных символов в алфавите
print(17)

# i = 4 [9:16]
# i = 5 [17:32]
# i = 6 [33:64]


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Дима 4/9 -> 27 вторичных баллов +[1, 12, 14, 16] -[5, 8, 13, 23, 25]
# Максим 11/14 -> 54 вторичных баллов +[1, 2, 3, 4, 5, 8, 13, 14, 16, 23, 25] -[7, 11, 12]

# Второй пробник 28.02.25:
# Дима 10/29 -> 51 вторичных баллов +[1, 4, 7, 8, 13-16, 23, 25] -[5, 9, 12, 17]
# Максим 16/29 -> 67 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-17, 19, 23, 25] -[5, 7, 13, 18]