# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# todo разобрать задачку Тип 24 №59847
'''
s = open('0. files/24.txt').readline()
s = s.replace('WW', ' ')
s = s.split()
maxi = 0
for i in range(len(s)-100):
    r = 'W' + 'WW'.join(s[i:i+101]) + 'W'
    maxi = max(maxi, len(r))
print(maxi)
'''

# зацепка может быть тут https://inf-ege.sdamgia.ru/problem?id=59729
# В строке TTTT пара символов встречается ровно 3 раза.

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 4, 5, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21.1, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Дима 4/9 -> 27 вторичных баллов +[1, 12, 14, 16] -[5, 8, 13, 23, 25]
# Максим 11/14 -> 54 вторичных баллов +[1, 2, 3, 4, 5, 8, 13, 14, 16, 23, 25] -[7, 11, 12]

# Второй пробник 28.02.25:
# Дима 10/29 -> 51 вторичных баллов +[1, 4, 7, 8, 13-16, 23, 25] -[5, 9, 12, 17]
# Максим 16/29 -> 67 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-17, 19, 23, 25] -[5, 7, 13, 18]