# region Домашка: ******************************************************************
from zoneinfo import reset_tzpath

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = x and (z <= w) and (not y)
                if F == 1:
                    print(x, y, z, w)
'''

'''
from itertools import *

def F(x, y, z, w):
    return x and (z <= w) and (not y)


for a1, a2, a3, a4, a5, a6, a7 in product([0, 1], repeat=7):
    table = [(a1, a2, 1, a3), (a4, 1, 0, a5), (1, 0, a6, a7)]
    if len(set(table)) == len(table):
        for i in permutations('xyzw'):
            if [F(**dict(zip(i, r))) for r in table] == [1, 1, 1]:
                print(*i, sep='')
'''
# Ответ: xwzy


# № 20569 (Уровень: Базовый)
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = x and (z <= w) and (not y)
                print(x, y, z, w, int(F))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке: порешать 2 номера сложные 101


# Первый пробник 21.12.24:
# Дима 4/9 -> 27 вторичных баллов +[1, 12, 14, 16] -[5, 8, 13, 23, 25]
# Максим 11/14 -> 54 вторичных баллов +[1, 2, 3, 4, 5, 8, 13, 14, 16, 23, 25] -[7, 11, 12]

# Второй пробник 28.02.25:
# Дима 10/29 -> 51 вторичных баллов +[1, 4, 7, 8, 13-16, 23, 25] -[5, 9, 12, 17]
# Максим 16/29 -> 67 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-17, 19, 23, 25] -[5, 7, 13, 18]