# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21908 Открытый вариант 2025 (Уровень: Базовый)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-D][0-D]*[02468AC])'
M = [x.group() for x in finditer(num, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''


# № 22356 Апробация 14.05.25 (Уровень: Средний)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-B][0-B]*[13579B])'
M = [x.group() for x in finditer(num, s)]
maxi = 0
res = ''
for x in M:
    print(x)
    if maxi < int(x, 12):
        maxi = int(x, 12)
        res = x
print(maxi)
print(s.index(res))
'''


# № 22357 (Уровень: Средний)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-D][0-D]*[02468AC])'
M = [x.group() for x in finditer(num, s)]
maxi = 0
res = ''
for x in M:
    print(x)
    if maxi < int(x, 14):
        maxi = int(x, 14)
        res = x
print(maxi)
print(s.index(res))
'''


# № 22358 (Уровень: Средний)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-B][0-B]*)'
M = [x.group() for x in finditer(num, s)]
maxi = 0
res = ''
for x in M:
    print(x)
    if int(x, 12) % 3 == 0:
        if maxi < int(x, 12):
            maxi = int(x, 12)
            res = x
print(maxi)
print(s.index(res))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21.2, 22, 23, 24.2, 25, 26.1]
# КЕГЭ = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Дима 4/9 -> 27 вторичных баллов +[1, 12, 14, 16] -[5, 8, 13, 23, 25]
# Максим 11/14 -> 54 вторичных баллов +[1, 2, 3, 4, 5, 8, 13, 14, 16, 23, 25] -[7, 11, 12]

# Второй пробник 28.02.25:
# Дима 10/29 -> 51 вторичных баллов +[1, 4, 7, 8, 13-16, 23, 25] -[5, 9, 12, 17]
# Максим 16/29 -> 67 вторичных баллов +[1-4, 6, 8, 9, 11, 12, 14-17, 19, 23, 25] -[5, 7, 13, 18]

# Третий пробник 28.05.25:
# Максим 18/29 -> 67 вторичных баллов +[1-8, 14-21, 23, 25] -[9, 10, 11, 12, 13, 22, 24, 26, 27]
