# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
print('x y z w')
for x in 0, 1:
    for y in (0, 1):
        for z in [0, 1]:
            for w in range(2):
                F = (not(w <= x)) or (y <= z) or (not y)
                if F == 0:
                    print(x, y, z, w)
'''


# https://education.yandex.ru/ege/task/7f19ba6c-69f8-4b66-bf22-3616dc1f1342
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (not(y <= w)) or (x == z) or (not x)
                if F == 0:
                    print(x, y, z, w)
'''
# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14, 25]
# КЕГЭ  = []
# на следующем уроке:
