# region Домашка: ******************************************************************

# Вычисли всё!
'''
import math

n = int(input())
N = [int(x) for x in str(n)]
print(N.count(2))
print(N.count(N[-1]))
nechet = [x for x in N if x % 2 != 0]
print(len(nechet))
total = [x for x in N if x > 7]
print(sum(total))
if len(total) == 0:
    print(11)
elif len(total) == 1:
    print(total[0])
else:
    print(math.prod(total))
print(N.count(0) + N.count(4))
'''


# Уникальные элементы списка
'''
n = int(input())
M = []
for i in range(n):
    x = int(input())
    M.append(x)

new_M = [x for x in M if M.count(x) == 1]

if len(new_M) == 0:
    print("Уникальных элементов нет")
else:
    print(*new_M, sep='\n')
'''


# Тип 12 №15951
# Какая строка получится в результате применения
# приведённой ниже программы к строке, состоящей из 98 единиц?
#
# ПОКА нашлось (1111)
#   заменить (1111, 22)
#   заменить (222, 1)
'''
s = '1' * 98
while '1111' in s:
    s = s.replace('1111', '22', 1)
    s = s.replace('222', '1', 1)
print(s)
'''

# Тип 12 №55808
# Найдите минимальное значение n,
# при котором сумма цифр конечной строки будет равна 27.
'''
for n in range(4, 10000):
    s = '3' + '5' * n

    while '25' in s or '355' in s or '555' in s:
        if '25' in s:
            s = s.replace('25', '3', 1)
        if '355' in s:
            s = s.replace('355', '52', 1)
        if '555' in s:
            s = s.replace('555', '23', 1)
    summa = sum([int(x) for x in s])
    if summa == 27:
        print(n)
        break
'''


# Тип 12 №26957
# ПОКА нашлось (>1) ИЛИ нашлось (>2) ИЛИ нашлось (>3)
#     ЕСЛИ нашлось (>1)
#     ТО заменить (>1, 22>)
#     ЕСЛИ нашлось (>2)
#     ТО заменить (>2, 2>)
#     ЕСЛИ нашлось (>3)
#     ТО заменить (>3, 1>)

# На вход приведённой ниже программе поступает строка, начинающаяся с символа «>»,
# а затем содержащая 26 цифр 1, 10 цифр 2 и 14 цифр 3, расположенных в произвольном порядке.
#
# Определите сумму числовых значений цифр строки, получившейся в результате выполнения программы.

s = '>' + '1' * 26 + '2' * 10 + '3' * 14
while '>1' in s or '>2' in s or '>3' in s:
    if '>1' in s:
        s = s.replace('>1', '22>', 1)
    if '>2' in s:
        s = s.replace('>2', '2>', 1)
    if '>3' in s:
        s = s.replace('>3', '1>', 1)
print(sum([int(x) for x in s if x.isdigit()]))




# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6]
# КЕГЭ  = []
# на следующем уроке:
