# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 9
'''
k = 0
for s in open('0. files/9.txt'):
    m = sorted([int(x) for x in s.split()])
    copied = [x for x in m if m.count(x) == 2]
    uncopied = [x for x in m if m.count(x) == 1]
    if len(copied) == 2 and len(uncopied) == 4:
        if sum(copied) / 2 < sum(uncopied) / 4:
            k = k + 1
print(k)
'''

from fnmatch import *
for x in range(6072,10**8,6072):
    if fnmatch(str(x),'5*4?48'):
        print(x,x//6072)

# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1.1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Матвей 10/14 -> 51 вторичных баллов +[1, 3, 4, 6, 7, 10, 11, 14, 18, 25] -[2, 5, 8, 12]

# Второй пробник 28.02.25:
# Матвей 14/29 -> 62 вторичных баллов +[1-4, 6, 7, 10, 11, 14, 15, 16, 18, 23, 25] -[5, 8, 12, 13]

# Третий пробник 20.05.25:
# Матвей 14/29 -> 62 вторичных баллов +[1-3, 5-16, 18-21, 23, 25] -[4, 17, 22, 24]
