# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************
'''
s='АБДЕОП'
k=0
for x1 in s:
    for x2 in s:
        for x3 in s:
            for x4 in s:
                for x5 in s:
                    for x6 in s:
                        s1=x1+x2+x3+x4+x5+x6
                        k=k+1
                        if s1[0]=='О' and len(s1) == len(set(s1)):
                            if k%2==0:
                                print(k,s1)
'''

'''
from itertools import *
k = 0
for p in product('АБДЕОП', repeat=6):
    w = ''.join(p)
    k += 1
    if w[0] == 'О':
        if k % 2 == 0:
            if len(w) == len(set(w)):
                print(k)
'''

# 21702
'''
def F(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]

R = []
for x in range(1, 3000):
    n = 4**210 + 4**110 - x
    s = F(n, 4)
    R.append([s.count('0'), x])

print(max(R))  # [105, 2048]
for el in R:
    if el[0] == 105:
        print(el)
'''


# 21700

def F(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]


for n in range(3, 100000):
    s = F(n, 3)
    if n % 3 == 0:
        s = s + s[-2:]
    else:
        ost = (n % 3) * 3
        s = s + F(ost, 3)
    r = int(s, 3)
    if r < 150:
        print(n)


# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1.1, 2, 3, 4, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке: 9, 17 c ЕГКР (если не получились дома)


# Первый пробник 21.12.24:
# Матвей 10/14 -> 51 вторичных баллов +[1, 3, 4, 6, 7, 10, 11, 14, 18, 25] -[2, 5, 8, 12]

# Второй пробник 28.02.25:
# Матвей 14/29 -> 62 вторичных баллов +[1-4, 6, 7, 10, 11, 14, 15, 16, 18, 23, 25] -[5, 8, 12, 13]
