# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1
'''
print(f'Первый элемент списка: {M[0]}')
print(f'Последний элемент списка: {M[len(M) - 1]}')
print(f'Последний элемент списка: {M[-1]}')
'''


# Срезы:
'''
# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
M.reverse()
# -i -5   -4   -3   -2   -1

print(M[1:3])  # ['b', 'c']
print(M[:3])  # ['a', 'b', 'c']
print(M[3:])  # ['d', 'e']
print(M[-2:])  # ['d', 'e']
print(M[::2])  # ['a', 'c', 'e'] - все четные индексы
print(M[1::2])  # ['b', 'd'] - все нечетные индексы
print(M[::-1])  # ['e', 'd', 'c', 'b', 'a'] - в обратном порядке

s = 'abcde'
print(s[1:3])  # bc
print(s[:3])  # abc
print(s[3:])  # de
print(s[::-1])  # edcba
'''

'''
name = 'Илья'
print(f'Привет, {name}!')
'''


# 15
'''
R = []
for n in range(1, 12+1):
    s = f'{n:b}'  # s = bin(n)[2:]
    if n % 2 == 0:
        s = '10' + s
    else:
        s = '1' + s + '01'
    r = int(s, 2)
    R.append(r)  # .append() - добавляет новый элемент в конец списка
print(max(R))
'''

# 13
'''
from ipaddress import *
net = ip_network('112.160.0.0/255.240.0.0', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 3 != 0:
        cnt += 1
print(cnt)
'''

# 15
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or (B <= (x % 22 != 0))


for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''

# 23

def F(a, b):
    if a < b:
        return 0
    elif a == b:
        return 1
    else:
        return F(a-1, b) + F(a-2, b) + F(a//3, b)

print(F(16, 11) * F(11, 6))


def F(a, b):
    if a <= b:
        return a == b
    return F(a-1, b) + F(a-2, b) + F(a//3, b)

print(F(16, 11) * F(11, 6))



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5*, 6, 7, 8*, 12*, 14*, 16, 18, 19-21]
# КЕГЭ  = []
# на следующем уроке:
