# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                # F = ((not z) == (not y)) or ((not x) and y) or w
                # F = (x or (not y)) and (not(y == z)) and (not w)
                # F = (x or y) and (x <= (not z)) and (not w)
                # F = (x and (not y)) or (y == z) or (not w)
                # F = ((1 == w) == ((not ((w and x) or y))) <= z)
                # F = (y==(not w))<=(not(w and (x==(x or(w<=z)))))
                # F = (not (y<=(x==w))and(z<=x))
                # F = (not ((((((w and x) == x) or 1) <= z) or ((not x))) and y))
                # F = (not (w == y)) and (z <= w) and (not x)
                F = (not ((not (x <= (not w))) and z)) and (not (w <= z)) and (x <= (not z))
                if F == 1:
                    print(x, y, z, w)




# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1.1, 2, 5, 6, 8, 12, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Матвей 10/14 -> 51 вторичных баллов +[1, 3, 4, 6, 7, 10, 11, 14, 18, 25] -[2, 5, 8, 12]
