# region Домашка: ******************************************************************

'''
alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alphabet[n % b]
        n //= b
    return r[::-1]


R = []
for n in range(1, 10000):
    s = convert(n, 3)
    if n % 3 == 0:
        s = s + s[-2:]
    else:
        # summa = s.count('1') + s.count('2') * 2
        summa = sum(map(int, s))
        s = s + convert(summa, 3)
    r = int(s, 3)
    if r > 220 and r % 2 == 0:
        R.append(r)
print(min(R))
'''

'''
from itertools import *
n = 0
for p in product(sorted('ЯНВАРЬ'), repeat=5):
    word = ''.join(p)
    n += 1
    a, b, c, d, e = word
    if a != 'Я':
        if word.count('Ь') <= 1:
            if 'ЯЯ' not in word:
                print(n)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# IP-адрес сети (узел): 192.168.248.176
# Сетевая маска (маска): 255.255.255.240

# Адрес сети = Узел сети & Маска сети 
# & - операция побитовой конъюнкции

# 192.168.248.176 - на каждое число выделяется по 1 байту - 8 бит
# 11110000 - восьмибитное число
# Всего битов в айпишнике 32 = 8 + 8 + 8 + 8

# Маска имеет вид: 1111111...00000

# 255.255.255.240
# 11111111.11111111.11111111.11000000
# Вариантов маски сети всего 32
'''



# № 18928 Новогодний вариант 2025 (Уровень: Базовый)

# IP-адрес сети: 192.168.248.176
# Сетевая маска: 255.255.255.240
#
# Необходимо узнать, сколько в этой сети IP-адресов,
# для которых количество единиц и нулей в двоичной записи IP-адреса одинаково.
'''
from ipaddress import *
net = ip_network('192.168.248.176/255.255.255.240', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') == b.count('0'):
        cnt += 1
print(cnt)
'''


# № 18862 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('172.140.68.0/255.255.248.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('0') > 15:
        cnt += 1
print(cnt)
'''


# № 18159 (Уровень: Базовый)
# Для узла с IP-адресом 205.154.212.20 адрес сети равен 205.154.192.0.
# Чему равно наибольшее возможное значение третьего слева байта маски?
'''
from ipaddress import *
for mask in range(33):  # перебираем кол-во единиц в маске
    net = ip_network(f'205.154.212.20/{mask}', 0)
    if '205.154.192.0' in str(net):
        print(net, mask, net.netmask)
'''


# № 18955 (Уровень: Средний)
# Два узла, находящиеся в одной сети, имеют IP-адреса 200.154.190.12 и 200.154.184.0.
# Укажите наибольшее возможное количество единиц в маске этой сети.
'''
from ipaddress import *
for mask in range(33):
    net1 = ip_network(f'200.154.190.12/{mask}', 0)
    net2 = ip_network(f'200.154.184.0/{mask}', 0)
    if net1 == net2:
        print(mask)
'''

# endregion Урок: ********************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1.1, 2, 5, 6, 8, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Матвей 10/14 -> 51 вторичных баллов +[1, 3, 4, 6, 7, 10, 11, 14, 18, 25] -[2, 5, 8, 12]

# Второй пробник 28.02.25:
# Матвей 9/29 -> 48 вторичных баллов +[1-4, 6, 7, 10, 11, 18] -[5, 8, 9, 12-17, 19-21, 23, 24, 25]
