




# - это однострочный комментарий

'''
- это блочный комментарий
'''


age = 25  # переменные - это удобный способ взаимодействия с информацией (данными)
name = 'Илья'


# Типа данных переменных
'''
a = 5  # int (integer) - целочисленные значения
print(type(a))  # <class 'int'>

b = 5.0  # float (число с плавающей точкой) - вещественное значение (дроби)
print(4 / 2, type(4 / 2))  # 2.0 <class 'float'>

c = '5'  # str (string) - строковый тип данных для хранения текста и символов
print(a * 4, c * 4)  # 20 5555
print('Hello ' * 4)  # Hello Hello Hello Hello - при умножении строки на число строка дублируется

c1 = 'Hello, '
c2 = 'world!'
c = c1 + c2  # - операция конкатенации строк (склеивание)
print(c)  # Hello, world!

s = '7' + '3' * 10
print(s)  # 73333333333

d1 = True  # bool (Boolean) - основы Булевой алгебрны | математическая логика
d0 = False
print(4 == 4)  # True
print(4 < 10)  # True
print(4 > 10)  # False
'''


# Конвертация типов данных
'''
a = 5
print(type(a), a)  # <class 'int'> 5

a = str(a)
print(type(a), a)  # <class 'str'> 5

a = float(a)
print(type(a), a)  # <class 'float'> 5.0

a = int(a)
print(type(a), a)  # <class 'int'> 5

a = float(a)
print(type(a), a)  # <class 'float'> 5.0

a = str(a)
print(type(a), a)  # <class 'str'> 5.0

a = int(a)
print(type(a), a)  # ValueError: invalid literal for int() with base 10: '5.0'
'''


# Ввод данных с клавиатуры: input()

# Функция input() - вводит строку с клавиатуры
'''
age = int(input('Введите возраст пользователя: '))
if age >= 18:
    print('Есть 18.')
else:
    print('Нету 18.')

name = input('Введите имя пользователя: ')
print(f'Имя пользователя: {name}')
'''


# Использование f-строк
'''
name = input('Введите имя пользователя: ')
age = int(input('Введите возраст пользователя: '))

# Имя пользвателя: name, а возраст: age доступ разрешен!
print('Имя пользвателя: ', name, ', а возраст: ', age, ' доступ разрешен!')
print('Имя пользвателя: ' + name + ', а возраст: ' + str(age) + ' доступ разрешен!')
# TypeError: can only concatenate str (not "int") to str
print('Имя пользвателя: {}, а возраст: {} доступ разрешен!'.format(name, age))
print(f'Имя пользвателя: {name}, а возраст: {age} доступ разрешен!')
'''


# Базовая арифметика
'''
a, b = 7, 2

a += 5  # a = a + 5
print(a)  # 12

a -= 5
print(a)  # 7

a *= 5
print(a)  # 35

a //= 5
print(a)  # 7


a, b = 7, 2

print(f'{a} + {b} = {a + b} \n'  # \n - переход на новуб строку в консили 
      f'{a} - {b} = {a - b} \n'
      f'{a} * {b} = {a * b}')

print()  # В каждой функции print() есть переход на новуб строку \n

# Три типа делений в программировании
print(f'{a} / {b} = {a / b}')  # 3.5 - вещественное деление (дробь)
print(f'{a} // {b} = {a // b}')  # 3 - взятие только целой части, остаток удаляется
print(f'{a} % {b} = {a % b}')  # 1 - взятие остатка от деления


n = 324

print(n // 10)  # 32
print(n % 10)  # 4 - взятие последней цифры числа

print(n // 100)  # 3
print(n % 100)  # 24 - взятие последних двух цифр числа

print(n % 1000)  # 324 - взятие последних трех цифр числа


n = int(input('n: '))

if n % 2 == 0:
    print('Делится на 2 | Кратно 2 | Четное')
if n % 2 != 0:
    print('Не делится на 2 | Не кратно 2 | Нечетное')
if n % 32 == 0:
    print('Делитсяна 32 | Кратно 32')


# Возведение в степень
print(2 ** 3)  # 8
print(2 ** 4)  # 16
print(2 ** 5)  # 32


# Взятие квадратов от числа:

print(16 ** (1/2))  # 4.0
print(27 ** (1 / 3))  # 3.0
'''



# В программу подается пятизначное число, необходимо получить
# сумму цифр и произведение циф этого числа.
'''
n = int(input())
a = n // 10000
b = (n // 1000) % 10 # 98
c = (n // 100) % 10 
d = (n // 10) % 10
e = n % 10  # 9843
print(a+b+c+d+e)
print(a*b*c*d*e)
'''


n = 928473

print(n % 1000)  # 473
print(n//10000)  # 92
print((n % 1000)*(n // 10000))  # 92 * 473

print(((n // 10000) % 10) + ((n % 100)//10))   # 2 + 7 = 9

