# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# n = 1: Петя первый ход
# n = 2: Ваня первый ход
# n = 3: Петя второй ход
# n = 4: Ваня второй ход

# 21905 Открытый вариант 2025 (Уровень: Базовый)
# 1 куча: +1, +4, *3 | s >= 67 | 1 ≤ s ≤ 66
'''
def F(s, n):
    if s >= 67:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s+1, n-1), F(s+4, n-1), F(s*3, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)  # else any(h)

print([s for s in range(1, 67) if F(s, n=2)])
print([s for s in range(1, 67) if F(s, n=3) and not F(s, n=1)])
print([s for s in range(1, 67) if F(s, n=4) and not F(s, n=2)])
'''


# № 12928 (Уровень: Средний)
# 1 куча: +1, *2 | s >= 21 |  1 ≤ s ≤ 20
'''
def F(s, n):
    if s >= 21:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s+1, n-1), F(s*2, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)  # else any(h)

# print([s for s in range(1, 21) if F(s, n=2)])
print([s for s in range(1, 21) if F(s, n=3) and not F(s, n=1)])
print([s for s in range(1, 21) if F(s, n=4) and not F(s, n=2)])
print([s for s in range(1, 21) if F(s, n=5) and not F(s, n=3) and not F(s, n=1)])
'''

# № 21907 Открытый вариант 2025 (Уровень: Базовый)
'''
def F(a, b):
    if a >= b or a == 8:
        return a == b
    h = [F(a+1, b), F(a+2, b), F(a*2, b)]
    return sum(h)

print(F(3, 14) * F(14, 18))
'''

# № 19784 (Уровень: Базовый)
'''
def F(a, b):
    if a <= b or a == 28:
        return a == b
    return F(a-2, b) + F(a // 2 if a % 2 == 0 else a - 3, b)

print(F(98, 1))


def F(a, b):
    if a <= b or a == 28:
        return a == b
    h = [F(a-2, b)]
    if a % 2 == 0:
        h += [F(a // 2, b)]
    if a % 2 != 0:
        h += [F(a -3 , b)]
    return sum(h)

print(F(98, 1))
'''

# № 13964 (Уровень: Базовый)
# 2 кучи: a-2, s-2, a/2, s/2 (больше) | a + s <= 108 | s > 48

from math import ceil, floor
def F(a, s, n):
    if a + s <= 108:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(a-2, s, n-1), F(a, s-2, n-1), F(ceil(a/2), s, n-1), F(a, ceil(s/2), n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)  # else any(h)


print([s for s in range(49, 1000) if F(60, s, n=2)])
print([s for s in range(49, 1000) if F(60, s, n=3) and not F(60, s, n=1)])
print([s for s in range(49, 1000) if F(60, s, n=4) and not F(60, s, n=2)])


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [8, 9, 11, 13, 17, 19-21, 22, 24.2, 25]
# КЕГЭ  = []
# на следующем уроке:

# Первый пробник 5.02.25:
# Ангелина 11/29 -> 54 вторичных баллов +[1-5, 7, 14-16, 20-21] -[6, 8, 9, 10, 11, 12, 13, 17, 18, 19, 22, 23, 25]
# Сергей 16/29 -> 67 вторичных баллов +[1-6, 10, 12, 14, 15, 16, 19-21, 23, 24] -[7, 8, 9, 11, 13, 17, 18, 22, 25]

# Второй пробник 28.02.25:
# Ангелина 10/29 -> 51 вторичных баллов +[2, 3, 4, 7, 9, 10, 14, 18, 23, 25] -[1, 5, 6, 8, 12, 11, 13, 15, 17]
# Сергей 16/29 -> 67 вторичных баллов +[1, 2, 5, 6, 8, 11, 13-18, 19-21, 23, 25] -[3, 4, 7, 9, 10, 12, 22, 24]
