# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21910 Открытый вариант 2025 (Уровень: Базовый)
'''
file = open('0. files/26.txt')
N = file.readline()
M = [int(x) for x in file]
M = sorted(M)[::-1]
R = [M[0]]
for x in M:
    if R[-1] - x >= 9:
        R.append(x)
print(len(R), min(R))
'''


# № 21719 ЕГКР 19.04.25 (Уровень: Базовый)
'''
file = open('0. files/26.txt')
N = file.readline()
R = []
for s in file:
    a, b = [int(x) for x in s.split()]
    if [a, b] not in R:
        R.append([a, b])
R = sorted(R)[::-1]
A = [R[0]]
maxi = 0
for x in R:
    a, b = x
    if a == A[-1][0] and A[-1][1] - b == 2:
        A.append([a, b])
        if maxi <= len(A):
            print(a, maxi)
            maxi = len(A)
    else:
        A = [[a, b]]
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [8, 9, 11, 13, 17, 19-21, 22, 24.2, 25]
# КЕГЭ  = []
# на следующем уроке:

# Первый пробник 5.02.25:
# Ангелина 11/29 -> 54 вторичных баллов +[1-5, 7, 14-16, 20-21] -[6, 8, 9, 10, 11, 12, 13, 17, 18, 19, 22, 23, 25]
# Сергей 16/29 -> 67 вторичных баллов +[1-6, 10, 12, 14, 15, 16, 19-21, 23, 24] -[7, 8, 9, 11, 13, 17, 18, 22, 25]

# Второй пробник 28.02.25:
# Ангелина 10/29 -> 51 вторичных баллов +[2, 3, 4, 7, 9, 10, 14, 18, 23, 25] -[1, 5, 6, 8, 12, 11, 13, 15, 17]
# Сергей 16/29 -> 67 вторичных баллов +[1, 2, 5, 6, 8, 11, 13-18, 19-21, 23, 25] -[3, 4, 7, 9, 10, 12, 22, 24]
