# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 21421 Досрочная волна 2025 (Уровень: Базовый)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'[1-B][0-B]*[02468A]'
M = [x.group() for x in finditer(num, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''


# № 22356 Апробация 14.05.25 (Уровень: Средний)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'[1-B][0-B]*[13579B]'
M = [x.group() for x in finditer(num, s)]
maxi = 0
res = ''
for x in M:
    if maxi < int(x, 12):
        maxi = int(x, 12)
        res = x
print(s.index(res))


f = open("0. files/24.txt").readline()
reg = r'([1-B][0-B]*[13579B])'
m = [a.group() for a in finditer(reg,s)]
n = [int(a,12) for a in m]
print(s.index(m[n.index(max(n))]))
'''


from ipaddress import *
net = ip_network('98.81.154.195/255.252.0.0', 0)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [8, 9, 11, 13, 17, 19-21, 22, 24.2, 25]
# КЕГЭ  = []
# на следующем уроке:

# Первый пробник 5.02.25:
# Ангелина 11/29 -> 54 вторичных баллов +[1-5, 7, 14-16, 20-21] -[6, 8, 9, 10, 11, 12, 13, 17, 18, 19, 22, 23, 25]
# Сергей 16/29 -> 67 вторичных баллов +[1-6, 10, 12, 14, 15, 16, 19-21, 23, 24] -[7, 8, 9, 11, 13, 17, 18, 22, 25]

# Второй пробник 28.02.25:
# Ангелина 10/29 -> 51 вторичных баллов +[2, 3, 4, 7, 9, 10, 14, 18, 23, 25] -[1, 5, 6, 8, 12, 11, 13, 15, 17]
# Сергей 16/29 -> 67 вторичных баллов +[1, 2, 5, 6, 8, 11, 13-18, 19-21, 23, 25] -[3, 4, 7, 9, 10, 12, 22, 24]
