# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21421 Досрочная волна 2025 (Уровень: Базовый)
'''
from re import *
s = open('0. files/24.txt').readline()
# num = r'([123456789AB][0123456789AB]*[02468A])'
num = r'([1-B][0-B]*[02468A])'
M = [x.group() for x in finditer(num, s)]
maxi = 0
for x in M:
    maxi = max(maxi, len(x))
    print(x)
print(maxi)
'''


# № 20813 Апробация 05.03.25 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([789][0789]*|[0])'
reg = rf'{num}([*-]{num})*'
M = [x.group() for x in finditer(reg, s)]
maxi = 0
for x in M:
    maxi = max(maxi, len(x))
    print(x)
print(maxi)
'''


# № 17563 Основная волна 08.06.24 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()

num = r'([789][0789]*)'  # натуральные числа |[0]

reg = rf'{num}([*-]{num})*'

M = [x.group() for x in finditer(reg, s)]

maxi = 0
for x in M:
    maxi = max(maxi, len(x))
    print(x)
print(maxi)
'''


# № 17641 Основная волна 19.06.24 (Уровень: Гроб)
'''
from re import *
s = open('0. files/24.txt').readline()

num = r'([1-9][0-9]*|[0])'  
reg = rf'{num}([*+]{num})*'
reg = rf'(?=({reg}))'
M = [x.group(1) for x in finditer(reg, s)]

maxi = 0
for x in M:
    if eval(x) == 0:
        maxi = max(maxi, len(x))
        print(x)
print(maxi)
'''
# print(eval('0*54223*83454*0*0+96571*0+0+0'))


# № 21597 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()

num = r'([1-5][0-5]*|[0])'
reg = rf'{num}([*]{num})*([-]{num})*'
reg = rf'(?=({reg}))'
M = [x.group(1) for x in finditer(reg, s)]

maxi = 0
for x in M:
    maxi = max(maxi, len(x))

print(maxi)
'''

#      46 1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1
# 51 3021*1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1


'''
from re import *
s = open('0. files/24.txt').readline()

num = r'([1-9][0-9]*[05]|[0])'
reg = rf'{num}([*+]{num})*'
reg = rf'(?=({reg}))'
M = [x.group(1) for x in finditer(reg, s)]

maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))

print(maxi)
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [9, 13, 17, 19-21, 22, 24.2, 25]
# КЕГЭ  = []
# на следующем уроке: 8, 11

# Первый пробник 5.02.25:
# Ангелина 11/29 -> 54 вторичных баллов +[1-5, 7, 14-16, 20-21] -[6, 8, 9, 10, 11, 12, 13, 17, 18, 19, 22, 23, 25]
# Сергей 16/29 -> 67 вторичных баллов +[1-6, 10, 12, 14, 15, 16, 19-21, 23, 24] -[7, 8, 9, 11, 13, 17, 18, 22, 25]

# Второй пробник 28.02.25:
# Ангелина 10/29 -> 51 вторичных баллов +[2, 3, 4, 7, 9, 10, 14, 18, 23, 25] -[1, 5, 6, 8, 12, 11, 13, 15, 17]
# Сергей 16/29 -> 67 вторичных баллов +[1, 2, 5, 6, 8, 11, 13-18, 19-21, 23, 25] -[3, 4, 7, 9, 10, 12, 22, 24]
