# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Типы данных переменных:
'''
a = 5  # int (integer) - целочисленные значения
print(a, type(a))  # 5 <class 'int'>
print(type(4+5))  # <class 'int'>

b = 5.0  # float (число с плавающей точкой)
print(type(4+2.0))  # 6.0 <class 'float'>
print(4 / 2)  # 2.0


c = '5'  # str (string) - строчный тип данных, хранит в себе символы, буквы и тд
print(a * 4, c * 4)  # 20 5555
print('hello ' * 4)  # hello hello hello hello - строка при умножении на целое число будет дублироваться
print('Hello, ' + 'world!')  # Hello, world! - конкатенация строк (склеивание)

d0 = False  # bool (Boolean) - Булева алгебра (Математическая логика)
d1 = True
'''


# Типы данных коллекций (последовательностей)

A = [1, 2, 3]  # list (список)

B = (1, 2, 3)  # tuple (кортеж)

C = {1, 2, 3, 3, 3}  # set (множество)
print(C)  # {1, 2, 3}

D = {'один': 'one', 'два': 'two'}  # dict (словарь)
print(D['один'])  # one

M = [1, 2.0, '2', True, [1, 2, 3], (1, 2, 3)]
for x in M:
    print(x, type(x))
    # 1 <class 'int'>
    # 2.0 <class 'float'>
    # 2 <class 'str'>
    # True <class 'bool'>
    # [1, 2, 3] <class 'list'>
    # (1, 2, 3) <class 'tuple'>





# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
