




# - однострочный комментарий

'''
- многострочный комментарий
'''


# Типы данных переменных
'''
a = 5  # int (integer) - целочисленные значения
print(a, type(a))  # 5 <class 'int'>

b = 5.0  # float (число с плавающей токой) - вещественное значение (дроби)
print(4 / 2, type(4 / 2))  # 2.0 <class 'float'>

c = '5'  # str (string) - строковый тип данных для хранения текста и символов
print(a, c)  # 5 5
print(a * 4, c * 4)  # 20 5555

print('Hello ' * 4)  # Hello Hello Hello Hello

c1 = 'Hello, '
c2 = 'world!'
c = c1 + c2
print(c)  # Hello, world! - операция конкатенации строк (склеивание)

print('7' + '2' * 10)  # 72222222222
print('3' + '5' * 5 + '5' + '6')  # 35555556

d1 = True  # bool (Boolean) - основы Булевой алгберыы | Математическая логика
d0 = False
print(4 == 4)  # True
print(4 == 10)  # False
'''


# Типы данных коллекций / последовательностей
'''
L = [1, 2, 2, 3, 3, 3]  # list (список)
# 1. Могут хранить неограниченное кол-во элементов
# 2. Элементы могут быть различных типов данных
# 3. Каждый элемент списка имеет свой порядковый номер - индекс
# 4. Индексы можно считать слева-направо начиная с 0 или справа-налево начиная с -1
# 5. Через индексы можно изменять элементы списка (в отличие от кортежей и строк)

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1


M[0], M[-1] = 'A', 'E'
print(M)  # ['A', 'b', 'c', 'd', 'E']

M[0], M[-1] = M[-1], M[0]
print(M)  # ['E', 'b', 'c', 'd', 'A']


# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

print(f'Первый элемент списка М: {M[0]}')
print(f'Последний элемент списка М: {M[4]}')
print(f'Последний элемент списка М: {M[-1]}')


M = [2, '2', 2.0, True, [1, 2, 3]]
for x in M:
    print(type(x), x)
    # <class 'int'> 2
    # <class 'str'> 2
    # <class 'float'> 2.0
    # <class 'bool'> True
    # <class 'list'> [1, 2, 3]


T = (1, 2, 2, 3, 3, 3)  # tuple (кортеж)
# 1. ПОлностью идентичный спискам, но нельзя изменять элементы кортежа

S = {1, 2, 2, 3, 3, 3}  # set (множество)
# 1. Не могут хранить копии элементов, то есть копии удаляются
print(S)  # {1, 2, 3}
'''


# Конвертация типов данных
'''
a = 5
print(type(a), a)  # <class 'int'> 5

a = str(a)
print(type(a), a)  # <class 'str'> 5

a = float(a)
print(type(a), a)  # <class 'float'> 5.0

a = int(a)
print(type(a), a)  # <class 'int'> 5


A = [1, 2, 2, 3, 3, 3]
print(type(A), A)  # <class 'list'> [1, 2, 2, 3, 3, 3]

A = tuple(A)
print(type(A), A)  # <class 'tuple'> (1, 2, 2, 3, 3, 3)

A = set(A)
print(type(A), A)  # <class 'set'> {1, 2, 3}

A = list(A)
print(type(A), A)  # <class 'list'> [1, 2, 3]
'''


# Ввод данных с клавиатуры input()
'''
age = int(input('Введите возраст пользователя: '))
print(age, type(age))  # 24 <class 'int'>
# ValueError: invalid literal for int() with base 10: 'Илья 24'

name = input('Введите имя пользователя: ')  # вводит текст str
print('Имя пользователя: ', name)
'''


# f-строка
'''
name = input('Введите имя пользователя: ')
age = 24
print('Имя пользователя: ', name, 'а возраст', age, 'лет!')
print(f'Имя пользователя: {name} а возраст {age} лет!')
'''


# Базовая арифметика

a, b = 7, 2

print(f'{a} + {b} = {a + b} \n'  # \n - перехода на новую строку 
      f'{a} - {b} = {a - b} \n'
      f'{a} * {b} = {a * b}')

print()  # В каждой функции print() есть переход на новую строку \n

print(f'{a} / {b} = {a / b}')  # 3.5 - вещественное деление
print(f'{a} // {b} = {a // b}')  # 3 - взятие только целой части
print(f'{a} % {b} = {a % b}')  # 1 - остаток от деления


print(123 // 10)  # 12
print(123 % 10)  # 3

print(123 // 100)  # 1
print(123 % 100)  # 23


print(2 ** 3)  # 8
print(2 ** 4)  # 16
print(2 ** 5)  # 32



