# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


'''
from math import dist
cB = [[], [], []]

for s in open('files/27B.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y > 23:
        cB[0].append([x, y])
    if 15 < y < 23:
        cB[1].append([x, y])
    if y < 15:
        cB[2].append([x, y])

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        R.append([summa, p])
    return min(R)[1]

print(len(cB[0]))  # 74
print(len(cB[1]))  # 100
print(len(cB[2]))  # 451


# Для файла Б определите координаты центра каждого кластера, затем найдите два числа:
# Q1 - в кластере с наибольшим количеством точек число таких точек,
# которые находятся на расстоянии не более 1,2 от центра кластера, и

# Q2 - в кластере с наибольшим количеством точек число таких точек,
# которые находятся на расстоянии не более 0,75 от центра кластера.

def Q(cl, cent, legth):
    cnt = 0
    for p in cl:
        if dist(p, cent) <= legth:
            cnt += 1
    return cnt

Q1 = Q(cB[2], center(cB[2]), 1.2)
Q2 = Q(cB[2], center(cB[2]), 0.75)

print(Q1, Q2)  # 358 203



def diametr(cl):
    R = []
    for i in range(len(cl)):
        for j in range(i+1, len(cl)):
            R.append(dist(cl[i], cl[j]))
    return max(R)

print(cB[0])
print(diametr(cB[0]))
'''



# Администратор/Грузоперевозки: =ЕСЛИ(B2<$E$1;1;"")
# Задачи: 24 2944 1275 1395 27636 1304 1207 788 225

# Коржи/Коробки: =ЕСЛИ(B1-A2>=8;A2;B1)
# Задачи: 27779 21910 16335 21424 15341 7096 4712 4604

# Магазин
# Задачи:

# Распределение мест  =ЕСЛИ(И(A2=A1;B2-B1=3);B2-2;"")
# Задачи: 1868, 2613, 7274, 3664, 3586, 3230

# Очередь в кассу
# Задачи:

# Организация сортировки
# Задачи:



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [23]
# на следующем уроке:



# region Пробник 2

# Вероника
# Пробник №2
# Дата: #Понедельник #02Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17,
# ❔ Без ответа: 22, 24, 26, 27
#
# Итог: 22/29 первичных балла ~ 83 вторичных


# Нестор
# Пробник №2
# Дата: #Воскресенье #01Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17
# ❔ Без ответа: 22, 24, 26, 27
#
# Итог: 22/29 первичных балла ~ 83 вторичных

# endregion Пробник 2
