# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Задание номер 16
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:36]:
    A = int(f'RICAR', 36)
    B = int(f'PRINCE{x}A', 36)
    if (A + B) % 13 == 0:
        print((A + B) // 13)
'''


# Алгоритм вычисления значения функции
# F(n), где  n — натуральное число, задан так:
# F(n)=n при n<=1000;
# F(n)=n+2F(n−2)+6F(n−6) при n>1000.
# Чему равно значение выражения

# F(20024) − 2F(20022) − 3F(20020) + 18F(20014)?
'''
from functools import *

@lru_cache(None)
def F(n):
    if n <= 1000:
        return n
    if n > 1000:
        return n + 2 * F(n - 2) + 6 * F(n - 6)

for n in range(1, 40000):
    F(n)

print(F(20024) - 2 * F(20022) - 3 * F(20020) + 18 * F(20014))


F = [0] * 40000

for n in range(0, 40000):
    if n <= 1000:
        F[n] = n
    if n > 1000:
        F[n] = n + 2 * F[n - 2] + 6 * F[n - 6]

print(F[20024] - 2 * F[20022] - 3 * F[20020] + 18 * F[20014])
'''


# https://education.yandex.ru/ege/inf/task/397f6a09-6a70-4935-846f-e2fc72915ec9
'''
def F(a1, a2, x):
    B = 1 <= x <= 9999
    C = 3648 <= x <= 6287
    A = a1 <= x <= a2
    return ((B) == (C)) or (A) or (x > 4200)

R = []
M = [x / 4 for x in range(1 * 4, 9999 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(a1, a2, x) for x in M):
            R.append(a2 - a1)
print(min(R))
'''


print(bin(2028)[2:])  # 11111101100
print(int('1111110110000', 2))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = []
# на следующем уроке: Минимальное количество идущих подряд
