# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


print(16 * 24 + 253 * 399 - 19*13)

import turtle as t  # Подключение библиотеки с коротким именем
t.tracer(0)  # Отключения анимации
t.screensize(5000, 5000)  # Добавляет ползунки масшитабирования
t.left(90)  # Повернуть голову наверх согласно условию
t.down()  # Опустить хвост по условию
size = 30  # Переменная задает масштабирование окна отрисовки

# Тут переписываем псевдокод
for i in range(7):
    t.forward(15 * size)
    t.right(90)
    t.forward(23 * size)
    t.right(90)

t.color('green')
t.up()  # Поднять хвост
t.fd(3 * size)
t.rt(90)
t.fd(5 * size)
t.lt(90)
t.down()  # Опустить хвост

for i in range(7):
    t.forward(252 * size)
    t.right(90)
    t.forward(398 * size)
    t.right(90)

# Тут рисуем точки:
t.up()
for x in range(-50, 50):
    for y in range(-50, 50):
        t.goto(x * size, y * size)
        t.dot(3, 'red')

t.update()  # Для корректной работы t.tracer(0)
t.done()  # Зафиксировать итоговое окно отрисовки


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = []
# на следующем уроке: Минимальное количество идущих подряд
