# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Тип 24 №27686
# Определите длину самой длинной последовательности, состоящей из символов X.
# Хотя бы один символ X находится в последовательности.

# Вариант 1  ctrl + F
'''
s = open('files/24.txt').readline()
print(s)
print(len('XXXXXXXXXXXXXXXXXXX'))  # 19
'''

# Вариант 2
'''
s = open('files/24.txt').readline()
# s = 'YYXXXXYYYXXYYXXXXXYYXXXYYY'  # 5
cnt = 1
maxi = 0
for i in range(len(s) - 1):
    # if s[i] == 'X' and s[i+1] == 'X':
    if s[i:i+2] == 'XX':
        cnt += 1
        maxi = max(cnt, maxi)
    else:
        cnt = 1
print(maxi)
'''

# Вариант 3
'''
s = open('files/24.txt').readline()
# s = 'YYXXXXYYYXXYYXXXXXYYXXXYYY'  # 5
s = s.replace('Y', ' ').replace('Z', ' ')
print(max([len(x) for x in s.split()]))
'''


# Вариант 4
'''
from re import *
s = open('files/24.txt').readline()
# s = 'YYXXXXYYYXXYYXXXXXYYXXXYYY'  # 5
# print([x.group(0) for x in finditer(r'[X]+', s)])
print(max([len(x.group(0)) for x in finditer(r'[X]+', s)]))
'''


# Тип 24 №27690
# Определите максимальное количество идущих подряд символов,
# среди которых каждые два соседних различны.

# Вариант 2
'''
s = open('files/24.txt').readline()
cnt = 1
maxi = 0
for i in range(len(s) - 1):
    if s[i] != s[i+1]:
        cnt += 1
        maxi = max(maxi, cnt)
    else:
        cnt = 1
print(maxi)
'''

# Вариант 3
'''
s = open('files/24.txt').readline()
while 'AA' in s or 'BB' in s or 'CC' in s:
    s = s.replace('AA', 'A A')
    s = s.replace('BB', 'B B')
    s = s.replace('CC', 'C C')
print(max([len(x) for x in s.split()]))
'''

# Вариант 4
'''
from re import *
s = open('files/24.txt').readline()
print([x.group(0) for x in finditer(r'(AB)+|(BA)+|(BC)+|(CB)+|(AC)+|(CA)+', s)])
print(max([len(x.group(0)) for x in finditer(r'(AB)+|(BA)+|(BC)+|(CB)+|(AC)+|(CA)+', s)]))
'''


# Тип 24 №27689
# Определите максимальную длину цепочки вида XYZXYZXYZ...
# (составленной из фрагментов XYZ, последний фрагмент может быть неполным).

# Вариант 2
'''
s = open('files/24.txt').readline()
s = 'XYZXYZXYZXYZX'
cnt = 2
maxi = 0
for i in range(len(s) - 2):
    if cnt == 2 and s[i:i+3] in ('YZX', 'ZXY'):
        continue
    if s[i:i+3] in ('XYZ', 'YZX', 'ZXY'):
        cnt += 1
        maxi = max(cnt, maxi)
    else:
        cnt = 2
print(maxi)
'''


# Вариант 4
'''
from re import *
s = open('files/24.txt').readline()
# s = 'ZXYZXYZXYZXYZX'
print([x.group(0) for x in finditer(r'(XYZ)+(XY|X)', s)])
print(max([len(x.group(0)) for x in finditer(r'(XYZ)+(XY|X)', s)]))
'''


# № 23568 Пересдача 03.07.25 (Уровень: Средний)
'''
from re import *
s = open('files/24.txt').readline()
print(max([len(x.group(0)) for x in finditer(r'[A-Z][0-9]+[A-Z]', s) if x.group(0)[0] == x.group(0)[-1]]))
for e in [x.group(0) for x in finditer(r'[A-Z][0-9]+[A-Z]', s) if x.group(0)[0] == x.group(0)[-1] and len(x.group(0)) == 1952]:
    print(e)

# for i in range(len(s)-1953):
#     if s[i:i+1953] ==
#         print(i)

print(s.index('V025234222690673181322710784938692837677740041273841023659284535817277116593372232848482393991471558729988879211540122086256798251117737195646946442083314947634349261315270788525934716083981077408428559608797208781276037371160079157568247050048874690279682881995462857212502490814457899414912836431383460830098933682240689453891213325770210308437802244996375071864308198742589770543709076965627936143600066150020154347745514908690569786277836481726768968646483505819049953766780132725638379624506551872934224098531181255496308835034687328864753671778163589794231803947590286583152562597492164021549576789059297201505908761366770198316566080857443307740387284749682360305790989691439412331504601035433300008906826971995321395714579983731274927169819326445154321820531860074060934134560198416114901426166321089505737198716023597788408709301199909350677016981093396601327024671131131895810940575978946524526349151421590036270122963389585166567156276840818628612585771967661502018969767357266621478806412693106858816359949483897969900202603731632744093719753740844017662060547265382532691447000586460588389934349504202137136128488695366266749667092360401194241873998707147958301004884057992129655091111346576786196963079219490185402644652559940936919778473014039762271144161613710485782115075345929541208902523422269067318132271078493869283767774004127384102365928453581727711659337223284848239399147155872998887921154012208625679825111773719564694644208331494763434926131527078852593471608398107740842855960879720878127603737116007915756824705004887469027968288199546285721250249081445789941491283643138346083009893368224068945389121332577021030843780224499637507186430819874258977054370907696562793614360006615002015434774551490869056978627783648172676896864648350581904995376678013272563837962450655187293422409853118125549630883503468732886475367177816358979423180394759028658315256259749216402154957678905929720150590876136677019831656608085744330774V'))
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 7, 8, 9, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = []
# на следующем уроке: 16 номера через массив
