# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************




# № 29081 (Уровень: Средний)

from itertools import permutations
from math import dist
'''
cA = [[], []]
pA = [[], []]
'''

cB = [[], [], []]
pB = [[], [], []]

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        R.append([summa, p])
    return min(R)[1]

'''
for s in open('files/27A.txt'):
    s = s.replace(',', '.')
    x, y, z = [i for i in s.split()]
    x, y = float(x), float(y)
    if y > 10:
        cA[0].append([x, y])
        pA[0].append(z)
    else:
        cA[1].append([x, y])
        pA[1].append(z)
'''
# Проверка, длиный должны совпасть:
# print(len(cA[0]), len(pA[0]))
# print(len(cA[1]), len(pA[1]))


for s in open('files/27B.txt'):
    s = s.replace(',', '.')
    x, y, z = [i for i in s.split()]
    x, y = float(x), float(y)
    if y < 15:
        cB[0].append([x, y])
        pB[0].append(z)
    if y < 23 and y > 15:
        cB[1].append([x, y])
        pB[1].append(z)
    if y > 23:
        cB[2].append([x, y])
        pB[2].append(z)
# Проверка, длиный должны совпасть:
# print(len(cB[0]), len(pB[0]))
# print(len(cB[1]), len(pB[1]))
# print(len(cB[2]), len(pB[2]))


# Для файла А определите координаты центра каждого кластера, затем найдите два числа:
# A1 – минимальное расстояние от центра кластера до белого карлика из этого же кластера, и
# A2 – максимальное расстояние от центра кластера до белого карлика из этого же кластера.
'''
def A(cl, p, cent):
    R = []
    for i in range(len(cl)):
        if 'VII' in p[i] and 'III' not in p[i]:
            R.append(dist(cl[i], cent))
    return R

R1 = A(cA[0], pA[0], center(cA[0])) 
R2 = A(cA[1], pA[1], center(cA[1]))
A1 = min(R1 + R2)
A2 = max(R1 + R2)
print(int(A1 * 10000), int(A2 * 10000))  # 1495 16955
'''


# Для файла Б определите координаты центра каждого кластера, затем найдите два числа:
# B1 – минимальное расстояние между двумя звёздами с подклассом не менее 8,
# расположенными в различных кластерах, и
# B2 – cреднее расстояние между двумя различными звёздами с подклассом не менее 8,
# расположенными в одном кластере.

def B(cl, p):
    R = []
    for i in range(len(cl)):
        if p[i][1] in '89':
            R.append(cl[i])
    M = []
    for x in permutations(R, r=2):
        M.append(dist(x[0], x[1]))
    return M

R1 = B(cB[0], pB[0])
R2 = B(cB[1], pB[1])
R3 = B(cB[2], pB[2])
print(int(sum(R1 + R2 + R2) / len(R1 + R2 + R2) * 10000))




# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [23]
# на следующем уроке:



# region Пробник 2

# Вероника
# Пробник №2
# Дата: #Понедельник #02Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17,
# ❔ Без ответа: 22, 24, 26, 27
#
# Итог: 22/29 первичных балла ~ 83 вторичных


# Нестор
# Пробник №2
# Дата: #Воскресенье #01Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 17
# ❔ Без ответа: 22, 24, 26, 27
#
# Итог: 22/29 первичных балла ~ 83 вторичных

# endregion Пробник 2
