# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 25341 (Уровень: Базовый)
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (w == z) or (not(y <= w)) or (not x)
                if F == 0:
                    print(x, y, z, w, int(F))


# Вариант 2
from itertools import *
def F(x, y, z, w):
    return (w == z) or (not(y <= w)) or (not x)

for a1, a2, a3, a4, a5 in product([0, 1], repeat=5):
    table = [(a1, 0, 1, 0), (a2, 1, 1, a3), (0, a4, a5, 0)]
    if len(set(table)) == len(table):
        for i in permutations('xyzw'):
            if [F(**dict(zip(i , r))) for r in table] == [0, 0, 0]:
                print(*i)
'''


# № 20569 (Уровень: Базовый)
# (М. Попков) Максим заполнял таблицу истинности логической функции
# F=((w→z)≡(x→¬y))∧(x∨z), но успел заполнить лишь фрагмент из трёх различных
# её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.

print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((w <= z) == (x <= (not y))) and (x or z)
                if F == 0:
                    print(x, y, z, w, int(F))

for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = ((w <= z) == (x <= (not y))) and (x or z)
                if F == 1:
                    print(x, y, z, w, int(F))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 8, 9, 7, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке:
