# region Домашка: ******************************************************************
from tkinter.font import names

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Напишите программу, которая запрашивает у пользователя
# три числа и выводит следующие арифметические операции:
# разность первого и второго чисел, сумму первого и третьего числа,
# остаток от деления первого числа на второе.
# Результаты каждой операции должны быть выведены на экран,
# каждое на отдельной строке.
'''
a = int(input())
b = int(input())
c = int(input())
print(a - b)
print(a + c)
print(a % b)
'''


n = int(input())  # 18212
a = n // 10000
b = (n // 1000) % 10
c = (n % 1000) // 100
d = (n % 100) // 10
e = n % 10
print(a * b * c * d * e)
print(a + b + c + d + e)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
