# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************


# Через срезы мы можем брать четные/нечетные элементы и брать системы счисления меньше чем 36
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')  # 36
print(alp)  # ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
print(alp[15])  # F
print(alp[:2])  # ['0', '1']
print(alp[:8])  # ['0', '1', '2', '3', '4', '5', '6', '7']
print(alp[0::2])  # ['0', '2', '4', '6', '8', 'A', 'C', 'E', 'G', 'I', 'K', 'M', 'O', 'Q', 'S', 'U', 'W', 'Y']
print(alp[1::2])  # ['1', '3', '5', '7', '9', 'B', 'D', 'F', 'H', 'J', 'L', 'N', 'P', 'R', 'T', 'V', 'X', 'Z']

x = 5
print(f'27x98876')  # 27x98876
print(f'27{x}98876')  # 27598876
'''
from statistics import kde_random

# №31511 Демоверсия 2027(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:22]:
    A = int(f'27{x}98876', 22)
    B = int(f'26{x}51', 22)
    C = int(f'711{x}5', 22)
    if (A + B + C) % 21 == 0:
        print(x, (A + B + C) // 21)
        # 3 276296118
        # A 278014164
        # H 279732210
'''



# № 31222 Резерв 22.06.26(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:19]:
    A = int(f'76{x}79645', 19)
    B = int(f'35{x}42', 19)
    C = int(f'332{x}6', 19)
    if (A + B + C) % 18 == 0:
        print((A + B + C) // 18)
        # 363399516
        # 364225009
        # 365050502
        # 365875995
'''




# № 19359 (Уровень: Базовый)
# (О. Лысенков) Операнды арифметического выражения записаны в системе
# счисления с основанием 22.
# A23xAC0_22 + GBx21670_22

# В записи чисел переменной x обозначена неизвестная цифра из
# алфавита 22-ричной системы счисления. Определите наибольшее
# значение x, при котором значение данного арифметического выражения
# кратно 21.
# Для найденного x вычислите частное от деления значения арифметического
# выражения на 22 и укажите его в ответе в десятичной системе счисления.
''''''


'''
def convert(n, b):
    alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

n = 100000000
b = 16
print(convert(n, b))  # 5F5E100

print(int('5F5E100', 16))  # 100000000
# ValueError: int() base must be >= 2 and <= 36, or 0
'''



# № 31513 Демоверсия 2027(Уровень: Базовый)

# Вариант 1
'''import sys
sys.setrecursionlimit(10**8)'''

# Вариант 2
'''
from functools import *

@lru_cache(None)
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

for n in range(3100):
    F(n)

print((F(3038) + 5 * F(3037)) // F(3036))
'''
#   [Previous line repeated 996 more times]
# RecursionError: maximum recursion depth exceeded



# № 29970 Апробация 14.05.26(Уровень: Базовый)
'''
from functools import *

@lru_cache(None)
def F(n):
    return 3 * G(n - 3) + 7

@lru_cache(None)
def G(n):
    if n <= 20:
        return n + 2
    if n > 20:
        return G(n - 3) + 1

for n in range(38000):
    G(n)

print(F(37811))
'''



# № 27771 Апробация 04.03.26(Уровень: Базовый)
'''
from functools import *

@lru_cache(None)
def F(n):
    if n== 1:
        return 1
    if n > 1:
        return n * F(n - 1)

for n in range(2025):
    F(n)
    
print((F(2024) - 2 * F(2023)) / F(2022))
'''



# endregion Урок: *************************************************************
# #
# #
# 2027
# ФИПИ = [1, 5, 14]
# КЕГЭ = []
#
# 2026
# ФИПИ = [1, 2, 3, 5, 8, 11, 10, 13, 14, 15, 16, 17, 18, 19-21, 22]
# КЕГЭ = [1, 2, 3, 12, 10]
# на следующем уроке: Добиваем 3 прототип 14 номера
