# region Домашка: ******************************************************************



# № 31512 Демоверсия 2027(Уровень: Базовый)
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 22 != 0))

RES = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 31164 Основная волна 19.06.26(Уровень: Базовый)
'''
def F(x, a1, a2):
    B = 32 <= x <= 425
    C = 130 <= x <= 480
    D = 290 <= x <= 575
    A = a1 <= x <= a2
    return ((C) <= (not D) and (A) and (not B))

RES = []
M = [x for x in range(20, 600)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) == 0 for x in M):
            RES.append(a2 - a1)
print(max(RES))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************

# № 23755 Демоверсия 2026(Уровень: Базовый)
# На числовой прямой даны два отрезка: P = [25; 64] и Q = [40; 115].
# Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
#  (x∈P) → (((x∈Q) ∧ ¬(x∈A)) → ¬(x∈P))
# истинно (т.е. принимает значение 1) при любом значении переменной х.
'''
def F(x, a1, a2):
    P = 25 <= x <= 64
    Q = 40 <= x <= 115
    A = a1 <= x <= a2
    return (P) <= (((Q) and (not A)) <= (not P))

RES = []
M = [x / 4 for x in range(20 * 4, 120 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(int(min(RES)))  # 24.0 -> 24
'''

'''
# № 21710 ЕГКР 19.04.25(Уровень: Базовый)
# На числовой прямой даны два отрезка: B = [36; 75] и C = [60; 110].
# Укажите наименьшую возможную длину такого отрезка , что логическое выражение  
# ¬(x∈A)→((x∈B)≡(x∈C))
#  истинно (т.е. принимает значение 1) при любом значении переменной х.

def F(x, a1,a2):
    B = 36 <= x <= 75 
    C = 60 <= x <= 110
    A = a1 <= x <= a2
    return (not A) <= ((B) == (C))

RES =[]
M = [x/4 for x in range(30*4,120*4)]
for a1 in M:
    for a2 in M:
        if all(F(x,a1,a2) for x in M):
            RES.append(a2 - a1)
print(int(min(RES)))
            '''


# № 20961 (Уровень: Базовый)
# (М. Попков) На числовой прямой даны два отрезка:
# P=[15;142] и Q=[38;167]. Укажите наименьшую возможную длину такого отрезка
# A, для которого логическое выражение ¬((x∈Q) → ((¬(x∈A) ∧ (x∈P)) → ¬(x∈Q)))
# ложно (т.е. принимает значение 0) при любом значении переменной x.

# ¬((x∈Q) → ((¬(x∈A) ∧ (x∈P)) → ¬(x∈Q)))

def F(x, a1, a2):
    P = 15 <= x <= 142
    Q = 38 <= x <= 167
    A = a1 <= x <= a2
    return (not ((Q) <= (((not A) and (P)) <= (not Q))))

RES = []
M = [x / 4 for x in range(10 * 4, 170 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) == 0 for x in M):
            RES.append(a2 - a1)
print(int(min(RES)))

# endregion Урок: *************************************************************
# #
# #
# 2027
# ФИПИ = [1, 5, 14, 15, 16]
# КЕГЭ = []
# на следующем уроке: 2 надо рассмотреть

#
# 2026
# ФИПИ = [1, 2, 3, 5, 8, 11, 10, 13, 14, 15, 16, 17, 18, 19-21, 22]
# КЕГЭ = [1, 2, 3, 12, 10]
