# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************

# ¬х   (not x)
#  →    <=
#  ∧    and
#  ∨    or
#  ≡    ==

# № 23561 Пересдача 03.07.25 (Уровень: Базовый)
# Для какого наибольшего натурального числа А выражение
# ДЕЛ(х,128) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,80))
# истинно (т.е. принимает значение 1) при любом натуральном значении переменной х?


# Вариант 1  # 0.64752
'''
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

for A in range(1, 10000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''




# Вариант 2   11.9673
'''
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

for A in range(1, 10000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        print(A)
'''

# Вариант 3  0.571
'''
def F(x, A):
    return (x % 128 == 0) <= ((x % A != 0) <= (x % 80 != 0))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''


# № 23374 Резервный день 19.06.25 (Уровень: Базовый)
# Для какого наименьшего целого положительного числа А выражение
# (x<A) ∧ (y<3A) ∨ (2x+y>128)
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?
'''
def F(x, y, A):
    return (x < A) and (y <3*A) or (2*x + y > 128)

for A in range(1, 10000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        print(A)
        break
'''


# № 21901 Открытый вариант 2025 (Уровень: Базовый)
'''
def F(x, A):
    return ((x & 52 != 0) and (x & 48 == 0)) <= (x & A != 0)
    # return ((x & 52 != 0) and (x & 48 == 0)) <= (not(x & A == 0))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


# № 21414 Досрочная волна 2025 (Уровень: Базовый)
# Для какого наименьшего целого неотрицательного числа А логическое выражение
# (5<y) ∨ (x>32) ∨ (x+2y<A)
# тождественно истинно (т.е. принимает значение 1) при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return ((5 < y) or (x > 32) or (x + 2 * y < A))


R = []
for A in range(1, 10000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        R.append(A)
print(min(R))
'''


# № 20809 Апробация 05.03.25 (Уровень: Базовый)
# B = [60,80].
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(x,А) ∨ ((x∈B) → ¬ДЕЛ(x,22))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?
'''
def F(x, A):
    B = 60 <= x <= 80
    return (x % A == 0) or ((B) <= (x % 22 != 0))


R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(max(R))
'''


# № 20823 (Уровень: Базовый)
# Найдите минимальное натуральное значение А, при котором значение выражения
# (x&A=0) → ((x&77=0) ∧ (x&44=0))
# тождественно истинно, то есть принимает значение 1 при любом натуральном значении х.
'''
def F(x, A):
    return ((x & A == 0)) <= ((x & 77==0) and (x & 44==0))


R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(min(R))
'''


# № 19485 (Уровень: Базовый)
# B=[170;220]
# Определите количество натуральных значений A, при которых формула
# ДЕЛ(x,A)∨((x∈B)→¬ДЕЛ(x,24))
# тождественно истинна (т.е. принимает значение 1) при любом натуральном значении переменной x?
'''
def F(x, A):
    B = 170 <= x <= 220
    return ((x % A == 0)) or ((B) <= (x % 24 != 0))

R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)
print(len(R))
'''

def F(x, a1, a2):
    P = 17 <= x <= 58
    Q = 29 <= x <= 80
    A = a1 <= x <= a2
    return (P) <= (((Q) and (not A)) <= (not P))

R = []
M = [x / 4 for x in range(10 * 4, 90 * 4)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))

# 29.0 -> 29


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [5, 14, 15, 16, 23, 19-21]
# КЕГЭ = []
# на следующем уроке: 2
