# region Домашка: ******************************************************************

# КЕГЭ № 6588 Пробник ИМЦ СПб (Уровень: Средний)
# https://stepik.org/lesson/1038432/step/4?unit=1060804
'''
RES = []
for n in range(1, 10000):
    n2 = f'{n:b}'
    n2 = n2.replace('0', '*')
    n2 = n2.replace('1', '0')
    n2 = n2.replace('*', '1')
    n2 = '1' + n2
    if n2.count('1') % 2 != 0:
        n2 = n2 + '1'
    else:
        n2 = n2 + '0'
    r = int(n2, 2)
    if r > 180:
        RES.append(n)
print(min(RES))
'''


# КЕГЭ № 17624 Основная волна 19.06.24 (Уровень: Базовый)
# 📎 https://stepik.org/lesson/1038432/step/5?unit=1060804
'''
RES = []
for n in range(1,1000):
    n2 = bin(n)[2:]
    for i in range(2):
        summa = sum(map(int, n2))
        n2 = n2 + str(summa % 2)

    r = int(n2, 2)
    if r > 75:
        RES.append(r)
print(min(RES))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************

# Через срезы мы можем брать четные/нечетные элементы и брать системы счисления меньше чем 36

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alp)  # ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
print(alp[15])  # F
print(alp[:2])  # ['0', '1']
print(alp[:8])  # ['0', '1', '2', '3', '4', '5', '6', '7']
print(alp[0::2])  # ['0', '2', '4', '6', '8', 'A', 'C', 'E', 'G', 'I', 'K', 'M', 'O', 'Q', 'S', 'U', 'W', 'Y']
print(alp[1::2])  # ['1', '3', '5', '7', '9', 'B', 'D', 'F', 'H', 'J', 'L', 'N', 'P', 'R', 'T', 'V', 'X', 'Z']




# № 17869 Демоверсия 2025(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

n = 3 * 3125 ** 8 + 2 * 625 ** 7 - 4 * 625 ** 6 + 3 * 125 ** 5 - 2 * 25**4 - 2025
n25 = convert(n, 25)
print(n25.count('0'))  # Сколько значащих нулей сдержится в этой записи
print(len([x for x in n25 if x in alp[0::2]]))  # Определите количество цифр с чётным числовым значением
print(len([x for x in n25 if x in alp[0::2] and x > '9'])) # Определите количество цифр с чётным числовым значением, превышающим 9.
print(len([x for x in n25 if x in alp[0::2] and x > alp[15]])) # Определите количество цифр с чётным числовым значением, превышающим 15.
'''


# № 17870 Демоверсия 2025(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

RES = []
for x in range(1, 2030):
    n = 7 ** 170 + 7 ** 100 - x
    n7 = convert(n, 7)
    if n7.count('0') == 71:
        RES.append(x)
print(max(RES))
'''

# № 31121 Основная волна 18.06.26(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

RES = []
for x in range(1, 2030):
    n = 5 ** 150 + 5 ** 100 - x
    n5 = convert(n, 5)
    RES.append(n5.count('0'))   # 54
    if n5.count('0') == 54:
        print(x)

print(max(RES))
'''




# № 12246 ЕГКР 16.12.23(Уровень: Базовый)
# Определите количество ненулевых цифр в девятеричной записи числа
# 2*729 ** 333 + 2*243 ** 334 - 81**335 + 2*27 ** 336 − 2 * 9**337 - 338
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

n = 2*729 ** 333 + 2*243 ** 334 - 81**335 + 2*27 ** 336 − 2 * 9**337 - 338
n9 = convert(n,9)
print(len(n9) - n9.count('0'))
'''

# № 9161 Джобс 06.06.2023(Уровень: Базовый)
# Значение выражения 7*5**123 + 6*5**111 - 5*25**50 + 4*125**30 - 3*5**10
# записали в пятеричной системе счисления. Найдите количество цифр 4 в этой записи.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

n = 7 * 5 ** 123 + 6 * 5 ** 111 - 5 * 25 ** 50 + 4 * 125 ** 30 - 3 * 5 ** 10
n5 = convert(n, 5)
print(n5.count('4'))
'''

# № 17527 Основная волна 07.06.24(Уровень: Базовый)
# Значение арифметического выражения 3**100 - x, где х — целое положительное число,
# не превышающее 2030, записали в троичной системе счисления.
# Определите наибольшее значение х, при котором в троичной записи числа,
# являющегося значением данного арифметического выражения, содержится ровно пять нулей.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r

RES = []
for x in range(1,2030):
    n = 3**100 - x
    n3 = convert(n, 3)
    if n3.count('0') == 5:
        RES.append(x)
print(max(RES))
'''

# endregion Урок: *************************************************************
# #
# #
# 2027
# ФИПИ = [1, 5, 14]
# КЕГЭ = []
#
# 2026
# ФИПИ = [1, 2, 3, 5, 8, 11, 10, 13, 14, 15, 16, 17, 18, 19-21, 22]
# КЕГЭ = [1, 2, 3, 12, 10]
# на следующем уроке: Добиваем 3 прототип 14 номера
