# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************



#  ¬x     (not x)
# x ∧ y    x and y
# x ∨ y    x or y
# x → y    x <= y


# № 31361 Пересдача 08.07.26(Уровень: Базовый)
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без
# остатка на натуралиное число m». Для какого наибольшего натурального
# числа А логическое выражение ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?
'''
def F(x, A):  # ДЕЛ(х,33) → (¬ДЕЛ(х,А) → ¬ДЕЛ(х,242))
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

RES = []
for A in range(1, 10000):
    if all(F(x, A) == False for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 31122 Основная волна 18.06.26(Уровень: Базовый)
'''
def F(x, A):  # ДЕЛ(х,А)∨((х∈В)→¬ДЕЛ(х,16))
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 16 != 0))

RES = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 22433 (Уровень: Базовый)
'''
def F(x, A):  # ¬(x&117=0)∧(x&91=0)→¬(x&А=0)
    return ((x & 117 != 0) and (x & 91 == 0)) <= (x & A != 0)

RES = []
for A in range(0, 1000):
    if all(F(x, A) for x in range(0, 10000)):
        RES.append(A)
print(min(RES))
'''


# № 21901 Открытый вариант 2025(Уровень: Базовый)
'''
def F(x, A):  # ((x&52!=0)∧(x&48=0))→¬(x&А=0)
    return ((x & 52 != 0) and (x & 48 == 0)) <= (x & A != 0)

RES = []
for A in range(0, 1000):
    if all(F(x, A) for x in range(0, 10000)):
        RES.append(A)
print(min(RES))
'''


# № 29969 Апробация 14.05.26(Уровень: Базовый)
# Для какого наибольшего целого неотрицательного числа А выражение
# (x>A)∨(y>A)∨(x+2y<80)
# истинно (т.е. принимает значение 1) при любых целых неотрицательных х и у?
'''
def F(x, y, A):
    return (x>A) or (y>A) or (x+2*y < 80)

RES = []
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        RES.append(A)
print(max(RES))
'''



# № 29347 Открытый вариант 2026(Уровень: Базовый)
'''
def F(x, a1, a2):  # ¬(x ∈ A) → ((x ∈ B) ≡ (x ∈ C))
    B = 22 <= x <= 40
    C = 32 <= x <= 50
    A = a1 <= x <= a2
    return (not A) <= ((B) == (C))

RES = []
M = [x / 5 for x in range(10 * 5, 60 * 5)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 28.0 -> 28 
'''


# № 12469 (Уровень: Базовый)
'''
def F(x, a1, a2):
    D = 7 <= x <= 68
    C = 29 <= x <= 100
    A = a1 <= x <= a2
    return (D) <= (((not C) and (not A)) <= (not D))

RES = []
M = [x / 10 for x in range(1 * 10, 110 * 10)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))  # 21.75 -> 21.8 -> 21.9 -> 22
'''


# № 12247 ЕГКР 16.12.23(Уровень: Базовый)
# Для какого наибольшего целого положительного числа А выражение
# (x&А=0) ∨ ¬(x&37=0) ∨ ¬(x&12=0) тождественно истинно, то есть принимает
# значение 1 при любых целых положительных х?
'''
def F(x, A):
    return (x & A == 0) or (x & 37 != 0) or (x & 12 != 0)

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''

# endregion Урок: *************************************************************
# #
# #
# 2027
# ФИПИ = [1, 5, 14, 15, 16]
# КЕГЭ = []
# на следующем уроке: 2 надо рассмотреть

#
# 2026
# ФИПИ = [1, 2, 3, 5, 8, 11, 10, 13, 14, 15, 16, 17, 18, 19-21, 22]
# КЕГЭ = [1, 2, 3, 12, 10]
