# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************


# № 31502 Демоверсия 2027(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# Алгоритм строит по нему новое число R следующим образом.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если число N чётное, то к этой записи справа и слева дописываются по две единицы;
# б) если число N нечётное, то в конец двоичной записи (справа) дописываются два нуля,
# а в начало (слева) дописывается единица.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите наименьшее число R, превышающее 95, которое может быть результатом
# работы данного алгоритма. В ответе запишите это число в десятичной системе счисления.
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    if n % 2 == 0:
        n2 = '11' + n2 + '11'
    else:
        n2 = '1' + n2 + '00'
    r = int(n2, 2)
    if r > 95:
        RES.append(r)
print(min(RES))
'''

# № 31351 Пересдача 08.07.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# Алгоритм строит по нему новое число R следующим образом.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если сумма цифр в двоичной записи числа чётная, то к этой записи справа
# дописывается 0, а затем два левых разряда заменяются на 10;
# б) если сумма цифр в двоичной записи числа нечётная, то к этой записи справа
# дописывается 1, а затем два левых  разряда заменяются на 11.
# Полученная таким образом запись является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число N, после обработки которого с помощью этого алгоритма
# получается число R, не меньшее 16. В ответе запишите это число в десятичной системе счисления.
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    if n2.count('1') % 2 == 0:
        n2 = '10' + n2[2:] + '0'
    else:
        n2 = '11' + n2[2:] + '1'
    r = int(n2, 2)
    if r >= 16:
        RES.append(n)
print(min(RES))
'''


# № 31213 Резерв 22.06.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# Алгоритм строит по нему новое число R следующим образом.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующемук правилу:
# a) если число чётное, то к двоичной записи чис. а слева дописывается 10;
# б) если число нечётное, то к двоичной записи числа слева дописывается 1
# и справа дописывается 01.
# Полученная таким образом запись является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное число R, которое может быть результатом работы данного
# алгоритма, при условии, что N не меньше 17. В ответе запишите это число
# в десятичной системе счисления.
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    if n % 2 == 0:
        n2 = '10' + n2
    else:
        n2 = '1' + n2 + '01'
    r = int(n2, 2)
    if n >= 17:
        RES.append(r)
print(min(RES))

# Вариант 2
def convert(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]

RES = []
for n in range(1, 10000):
    n2 = convert(n, 2)
    if n % 2 == 0:
        n2 = '10' + n2
    else:
        n2 = '1' + n2 + '01'
    r = int(n2, 2)
    if n >= 17:
        RES.append(r)
print(min(RES))
'''

# Встроенные функции перевода
'''
n = 1000
print(bin(n))  # 0b1111101000 - Перевод в двоичную систему счисления
print(bin(n)[2:])  # 1111101000 - Перевод в двоичную систему счисления
print(oct(n)[2:])  # 1750 - Перевод в восьмеричную систему счисления
print(hex(n)[2:])  # 3e8 - Перевод в 16-ю систему счисления

print(f'{n:b}') # 1111101000

print(f'Способ перевода в двоичную систему: {n:b}')  # 1111101000
print(f'Способ перевода в двоичную систему: {n:o}')  # 1750
print(f'Способ перевода в двоичную систему: {n:x}')  # 3e8
'''




# № 27274 (Уровень: Базовый)
#  На вход алгоритма подаётся натуральное число N.
#  Алгоритм строит по нему новое число R следующим образом.
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
#   а) если число N делится на 7, то к этой записи дописывается справа 01;
#   б) если число N на 7 не делится, то результат целочисленного деления N на 7
#   переводится в двоичную систему счисления и дописывается в конец числа.
# Полученная таким образом запись является двоичной записью искомого числа R.

# Укажите максимальное нечётное число N, для которого с помощью описанного
# алгоритма получается число, не большее 1300. В ответе запишите это число
# в десятичной системе счисления.
'''
RES = []
for n in range(1, 10000):
    n2 = bin(n)[2:]
    if n % 7 == 0:
        n2 = n2 + '01'
    else:
        n2 = n2 + bin(n // 7)[2:]
    r = int(n2, 2)
    if r <= 1300 and n % 2 != 0:
        RES.append(n)
print(max(RES))


RES = []
for n in range(1, 10000):
    n2 = f'{n:b}'
    if n % 7 == 0:
        n2 = n2 + '01'
    else:
        n2 = n2 + f'{n // 7:b}'
    r = int(n2, 2)
    if r <= 1300 and n % 2 != 0:
        RES.append(n)
print(max(RES))
'''



# № 25344 ЕГКР 13.12.25(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# Алгоритм строит по нему новое число R следующим образом.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то к этой записи справа дописываются две
# последние троичные цифры;
# б) если число N на 3 не делится, то вычисляется сумма цифр полученной
# троичной записи, эта сумма умножается на 3, переводится в троичную систему
# счисления дописывается в конец числа.

# Укажите минимальное нечётное число R, большее 208, которое может быть получено
# с помощью описанного алгоритма.
# В ответе запишите это число в десятичной системе счисления.

def convert(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]

RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = n3 + n3[-2:]
    else:
        summa = sum(map(int, n3))
        n3 = n3 + convert(summa * 3, 3)
    r = int(n3, 3)
    if r > 208 and r % 2 != 0:
        RES.append(r)
print(min(RES))






# endregion Урок: *************************************************************
# #
# #
# 2027
# ФИПИ = [1, 5]
# КЕГЭ = []
#
# 2026
# ФИПИ = [1, 2, 3, 5, 8, 11, 10, 13, 14, 15, 16, 17, 18, 19-21, 22]
# КЕГЭ = [1, 2, 3, 12, 10]
# на следующем уроке:
