# region Домашка: ******************************************************************

# https://stepik.org/lesson/1038706/step/3?unit=1062774
'''
def F(x, a1, a2):
    P = 13 <= x <= 19
    Q = 17 <= x <= 23
    A = a1 <= x <= a2
    return (not((not P) <= (Q))) <= ((A) <= ((not Q) <= (P)))

R = []
M = [x / 4 for x in range(5 * 4, 30 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(int(max(R)))  # 10.0 -> 10
'''


# Егор № 17528 Основная волна 07.06.24 (Уровень: Базовый)
# https://stepik.org/lesson/1038706/step/13?unit=1062774
# На числовой прямой даны два отрезка: P=[15;40] и Q=[21;63].
# Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
# истинно (т.е. принимает значение 1) при любом значении переменной х.
# (x∈P) → (((x∈Q) ∧ ¬(x∈A))→¬(x∈P))
'''
def F(x, a1, a2):
    P = 15 <= x <= 40
    Q = 21 <= x <= 63
    A = a1 <= x <= a2
    return (P) <= (((Q) and (not A)) <= (not P))

R = []
M = [x / 4 for x in range(5 * 4, 80 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(int(min(R)))
'''


# Никита № 2356 (Уровень: Базовый)
# https://stepik.org/lesson/1038706/step/8?unit=1062774
# На числовой прямой даны два отрезка: P = [10, 45] и Q = [35, 78].
# Найдите наименьшую возможную длину отрезка A, при котором формула
# (¬(x∈P)→(x∈Q))∧¬(x∈A)
# тождественно ложна, то есть принимает значение 0 при любых x.
'''
def F(x, a1, a2):
    P = 10 <= x <= 45
    Q = 35 <= x <= 78
    A = a1 <= x <= a2
    return ((not P) <= (Q)) and (not A)

R = []
M = [x / 4 for x in range(5 * 4, 90 * 4)]
for a1 in M:
    for a2 in M:
        if all(not F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(int(min(R)))
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: *************************************************************


# № 25341 (Уровень: Базовый)
# F=(w≡z)∨¬(y→w)∨¬x
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (w == z) or (not(y <= w)) or (not x)
                if F == 0:
                    print(x, y, z, w)
'''


# № 23739 Демоверсия 2026 (Уровень: Базовый)
# Миша заполнял таблицу истинности логической функции
# F=(x∨y)∧¬(y≡z)∧¬w
'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (x or y) and (not(y == z)) and (not w)
                if F == 1:
                    print(x, y, z, w)
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 14, 15, 16, 23, 19-21]
# КЕГЭ = []
# на следующем уроке:
