# region Домашка: ******************************************************************

# https://education.yandex.ru/ege/task/6f3cbabe-5d81-415e-8f8f-2f6c1c3ff308
'''
s = open("files/24.txt").readline()
s = s.replace("R", "D").replace("8", "1")
s = s.replace("11D", "*")
s = s.replace('D', ' ').replace('1', ' ')
print(max([len(x) for x in s.split()]))
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
