# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************
'''
pixels = 1024 * 512
i = 4 * 8
# V = pixels * i
V = pixels * i  # бит

print(V / 32768)  # 512.0
'''


'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5]
B = [x for x in M if abs(x) % 100 == 29]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 2:
        if (x + y + z) <= max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ = []
# на следующем уроке: 5 на системы счисления >2


# Первый пробник 21.12.24:
# Николай 9/19 -> 48 вторичных баллов +[1, 2, 4, 7, 13, 14, 16, 23, 25] -[5, 6, 8, 9, 12, 15, 17, 24]

# Второй пробник 28.02.25:
# Николай 12/19 -> 56 вторичных баллов +[1-4, 8-10, 12, 13, 15, 16, 23] -[5, 6, 14, 17, 18-22, 24, 25]
