# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 15413 (Уровень: Средний)
# (А. Вдовин) Найдите количество четырехзначных чисел в девятеричной системе счисления,
# в которых есть ровна одна цифра 8, а сумма цифр слева от нее равна сумме цифр справа от нее.
# Примечание: если слева или справа от 8 цифр нет, то сумма считается равной нулю
'''
from itertools import *
cnt = 0
for p in product('012345678', repeat=4):
    num = ''.join(p)
    if num[0] != '0':
        if num.count('8') == 1:
            i = num.index('8')
            summa_left = sum(map(int, num[:i]))
            summa_right = sum(map(int, num[i+1:]))
            if summa_left == summa_right:
                cnt += 1
print(cnt)
            # print(summa_left, num, summa_right)
            # i 0123
            #   2840  i = num.index('8') == 1
            # num[:i] num[i+1:]
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке: 9 - практика


# Первый пробник 21.12.24:
# Николай 9/19 -> 48 вторичных баллов +[1, 2, 4, 7, 13, 14, 16, 23, 25] -[5, 6, 8, 9, 12, 15, 17, 24]
