# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Единицы измерения памяти
# 1 бит - минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# --------------------------
# 7 байт = 7 * 2**3 бит    -
# 48 бит = 48 / 2**3 байт  -
# --------------------------
# 1 Кбайт = 1024 байт = 2**10 байт = 2**13 бит
# 1 Мбайт = 1024 Кбайт = 2**20 байт = 2**23 бит
# 1 Гбайт = 1024 Мбайт = 2**30 байт = 2**33 бит


# https://education.yandex.ru/ege/task/84474de4-f07d-4ab8-b168-ac9b7928cab6
'''
V = 16  # байт
V = V * 2**3  # бит
print(V / 40)  # 3.2 - пакета
'''


# V = pixels * i  (где i - это кол-во бит на один пиксель)
# colors = 2 ** i

# https://education.yandex.ru/ege/task/c4adfb30-2b1d-4601-869e-d52ed7dab6cb
'''
pixels = 1024 * 768
V_27 = 1_638_400 * 220  # бит
V = V_27 / 27
i = V / pixels
print(i)  # 16.97530
print(2 ** 16)
'''


# https://education.yandex.ru/ege/task/5511c181-ed14-4583-aadc-4a8a2d07ecd0
'''
pixels = 640*480
V = 40
V = V * 2**13  # бит
i = V / pixels
print(i)  # 1.0666
print(2**1)
'''


# https://education.yandex.ru/ege/task/e0309b53-310b-4c80-a557-c75800407e4c

pixels = 1440 * 900
colors = 2048  # i = 11
i = 11
V = pixels * i  # бит
V_256 = V * 256
V_256_32 = V_256 * 32
U = 21600 * 2**13
t = (V_256_32 / U) / 60
print(t)  # 11.0

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
