# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
from itertools import product, permutations

for p in permutations('123'):
    print(p)
    # ('1', '2', '3')
    # ('1', '3', '2')
    # ('2', '1', '3')
    # ('2', '3', '1')
    # ('3', '1', '2')
    # ('3', '2', '1')

for p in permutations('123', 2):
    print(p)
    # ('1', '2')
    # ('1', '3')
    # ('2', '1')
    # ('2', '3')
    # ('3', '1')
    # ('3', '2')

for p in product('123', repeat=100):
    print(p)
    # ('1', '1', '1')
    # ('1', '1', '2')
    # ('1', '1', '3')
    # ('1', '2', '1')
    # ('1', '2', '2')
    # ('1', '2', '3')
    # ('1', '3', '1')
    # ('1', '3', '2')
    # ('1', '3', '3')
    # ('2', '1', '1')
    # ('2', '1', '2')
    # ('2', '1', '3')
    # ('2', '2', '1')
    # ('2', '2', '2')
    # ('2', '2', '3')
    # ('2', '3', '1')
    # ('2', '3', '2')
    # ('2', '3', '3')
    # ('3', '1', '1')
    # ('3', '1', '2')
    # ('3', '1', '3')
    # ('3', '2', '1')
    # ('3', '2', '2')
    # ('3', '2', '3')
    # ('3', '3', '1')
    # ('3', '3', '2')
    # ('3', '3', '3')
'''


# Тип 8 №39237
'''
# Вариант 1
s = sorted('АВТОР')
num = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                slovo = a + b + c + d
                num += 1
                if slovo == 'ТАРА':
                    print(num, slovo)

# Вариант 2
from itertools import *
num = 0
for p in product(sorted('АВТОР'), repeat=4):
    slovo = ''.join(p)
    num += 1
    if slovo == 'ТАРА':
        print(num, slovo)
'''


# Тип 8 №18586
'''
# Вариант 1
s = 'СВЕТА'
cnt = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    slovo = a + b + c + d + e
                    if slovo.count('С') >= 1:
                        cnt += 1
print(cnt)

# Вариант 2
from itertools import *
cnt = 0
for p in product('СВЕТА', repeat=5):
    slovo = ''.join(p)
    if slovo.count('С') >= 1:
        cnt += 1
print(cnt)
'''


# Тип 8 №59741
# Сколько существует чисел, восьмеричная запись которых содержит 5 цифр,
# причем в записи нет цифры 1.
# Также все цифры записи различны и никакие две чётные и две нечётные цифры не стоят рядом.

s = '01234567'
cnt = 0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    num = a + b + c + d + e
                    if a != '0' and '1' not in num:
                        if len(num) == len(set(num)):
                            num = num.replace('0', '2').replace('4', '2').replace('6', '2')
                            num = num.replace('3', '1').replace('5', '1').replace('7', '1')
                            if '11' not in num and '22' not in num:
                                cnt += 1
print(cnt)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6, 8, 12]
# КЕГЭ  = []
# на следующем уроке:
