# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

#  № 17548 Основная волна 08.06.24 (Уровень: Базовый)
'''
# V = pixels * i (бит на один пиксель)
pixels = 1024 * 960
colors = 2048  # 2**i >= colors
i = 11  # бит на один пиксель
V_1 = pixels * i  # вес одной картинки

V_s = 96_468_992 * 280  # бит
print(V_s / V_1)  # 2497.9393
'''


# 1 бит
# 1 байт = 8 бит = 2**3 бит
# 1 Кбайт = 1024 байт = 2**10 байт = 2**13 бит

# № 16373 ЕГКР 27.04.24 (Уровень: Базовый)

# colors = 2 ** i
# V = pixels * i
'''
pixels = 1280 * 960
V = 920 * 1024 * 8  # бит
V = V*1.15
i = V / pixels
print(i)

print(2**7)
'''

# i = 2: 2**i = 4 [3-4]
# i = 3: 2**3 = 8 [5-8]
# i = 4: 2**4 = 16 [9-16]
# i = 5: 2**5 = 32 [17-32]
# i = 6: 2**6 = 64 [33-64]


# № 17524 Основная волна 07.06.24 (Уровень: Средний)
'''
alphabet = 10+52*2+458
print(2**10)  # 2**9 < 572 < 2**10
i = 10


byte = (276 * 1024) / 862  # 327.87006
byte = 327
bit = byte * 8

symbols = bit / i
print(symbols)  # 261.6
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1+, 2*+, 3, 4+, 6+, 7, 9*+, 10+, 11, 18+, 19-21, 22+]
# КЕГЭ  = [2, 3, 5, 7, 11, 12, 14, 15, 16, 23]
# на следующем уроке:
