# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Строковый тип данных str()
'''
# i  01234
s = 'abcde'

print(f'Первый элемент строки s: {s[0]}')
print(f'Последний элемент строки s: {s[-1]}')
'''

# Срезы строк:
'''
print(s[2:4])  # cd
print(s[:4])  # abcd - все элементы до 4 индекса (не включая)
print(s[2:])  # cde - все элементы после 2 индекса (включая)
print(s[::-1])  # edcba - в обратном порядке 
'''

# Функции строк:
'''
s = 'abcde01234ABCDE'
print(len(s))  # 10
print(max(s))   # e
print(sorted(s))  # ['0', '1', '2', '3', '4', 'A', 'B', 'C', 'D', 'E', 'a', 'b', 'c', 'd', 'e']

s = 'aaaabbbccc'
print(set(s))  # {'a', 'c', 'b'}
'''


# Методы строк (Методы - те же функции, но на определенный тип данных)
'''
s = 'hello, world!'

print(s.count('l'))  # 3
print(s.index('l'))  # 2
print(s.rindex('l'))  # 10

s = s.replace('l', '*')  # мы заменили все 'l' на '*'
print(s)  # he**o, wor*d!
s = s.replace('*', '+', 2)  # заменили первые две '*' на '+'
print(s)  # he++o, wor*d!

# Метод .split() разбивает строку на список строчных элементов
id = '192.123.234.23'
print(id.split('.'))  # ['192', '123', '234', '23']
print([int(x) for x in id.split('.')])  # [192, 123, 234, 23]


# Метод "".join() - склеивает список строк в одну строку
print(','.join(['192', '123', '234', '23']))   # 192,123,234,23
'''

# № 17631 Основная волна 19.06.24 (Уровень: Базовый)
# Какая строка получится в результате применения приведённой
# ниже программы к строке, состоящей из 136 идущих подряд цифр 9?
# В ответе запишите полученную строку.
#
#   ПОКА нашлось (22222) ИЛИ нашлось (9999)
#     ЕСЛИ нашлось (22222)
#       ТО заменить (22222, 99)
#     ИНАЧЕ заменить (9999, 2)
'''
s = '9' * 136
while '22222' in s or '9999' in s:
    if '22222' in s:
        s = s.replace('22222', '99', 1)
    else:
        s = s.replace('9999', '2', 1)
print(s)
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6, 12*]
# КЕГЭ  = []
# на следующем уроке:
