# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# https://education.yandex.ru/ege/task/eeee81f3-071e-46a6-967d-043f06c8af92
'''
a = 1
b = 10000
c = 16
t = 8

v = a * b * c * t  # бит
print(v / 2**13)  # 156.25
'''

# https://education.yandex.ru/ege/task/7407e7ee-2ca4-4372-b173-b39bffa2d1d9
'''
a = 2
b = 44000
c = 16
t = 60

v = a * b * c * t
v32 = v * 32  # бит

u = 1_802_240  # бит / с 

print(v32 / u)  # с
'''


# https://education.yandex.ru/ege/task/2761e91c-9239-4e0e-b7c1-1e56166f3fc4

pixels = 1600 * 900
colors = 2048
i = 11  # бит на один пиксель
v = pixels * i
v16 = v * 16

u = v16 / 300
print(u)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ = []
# на следующем уроке: 5 на системы счисления >2


# Первый пробник 21.12.24:
# Николай 9/19 -> 48 вторичных баллов +[1, 2, 4, 7, 13, 14, 16, 23, 25] -[5, 6, 8, 9, 12, 15, 17, 24]

# Второй пробник 28.02.25:
# Николай 12/19 -> 56 вторичных баллов +[1-4, 8-10, 12, 13, 15, 16, 23] -[5, 6, 14, 17, 18-22, 24, 25]
