# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 23 №58531
# У исполнителя есть три команды, которым присвоены номера.
# 1. Прибавить 1.
# 2. Умножить на 2.
# 3. Прибавить 3.
#
# Сколько существует программ, которые преобразуют исходное
# число 3 в число 22 и при этом траектория вычислений содержит
# число 10 и не содержит чисел 13 и 17?
'''
def F(a, b):
    if a > b or a == 13 or a == 17:
        return 0
    elif a == b:
        return 1
    else:
        return F(a+1, b) + F(a*2, b) + F(a+3, b)


print(F(3, 10) * F(10, 22))
'''

# Вариант 2
'''
def F(a, b):
    if a >= b or a == 13 or a == 17:
        return a == b
    return F(a+1, b) + F(a*2, b) + F(a+3, b)


print(F(3, 10) * F(10, 22))
'''


def f(x, y):
    if x < y or x == 10 or x == 15:
        return 0
    if x == y:
        return 1
    if x % 2 == 0 and x % 3 == 0:
        return f(x - 1, y) + f(x // 2, y) + f(x // 3, y)
    if x % 2 == 0 and x % 3 != 0:
        return f(x - 1, y) + f(x // 2, y)
    if x % 3 == 0 and x % 2 != 0:
        return f(x - 1, y) + f(x // 3, y)
    if x % 2 != 0 and x % 3 != 0:
        return f(x - 1, y)


print(f(22, 1))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
