# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

from itertools import *
summa = 0
for s in open('files/9.csv'):
    M = sorted([int(x) for x in s.split(',')])
    copied = [x for x in M if M.count(x) == 3]
    copied2 = [x for x in M if M.count(x) == 2]
    if len(copied) == 3 and len(copied2) == 4:
        # if any(sum(B[:2]) % 2 != 0 and sum(B[2:]) % 2 != 0 for B in permutations(M[:4])):
        # if any((B[0] + B[1]) % 2 != 0 and (B[2] + B[3]) % 2 != 0 for B in permutations(M[:4])):

        if any((B[0] + B[1]) % 2 != 0 and (B[2] + B[3]) % 2 != 0 for B in permutations(M[:4])):
        # D = [x % 2 == 0 for x in M[:4]]
        # if sum(D) == 2:
            summa += sum(M)


print(summa)

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Николай 9/19 -> 48 вторичных баллов +[1, 2, 4, 7, 13, 14, 16, 23, 25] -[5, 6, 8, 9, 12, 15, 17, 24]
