# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# https://education.yandex.ru/ege/task/84fa6081-f218-4027-83d3-677e893ca3f7
'''
sym = 7
alp = 10 + 8188  # 8198

# colors = 2 ** i, где i - это количество бит на один пиксель
# alp = 2 ** i, где i - это количество бит на один символ

i = 14  # alp = 8198 <= 2 ** i -> i = 14

bit = sym * i  # бит на один ID
print(bit / 8)  # 12.25 -> 13
byte = 13  # байт на один ID

print((20240 * byte) / 2**10)
# 256.95312
'''
from math import sumprod

# https://education.yandex.ru/ege/task/89be00c5-45d8-4e0e-b2ff-a23d77fdc538
'''
sym = 34
alp = 36
i = 6
bit = sym * i
print(bit / 8)  # 25.5
byte = 26

user = 20 * 2**20 / 10240  # байт
print(user - byte)  # 20971494
# user = byte + dop
'''

# https://education.yandex.ru/ege/task/a4132687-04dc-4ed6-85e0-76ebd94d668a
'''
sym = 197
# alp - ?
# i - ?

# более 25 Мбайт памяти
print(25 * 2**20 / 178_080)  # 147.205 -> 148 так как БОЛЕЕ
byte = 148

bit = byte * 8
# bit = sym * i

i = bit / sym
print(i)  # 6.01015
alp = 2 ** 6
print(alp)  # 64

# Но ответ будет 33 так как нас просят найти минимально возможную мощность алфавита
# i = 5 -> 32 [17 - 32]
# i = 6 -> 64 [33 - 64]

alp = 33
i = 6
bit = sym * i
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ = []
# на следующем уроке: 5 на системы счисления >2


# Первый пробник 21.12.24:
# Николай 9/19 -> 48 вторичных баллов +[1, 2, 4, 7, 13, 14, 16, 23, 25] -[5, 6, 8, 9, 12, 15, 17, 24]

# Второй пробник 28.02.25:
# Николай 12/19 -> 56 вторичных баллов +[1-4, 8-10, 12, 13, 15, 16, 23] -[5, 6, 14, 17, 18-22, 24, 25]
