# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

from itertools import *

k = 0
for x in product('01234567', repeat = 7):
    x = ''.join(x)
    if x[0] != '0':
        if x.count('0') + x.count('2') + x.count('4') + x.count('6') == 2:
            if all(s not in x for s in '17 71 37 73 57 75 77'.split()):
                k += 1
print(k)


from itertools import *
cnt = 0
for p in product('01234567', repeat=7):
    num = ''.join(p)
    if num[0] != '0':
        for x in '046':
            num = num.replace(x, '2')
        for x in '35':
            num = num.replace(x, '1')
        if num.count('2') == 2:

            if '17' not in num and '71' not in num and '77' not in num:
                cnt += 1
print(cnt)

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке: 9 - практика


# Первый пробник 21.12.24:
# Николай 9/19 -> 48 вторичных баллов +[1, 2, 4, 7, 13, 14, 16, 23, 25] -[5, 6, 8, 9, 12, 15, 17, 24]
