# region Домашка: ******************************************************************
'''
n = int(input())
base = 3
r = ''
while n > 0:
    r += str(n % base)
    n //= base
r = r[::-1]
print(r)
'''
import builtins

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 12 №18495
# Какая строка получится в результате применения приведённой
# ниже программы к строке вида 1…12…2 (40 единиц и 40 двоек)?
#
# ПОКА нашлось (111)
#     заменить (111, 2)
#     заменить (222, 1)
'''
s = '1' * 40 + '2' * 40
while '111' in s:
    s = s.replace('111', '2', 1)
    s = s.replace('222', '1', 1)
print(s)
'''


# Тип 12 №27543
# Дана программа для Редактора:
# ПОКА нашлось (01) ИЛИ нашлось (02) ИЛИ нашлось (03)
#     заменить (01, 103)
#     заменить (02, 10)
#     заменить (03, 210)
#
# Известно, что исходная строка начинается с цифры 0,
# а далее содержит 12 цифр 1, 15 цифр 2 и 17 цифр 3,
# расположенных в произвольном порядке.
# Сколько цифр 2 будет в строке, которая получится после выполнения данной программы?
'''
s = '0' + '1' * 12 + '2' * 15 + '3' * 17
while '01' in s or '02' in s or '03' in s:
    s = s.replace('01', '103', 1)
    s = s.replace('02', '10', 1)
    s = s.replace('03', '210', 1)
print(s.count('2'))
'''


# Тип 12 №33514
'''
for x in range(0, 50):
    for y in range(0, 50):
        for z in range(0, 50):
            s = '0' + '1' * x + '2' * y + '3' * z
            while '01' in s or '02' in s or '03' in s:
                s = s.replace('01', '30', 1)
                s = s.replace('02', '101', 1)
                s = s.replace('03', '202', 1)
            if s.count('1') == 15 and s.count('2') == 10 and s.count('3') == 60:
                print(x)
'''

'''
from itertools import *
R = []
for p in product('12', repeat=20):
    if p.count('1') == 10:
        s = '0' + ''.join(p) + '0'
        while '00' not in s:
            s = s.replace('012', '30', 1)
            if '011' in s:
                s = s.replace('011', '20', 1)
                s = s.replace('022', '40', 1)
            else:
                s = s.replace('01', '10', 1)
                s = s.replace('02', '101', 1)
        if s.count('1') == 7 and s.count('2') == 5:
            R.append(s.count('3'))
print(min(R))
'''

def prime(x):
    if x == 1:
        return False
    for j in range(2, x):
        if x % j == 0:
            return False
    return True


for n in range(100, 200):
    s = '0' + '1' * n + '2' * n + '0'
    while '00' not in s:
        s = s.replace('02', '101', 1)
        s = s.replace('11', '2', 1)
        s = s.replace('12', '21', 1)
        s = s.replace('010', '00', 1)
    summa = sum([int(x) for x in s if x.isdigit()])
    if prime(summa):
        print(n)
        exit()

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6, 12]
# КЕГЭ  = []
# на следующем уроке:
