# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 19248 ЕГКР 21.12.24 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(10000)

from sys import *
setrecursionlimit(10000)
# RecursionError: maximum recursion depth exceeded

def F(n):
    if n < 5:
        return n
    if n >= 5:
        return 2*n * F(n-4)


print((F(13766) - 9 * F(13762)) / F(13758))
'''


# № 18931 Новогодний вариант 2025 (Уровень: Базовый)
'''
import sys
from functools import *
sys.setrecursionlimit(5000)

@lru_cache(None)
def F(n):
    if n <= 3:
        return n - 1
    if n > 3 and n % 2 == 0:
        return F(n - 2) + n/2 - F(n - 4)
    if n > 3 and n % 2 != 0:
        return F(n-1) * n + F(n-2)


for i in range(5000):
    F(i)

print(F(4952) + 2 * F(4958) + F(4964))
'''


# № 17557 Основная волна 08.06.24 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(10000)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return 2 * n * F(n - 1)


print((F(2024) // 16 - F(2023)) / F(2022))
#       ~~~~~~~^~~~
# OverflowError: integer division result too large for a float
'''

# № 17562 Основная волна 08.06.24 (Уровень: Базовый)
# У исполнителя есть три команды, которым присвоены номера:
# A. Прибавить 1
# B. Прибавить 2
# C. Прибавить 3
# Сколько существует программ, которые преобразуют число 5 в число 11,
# и при этом траектория вычислений содержит число 7?

def F(a, b):
    if a < b:
        return 0
    elif a == b:
        return 1
    else:
        return F(a+1, b) + F(a+2, b) + F(a // 3, b)


print(F(5, 7) * F(7, 11))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2? сопоставление, 3, 4, 5? переводы, 7, 8-, 9-, 11-, 12-, 13-, 15-, 16-, 19-21-, 22]
# КЕГЭ  = []
# на следующем уроке:
