# region Домашка: ******************************************************************

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# Способ чтения файла из 17 номера
M = [int(x) for x in open('0. files/17.txt')]
R = []  # Сюда будем складывать наши результаты


# Рассмотрим три основных прототипа задач:
M = [1, 2, 3, 4, 5]

# 1. Под парой подразумевается два идущих подряд элемента последовательности
# 12 23 34 45
for i in range(len(M)-1):
    x, y = M[i], M[i+1]

# 2. Под тройкой подразумевается три идущих подряд элемента последовательности
# 123 234 345
for i in range(len(M)-2):
    # x, y, z = M[i], M[i+1], M[i+2]
    x, y, z = M[i:i+3]

# 3. Под парой подразумевается два различных элемента последовательности
# 12 13 14 15
# 23 24 25
# 34 35
# 45
for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]
'''


# № 20603 (Уровень: Средний)
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5]
B = [x for x in M if abs(x) % 10 == 5]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 2:
        if (x + y + z) > max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''

#
# № 19749 (Уровень: Средний)
'''
M = [int(x) for x in open('0. files/17.txt')]
mini = min(M) % 3
maxi = max(M) % 7
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x % 3 == mini) + (y % 3 == mini) + (z % 3 == mini) == 1:
        if (x % 7 == maxi) + (y % 7 == maxi) + (z % 7 == maxi) >= 2:
            R.append(x + y + z)
print(len(R), max(R))
'''
# 228 262713



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2? сопоставление, 3, 4, 5, 7, 8, 9-, 11-, 12-, 13, 14, 15, 16, 18, 19-21-, 22, 23]
# КЕГЭ = []
# на следующем уроке:


# Второй пробник 28.02.25:
# Селим 18/29 -> 72 вторичных баллов +[1-5, 8, 10-16, 19-21, 23, 25] -[6, 7, 9, 17, 22, 24]
