# region Домашка: ******************************************************************

#
# № 10658 (Уровень: Средний)
# (Н. Сафронов) На вход алгоритма подаётся натуральное число N > 10.
# 1. Строится троичная запись числа N.
# 2. К этой записи дописываются разряды по следующему правилу.
# Если количество четных цифр в полученной записи больше чем нечетных, слева дописывается 22, иначе 11.
# 3. Полученная таким образом запись является троичной записью искомого числа R.
# Укажите минимальное значение R, больше  чем 100, которое может получится в результате работы алгоритма.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES=[]
for n in range(11, 10000):
    n3 = convert(n, 3)
    if (n3.count("2") + n3.count("0")) > n3.count("1"):
        n3 = "22" + n3
    else:
        n3 = "11" + n3
    r =int(n3,3)
    if r > 100:
        RES.append(r)
print(min(RES))
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 14]
# КЕГЭ = []
# на следующем уроке:

