# region Домашка: ******************************************************************

#
# № 10658 (Уровень: Средний)
# (Н. Сафронов) На вход алгоритма подаётся натуральное число N > 10.
# 1. Строится троичная запись числа N.
# 2. К этой записи дописываются разряды по следующему правилу.
# Если количество четных цифр в полученной записи больше чем нечетных, слева дописывается 22, иначе 11.
# 3. Полученная таким образом запись является троичной записью искомого числа R.
# Укажите минимальное значение R, больше  чем 100, которое может получится в результате работы алгоритма.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES=[]
for n in range(11, 10000):
    n3 = convert(n, 3)
    if (n3.count("2") + n3.count("0")) > n3.count("1"):
        n3 = "22" + n3
    else:
        n3 = "11" + n3
    r =int(n3,3)
    if r > 100:
        RES.append(r)
print(min(RES))
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 23752 Демоверсия 2026(Уровень: Базовый)
# Значение арифметического выражения записали в системе
# счисления с основанием 27. Определите в 27-ричной
# записи числа количество цифр с числовым значением,
# превышающим 9.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 2*2187 ** 2020 + 729**2021 - 2*243 ** 2022 + 81 ** 2023 - 2 * 27 ** 2024 - 6561
n27 = convert(n, 27)
print(len([x for x in n27 if x > '9']))
'''


# № 22426 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 15 * 343**2031 + 7 * 49 ** 1142 - 3 * 7**111 + 7 ** 222 - 16809
n7 = convert(n, 7)
chet = [x for x in n7 if int(x, 7) % 2 == 0]
nechet = [x for x in n7 if x in alp[1::2]]
print(len(chet) - len(nechet))
'''


# № 21900 Открытый вариант 2025(Уровень: Базовый)
# Значение арифметического выражения 7350 + 7150 – x,
# где x – целое положительное число, не превышающее 2300,
# записали в семеричной системе счисления. Определите
# наибольшее значение x, при котором в семеричной записи
# числа, являющегося значением данного арифметического
# выражения, содержится ровно 200 нулей.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for x in range(1, 2300):
    n = 7 ** 350 + 7 ** 150 - x
    n7 = convert(n, 7)
    if n7.count('0') == 200:
        RES.append(x)
print(max(RES))
'''


# № 20904 Апробация 05.03.25(Уровень: Базовый)
# Значение арифметического выражения 3100 – x,
# где x – целое положительное число, не превышающее 2030,
# записали в троичной системе счисления. Определите
# наибольшее значение x, при котором в троичной записи
# числа, являющегося значением данного арифметического
# выражения, содержится ровно один нуль.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for x in range(1, 2030):
    n = 3**100 - x
    n3 = convert(n, 3)
    if n3.count('0') == 1:
        RES.append(x)
print(max(RES))
'''

# № 20904 Апробация 05.03.25(Уровень: Базовый)
# Значение арифметического выражения 3100 – x,
# где x – целое положительное число, не превышающее 2030,
# записали в троичной системе счисления. Определите
# наибольшее значение x, при котором в троичной записи
# числа, являющегося значением данного арифметического
# выражения, содержится ровно один нуль.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for x in range(1, 2030):
    n = 3**100 - x
    n3 = convert(n, 3)
    if n3.count('0') == 1:
        RES.append(x)
print(max(RES))
'''

# № 19880 (Уровень: Базовый)
# (М. Попков) Значение арифметического выражения
# 15625** 16 - 3125** 3 * 25 ** 19 +625 ** 4 - 2005
# записали в системе счисления с основанием 25.
# Сколько значащих нулей содержится в этой записи?
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 15625** 16 - 3125** 3 * 25 ** 19 + 625 ** 4 - 2005
n25 = convert(n, 25)
print(n25.count("0"))
'''

# № 19484 (Уровень: Базовый)
# (Л. Шастин) Значение арифметического выражения
# 5 * 729 ** 2024 + 3 * 243 ** 1413 - 7 * 81 ** 169 - 2 * 9 ** 107 + 3017
# записали в системе счисления с основанием 27.
# Определите сумму чётных цифр с числовым значением,
# не превышающим 25, в записи этого числа.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 5 * 729 ** 2024 + 3 * 243 ** 1413 - 7 * 81 ** 169 - 2 * 9 ** 107 + 3017
n27 = convert(n, 27)
print(sum([int(x, 27) for x in n27 if x < alp[25] and int(x, 27) % 2 == 0]))


print(alp[25])  # P
'''

# № 14343 (Уровень: Базовый)
# (Л. Шастин) Значение арифметического выражения
# 5 * 343 ** 2031 + 4 *49 ** 2142 - 3 *7 **111+7 ** 222
# записали в системе счисления с основанием 7.
# Определите сумму цифр в записи этого числа.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 5 * 343 ** 2031 + 4 * 49 ** 2142 - 3 * 7 ** 111+7 ** 222
n7 = convert(n,7)
print(sum([int(x, 7) for x in n7]))
# TypeError: unsupported operand type(s) for +: 'int' and 'str'

'''

# № 17870 Демоверсия 2025(Уровень: Базовый)
# Значение арифметического выражения
# 7 ** 170 + 7 ** 100 - x, где x – целое положительное число,
# не превышающее 2030, записали в 7-ричной системе
# счисления. Определите наибольшее значение x, при
# котором в 7-ричной записи числа, являющегося значением
# данного арифметического выражения, содержится
# ровно 71 нуль.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ""
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES = []
for x in range(1, 2030):
    n = 7 ** 170 + 7 ** 100 - x
    n7 = convert(n, 7)
    if n7.count("0") == 71:
        RES.append(x)
print(max(RES))
'''


# № 19246 ЕГКР 21.12.24(Уровень: Базовый)
# Операнды арифметического выражения записаны в системе
# счисления с основанием 25.

# 11353x12_25 + 135x21_25

# В записи чисел переменной x обозначена неизвестная
# цифра из алфавита 25-ричной системы счисления.
# Определите наибольшее значение x, при котором значение
# данного арифметического выражения кратно 24.
# Для найденного x вычислите частное от деления значения
# арифметического выражения на 24 и укажите его в ответе
# в десятичной системе счисления. Основание системы
# счисления указывать не нужно.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:25]:
    A = int(f'11353{x}12', 25)
    B = int(f'135{x}21', 25)
    if (A + B) % 24 == 0:
        print((A + B) // 24)
'''


# № 21413 Досрочная волна 2025(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:21]:
    A = int(f'82934{x}2', 21)
    B = int(f'2924{x}{x}7', 21)
    C = int(f'67564{x}8', 21)
    if (A + B + C) % 20 == 0:
        print((A + B + C) // 20)
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 14]
# КЕГЭ = []
# на следующем уроке:

