
# Основные свойства списков list
'''
L = [1, 2, 2, 3, 3, 3]  # list (список)
# 1. Могут хранить неограниченное кол-во элементов
# 2. Элементы могут быть в разных типа данных (в отличие от массивов)
# 3. У каждого элемента списка есть порядковый номер: индекс
# 4. Индексы можно считать слева-направо начиная с 0 и справа-налево начиная с -1
# 5. Через индексы в списках можно изменять значение элементов

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

M[0], M[-1] = 'A', 'E'
M[0] = 'A'
M[1] = 'B'
M[-1] = 'E'
print(M)  # ['A', 'B', 'c', 'd', 'E']

# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

print(f'Первый элемент списка М: {M[0]}')  #  a
print(f'Последний элемент списка М: {M[-1]}')  #  e

M = [2, 2.0, '2', True,  [1, 2, 3], (1, 2, 3)]
for x in M:
    print(type(x), x)
    # <class 'int'> 2
    # <class 'float'> 2.0
    # <class 'str'> 2
    # <class 'bool'> True
    # <class 'list'> [1, 2, 3]
    # <class 'tuple'> (1, 2, 3)


# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']

for i in range(len(M)):
    M[i] = M[i] * i

print(M)  # ['', 'b', 'cc', 'ddd', 'eeee']

print('Hello ' * 4)  # Hello Hello Hello Hello

print(len(M))  # - это функция возвращающая длину списка (последовательности)
'''


# Срезы списков и других последовательностей
'''
# i   0    1    2    3    4
M = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

# i  01234
s = 'abcde'

# СРЕЗ[START:STOP-1:STEP]

print(M[0])  # a
print(M[1:3])  # ['b', 'c']
print(M[:3])  # ['a', 'b', 'c'] - беру все элементы слева
print(M[2:])  # ['c', 'd', 'e'] - беру все элементы справа (до конца)

print(M[1:-1])  # ['b', 'c', 'd'] - кроме первого и последнего


print(M[:])  # ['a', 'b', 'c', 'd', 'e']
print(M[::])  # ['a', 'b', 'c', 'd', 'e']

print(M[::2])  # ['a', 'c', 'e']
print(M[0::2])  # ['a', 'c', 'e'] - все элементы на четных индексах
print(M[1::2])  # ['b', 'd'] - все элементы на нечетных индексах

print(M[::-1])  # ['e', 'd', 'c', 'b', 'a'] - перебор в обратном порядке
'''


# Функции списков
'''
M = [3, 3, 2, 3, 2, 1]

print(len(M))
print(sum(M))
print(min(M), max(M))

print(set(M))  # {1, 2, 3} - выводит только различные элементы

print(sorted(M))  # [1, 2, 2, 3, 3, 3]

print(sorted(M, reverse=True))  # [3, 3, 3, 2, 2, 1]
print(sorted(M)[::-1])  # [3, 3, 3, 2, 2, 1]
'''



# 🖥Все методы списков в Python, которые понадобятся на ЕГЭ

# 🚩 .APPEND()
# Метод .append() используется для добавления элемента в конец списка. Пример:
'''
my_list = [1, 2, 3]
my_list.append(4)
my_list.append(5)
print(my_list)  # Вывод: [1, 2, 3, 4, 5]
'''

# Можно реализовать через конкатенацию (склеивание) списков:
'''
my_list = [1, 2, 3]
my_list = [0] + my_list + [4, 5]
print(my_list)  # Вывод: [0, 1, 2, 3, 4, 5]
'''

# 🚩 .REVERSE()
# Метод .reverse() изменяет порядок элементов в списке на обратный. Пример:
'''
my_list = [1, 2, 3, 4]
my_list.reverse()
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# Можно записать по другому через срез:
'''
my_list = [1, 2, 3, 4]
my_list = my_list[::-1]
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# 🚩 .COUNT()
# Метод .count() возвращает количество вхождений заданного элемента в список. Пример:
'''
my_list = [1, 2, 2, 3, 4, 2, '2']
print(my_list.count(2))  # Вывод: 3
print(my_list.count('2'))  # Вывод: 1
'''

# 🚩 .SORT()
# Метод .sort() сортирует элементы списка по возрастанию (по умолчанию) или в обратном порядке, если передан аргумент reverse=True. Пример:
'''
my_list = [4, 1, 3, 2]
my_list.sort()
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list.sort(reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''

# Скажу честно я не любитель этого метода, считаю, что удобнее будет использовать функцию sorted():
'''
my_list = [4, 1, 3, 2]
my_list = sorted(my_list)
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list = sorted(my_list, reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# Генераторы списков
'''
M = []  # - пустой список
n = 5  # - длина списка
for i in range(5):
    x = int(input())  # добавляем элементы списка
    M.append(x)
print(M)  # Выводим получившийся список

# Генератор[что_кладем | откуда_берем | при_каком_условии]

M = [int(input()) for i in range(5)]
print(M)
'''



'''
M = [x for x in range(10)]
print(M)  # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

M = [x ** 2 for x in range(10)]
print(M)  # [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

M = [x ** 2 for x in range(10) if x % 2 == 0]
print(M)  # [0, 4, 16, 36, 64]


N = [23, 4, 24, 23, 2354, 5, 46, 6, 45, 6, 23, 412, 312, 3, 323, 4]
chet = [x for x in N if x % 2 == 0]
nechet = [x for x in N if x % 2 != 0]

N_3 = [x for x in N if x % 10 == 3]  # [23, 23, 23, 3, 323]

M = [x for x in N if len(str(x)) == 2]  # [23, 24, 23, 46, 45, 23]
M = [x for x in N if 10 <= x <= 99]  # [23, 24, 23, 46, 45, 23]

copied1 = [x for x in N if N.count(x) == 1]  # [24, 2354, 5, 46, 45, 412, 312, 3, 323]
copied2 = [x for x in N if N.count(x) == 2]  # [4, 6, 6, 4]
copied3 = [x for x in N if N.count(x) == 3]  # [23, 23, 23]
print(copied3)
'''
