# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Встроенные функции перевода
'''
n = 1000
print(bin(n))  # 0b1111101000 - Перевод в двоичную систему счисления
print(bin(n)[2:])  # 1111101000 - Перевод в двоичную систему счисления
print(oct(n)[2:])  # 1750 - Перевод в восьмеричную систему счисления
print(hex(n)[2:])  # 3e8 - Перевод в 16-ю систему счисления

print(f'{n:b}') # 1111101000

print(f'Способ перевода в двоичную систему: {n:b}')  # 1111101000
print(f'Способ перевода в двоичную систему: {n:o}')  # 1750
print(f'Способ перевода в двоичную систему: {n:x}')  # 3e8



# Своя функция перевода в различные системы счисления

# Функция для перевода в системы счисления до 9
def convert(n, b):
    r = ''
    while n > 0:
        r += str(n % b)
        n //= b
    return r[::-1]

print(convert(8, 2))  # 0001
print(int('1000', 2))  # 8


# Функция для перевода в системы счисления больше 9 (универсальная)

alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


print(convert(10**8, 16))  # 5F5E100
print(int('5F5E100', 16))  # 100000000
'''



# № 28926 ЕГКР 18.04.26(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# Алгоритм строит по нему новое число R следующим образом.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если число N делится на 3, то к этой записи справа дописываются две последние троичные цифры;
# б) если число N на 3 не делится, то вычисляется сумма цифр полученной троичной записи,
# эта сумма умножается на 2, переводится в троичную систему счисления и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное нечётное число R, большее 520, которое может быть получено с помощью
# описанного алгоритма.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = n3 + n3[-2:]
    else:
        summa = sum(map(int, n3))
        n3 = n3 + convert(summa * 2, 3)
    r = int(n3, 3)
    if r > 520 and r % 2 != 0:
        RES.append(r)
print(min(RES))  # 567
'''


# № 29337 Открытый вариант 2026(Уровень: Базовый)
# 1. Строится двоичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если сумма цифр в двоичной записи числа чётная, то к этой записи справа дописывается 0,
# а затем два левых разряда заменяются на 10;
# б) если сумма цифр в двоичной записи числа нечётная, то к этой записи справа дописывается 1,
# а затем два левых разряда заменяются на 11.
# Полученная таким образом запись является двоичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите максимальное число N, после обработки которого с помощью этого
# алгоритма получается число R, не превышающее 19.
# В ответе запишите это число в десятичной системе счисления
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES = []
for n in range(1, 10000):
    n2 = convert(n, 2)
    if sum(map(int, n2)) % 2 == 0:
        n2 = "10" + n2[2:] + '0'
    else:
        n2 = "11" + n2[2:] + "1"
    r = int(n2, 2)
    if r <= 19:
        RES.append(n)
print(max(RES))
'''


# № 25344 ЕГКР 13.12.25(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то к этой записи справа дописываются две последние троичные цифры;
# б) если число N на 3 не делится, то вычисляется сумма цифр полученной троичной записи,
# эта сумма умножается на 3, переводится в троичную систему счисления дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите минимальное нечётное число R, большее 208, которое может быть получено
# с помощью описанного алгоритма.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = n3 + n3[-2:]
    else:
        n3 = n3 + convert(sum(map(int, n3)) * 3, 3)
    r = int(n3, 3)
    if r > 208 and r % 2 != 0:
        RES.append(r)
print(min(RES))
'''



# № 23364 Резервный день 19.06.25(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N.
# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то слева к нему приписывается «1», а справа «02»;
# б) если число N на 3 не делится, то остаток от деления на 3 умножается на 4,
# переводится в троичную запись и дописывается в конец числа.

# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите максимальное число N, после обработки которого с помощью этого алгоритма
# получается число R, меньшее 100.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = "1" + n3 + "02"
    else:
        n3 = n3 + convert((n % 3) * 4, 3)
    r = int(n3, 3)
    if r < 100:
        RES.append(n)
print(max(RES))
'''



# № 22457 (Уровень: Базовый)
# (Л. Шастин) На вход алгоритма подаётся натуральное число N.
# 1. Строится семеричная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# а) если сумма цифр в этой записи чётна, то к ней в конец дописываются 3 пятёрки.
# 6) иначе, если сумма цифр в этой записи нечётна, то слева к этой записи дописываются 2 тройки,
# а в конец 1 шестёрка.
# Полученная таким образом запись является семеричной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите максимальное число N, после обработки которого с помощью этого алгоритма
# получается число R, меньшее 12717.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES = []
for n in range(1, 10000):
    n7 = convert(n, 7)
    if sum(map(int, n7)) % 2 == 0:
        n7 = n7 + "555"
    else:
        n7 = "22" + n7 + "6"
    r = int(n7, 7)
    if r < 12717:
        RES.append(n)
print(max(RES))
'''

# № 21700 ЕГКР 19.04.25(Уровень: Базовый)
# На вход алгоритма подаётся натуральное число N (N> 2).

# 1. Строится троичная запись числа N.
# 2. Далее эта запись обрабатывается по следующему правилу:
# a) если число N делится на 3, то к этой записи дописываются две последние троичные цифры;
# б) если число N на 3 не делится, то остаток от деления умножается на 3,
# переводится в троичную систему и дописывается в конец числа.
# Полученная таким образом запись является троичной записью искомого числа R.
# 3. Результат переводится в десятичную систему и выводится на экран.

# Укажите максимальное число N, после обработки которого с помощью этого алгоритма
# получается число не превышающее 150.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


RES = []
for n in range(1, 10000):
    n3 = convert(n, 3)
    if n % 3 == 0:
        n3 = n3 + n3[-2:]
    else:
        n3 = n3 + convert((n % 3) * 3, 3)
    r = int(n3, 3)
    if r <= 150:
        RES.append(n)
print(max(RES))
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6]
# КЕГЭ = []
# на следующем уроке: 14

