# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 19121 (Уровень: Базовый)
'''
def F(a, b):
    if a <= b:
        return a == b
    return F(a-3, b) + F(a//3, b)

print(F(35, 8) * F(8, 1))
'''


# № 19784 (Уровень: Базовый)
'''
def F(a, b):
    if a <= b or a == 28:
        return a == b
    summa = 0
    summa += F(a-2, b)
    if a % 2 == 0:
        summa += F(a // 2, b)
    else:
        summa += F(a - 3, b)
    return summa


print(F(98, 1))
'''


# Адрес сети = net
# net = Узел сети & Маска сети
# & - побитовая конъюнкция
# for ip in net:

# 172.16.80.0 - на каждое число по 1 байту (по 8 бит)

# 10101010.11101010.10101011.10000000.

# самое старшое восьмибитное число: 11111111 -> 255
# Маска сети - это 32 бита вида: 111111...00000

# print(int('1010', 2))


# № 20902 Апробация 05.03.25 (Уровень: Базовый)
# Сеть задана IP-адресом 172.16.80.0 и маской сети 255.255.248.0.
# Сколько в этой сети IP-адресов, для которых количество единиц
# в двоичной записи IP-адреса не кратно 2?
# В ответе укажите только число.
'''
from ipaddress import *
net = ip_network('172.16.80.0/255.255.248.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 2 != 0:
        cnt += 1
print(cnt)
'''


# № 18928 Новогодний вариант 2025 (Уровень: Базовый)
# IP-адрес сети: 192.168.248.176
# Сетевая маска: 255.255.255.240
#
# Необходимо узнать, сколько в этой сети IP-адресов, для которых
# количество единиц и нулей в двоичной записи IP-адреса одинаково.
'''
from ipaddress import *
net = ip_network('192.168.248.176/255.255.255.240', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('0') == b.count('1'):
        cnt += 1
print(cnt)
'''


# № 18159 (Уровень: Базовый)
# Для узла с IP-адресом 205.154.212.20 адрес сети равен 205.154.192.0.
# Чему равно наибольшее возможное значение третьего слева байта маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'205.154.212.20/{mask}', 0)
    if '205.154.192.0' in str(net):
        print(net.netmask)
'''


# № 18955 (Уровень: Средний)
'''
from ipaddress import *
for mask in range(32+1):
    net1 = ip_network(f'200.154.190.12/{mask}', 0)
    net2 = ip_network(f'200.154.184.0/{mask}', 0)
    if net1 == net2:
        print(mask, 32-mask)
'''


# № 15326 Досрочная волна 2024 (Уровень: Базовый)

from ipaddress import *
net = ip_network('105.224.200.224/255.255.255.224', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 4 == 0:
        cnt += 1
print(cnt)

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16, 23]
# КЕГЭ = []
# на следующем уроке: 3 раза по 2 урока


# Первый пробник 21.12.24:
# Роман 2/5 -> 14 вторичных баллов +[2, 12] -[5, 6, 8]
