# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
# Примеры встроенных функций
print(2 + 2)
print(max(3, 4))  # 4
print(sum([1, 2, 3]))  # 6
print(len([1, 2, 3]))  # 3
l = len([1, 2, 3])
print(l * 2)  # 6


# Пример использования встроенной библиотеки и написания своей функции
def d(A, B):
    x1, y1 = A
    x2, y2 = B
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5

print(d([4, 5], [6, 7]))  #  2.8284271247

from math import dist
print(dist([4, 5], [6, 7]))  #  2.8284271247
'''


# Способы подключения библиотек в Python
'''
import math  # Самый простой способ подключения
print(math.dist([4, 5], [6, 7]))  #  2.8284271247

import math as m  # Подключение через короткое имя 
print(m.dist([4, 5], [6, 7]))  #  2.8284271247

from math import *
print(dist([4, 5], [6, 7]))  #  2.8284271247
print(factorial(5))
print(sqrt(16))

from math import dist, factorial, sqrt
print(dist([4, 5], [6, 7]))  #  2.8284271247
print(factorial(5))
'''


# Пример конфликта имен
'''
count = 0
from itertools import permutations
for p in permutations('abc'):
    print(p)
    count += 1
print(count)


count = 0
from itertools import *
for p in permutations('abc'):
    print(p)
    count += 1
print(count)
# TypeError: unsupported operand type(s) for +=: 'type' and 'int'
'''


# 📌 Список полезных библиотек для успешной сдачи ЕГЭ по информатике!

# 1⃣ Библиотека черепашки для решения 6 номера кодом:
'''
import turtle as t  # Подключение библиотеки с коротким именем
t.down()  # Опустить хвост
t.screensize(5000, 5000)  # Для ползунков с навигацией по холсту
t.tracer(0)  # Отключение анимации - мгновенная отрисовка
t.left(90)  # Повернуть голову черепахи вдоль положительного направления оси ординат
size = 40  # Переменная для контроля масштабирования

# Повтори 2 [Вперёд 14 Налево 270 Назад 12 Направо 90]
for i in range(2):
    t.forward(14 * size)
    t.left(270)
    t.backward(12 * size)
    t.right(90)

t.up() # Поднять хвост
for x in range(-50, 50):  # Перебираем координаты точек x, y
    for y in range(-50, 50):
        t.goto(x * size, y * size)  # Прыгаем в определенную координату
        t.dot(5, 'red')  # Рисуем точки толщиной 3 и цветом красный

t.update()  # Для корректной работы функции t.tracer(0)
t.done()  # Фиксируем окно отрисовки
'''

# 2⃣ Библиотека itertools для решения 1, 8, 9, 12, 24 номеров кодом:
'''
from itertools import product, permutations

for p in product('abc', repeat=2):
    word = ''.join(p)
    print(p, word)
    # ('a', 'a') aa
    # ('a', 'b') ab
    # ('a', 'c') ac
    # ('b', 'a') ba
    # ('b', 'b') bb
    # ('b', 'c') bc
    # ('c', 'a') ca
    # ('c', 'b') cb
    # ('c', 'c') cc

for p in permutations('abc', r=3):
    word = ''.join(p)
    print(p, word)
    # ('a', 'b', 'c') abc
    # ('a', 'c', 'b') acb
    # ('b', 'a', 'c') bac
    # ('b', 'c', 'a') bca
    # ('c', 'a', 'b') cab
    # ('c', 'b', 'a') cba
'''

# 3⃣ Библиотека ipaddress для решения нового 13 номера:
'''
# № 25352 ЕГКР 13.12.25 (Уровень: Базовый)

from ipaddress import *
net = ip_network('190.202.83.62/255.255.252.0', 0)
for ip in net:
    print(ip)  # 190.202.83.254
'''
# Сеть задана IP-адресом 105.224.200.224 и сетевой маской 255.255.255.224.
# Сколько в этой сети IP-адресов, для которых количество единиц
# в двоичной записи IP-адреса кратно 4?
'''
from ipaddress import *
net= ip_network('105.224.200.224/255.255.255.224', 0)
cnt = 0
for ip in net:
    s = f'{ip:b}'
    if s.count('1') % 4 == 0:
        cnt += 1
print(cnt)
'''


# 4⃣ Две библиотеки для решения 16 номера:
# Одна увеличивает глубину рекурсии:
'''
import sys
sys.setrecursionlimit(10000)
'''

# Вторая ускоряет вычисления через использование кэширования:
'''
from functools import *
@lru_cache(None)
def F(n):
'''

# 5⃣ Библиотека fnmatch для решения 25 номера с масками:
'''
from fnmatch import *
for x in range(1917, 10**10, 1917):
    if fnmatch(str(x), '3?12?14*5'):
        print(x, x // 1917)
'''


# 6⃣ Библиотека string хранит в себе много полезных элементов:
'''
import string
alphabet = string.ascii_uppercase
print(alphabet)  # ABCDEFGHIJKLMNOPQRSTUVWXYZ

print(string.punctuation)
# !"#$%&'()*+,-./:;<=>?@[\]^_`{|}~

from string import ascii_uppercase, digits
alp = digits + ascii_uppercase  # 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ

print(alp[:2])  # 01
print(alp[:8])  # 01234567
print(alp[:16])  # 0123456789ABCDEF
'''


# 7⃣ Библиотека math хранит в себе много полезных математических функций:
'''
from math import ceil, floor, dist

def d(A, B):
    x1, y1 = A
    x2, y2 = B
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5

print(d([4, 5], [6, 7]))  #  2.8284271247

from math import dist
print(dist([4, 5], [6, 7]))  #  2.8284271247

print(4 / 3)  # 1.3333
print(int(4 / 3))  # 1
print(int(4 // 3))  # 1
print(floor(4 / 3))  # 1 - округление вниз
print(ceil(4 / 3))  # 2 - округление вверх
print(round(4 / 3))  # 1 - округление как в математике 
'''



# Полезная функции для 5 и 14 номера:
'''
from string import ascii_uppercase, digits
alp = digits + ascii_uppercase  # 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ

alp = sorted('1234567890QWERTYUIOPASDFGHJKZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r = alp[n % b] + r
        n //= b
    return r


print(convert(8, 2))  # 1000
print(int('1000', 2))  # 8 - перевод из b-й системы счисления в 10-ю

print(convert(10**6, 16))  # 154240 -> F4240

n = 8
print(bin(n))  # 0b1000
print(bin(n)[2:])  # 1000
print(f'{n:b}')  # 1000
print(int('1000', 2))   # 8

n = 8
print(oct(n)[2:])  # 10
print(f'{n:o}')  # 10
print(int('10', 8))   # 8

n = 8
print(hex(n)[2:])  # 8
print(f'{n:x}')  # 8
print(int('8', 16))   # 8
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 3, 2, 4, 5, 6, 8, 13, 14, 15, 16, 18, 19-21, 23, 25, 27.1]
# КЕГЭ = []
# на следующем уроке: split(), ''.join(), all(), sny(), divisors, prime, генераторы списков
