# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


import turtle as t  # Подключение библиотеки с коротким именем t
t.screensize(-2000, 2000)  # Для регулирования окна
t.tracer(0)  # Отключает анимацию отрисовки (мгновенное рисование)
t.left(90)
size = 20  # Переменная для регулирования масштаба отрисовки
# Тут пишем наш псевдокод
for i in range(10):
    t.forward(22 * size)
    t.right(90)
    t.forward(16 * size)
    t.right(90)
t.up()
t.forward(1 * size)
t.right(90)
t.forward(1 * size)
t.left(90)
t.down()
for i in range(10):
    t.forward(72 * size)
    t.right(90)
    t.forward(79 * size)
    t.right(90)

# Тут перебираем точки
t.up()  # Подняли перо, чтобы все было красиво
for x in range(-50, 50):  # Перебираем координаты точек
    for y in range(-50, 50):
        t.goto(x * size, y * size)  # Перейти в определенную координату
        t.dot(3, 'red')  # Рисуем точку толщины 3 и красного цвета
t.update()  # Для корректной работы .tracer(0)
t.done()


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 6]
# КЕГЭ  = []
# на следующем уроке:
