# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 19247 ЕГКР 21.12.24 (Уровень: Базовый)
'''
def F(x, y, A):
    return (x - 3*y < A) or (y > 400) or (x > 56)

for A in range(1, 10000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        print(A)
        break
'''


# № 18971 (Уровень: Базовый)
'''
def F(x, y, A):
    return (y > 10) or (x * A > y + x)

for A in range(1, 10000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        print(A)
        break
'''


# № 20577 (Уровень: Базовый)
'''
def F(x, A):
    return (x & A != 0) <= ((x & 698 == 0) <= (x & 321 != 0))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
'''
# Ответ: 1019


# № 20584 (Уровень: Базовый)
'''
def F(x, A):
    return ((405 % x == 0) <= (81 % x == 0)) or (A - x > 162)

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break
'''


# № 19485 (Уровень: Базовый)
'''
def F(x, A):
    B = 170 <= x <= 220
    return (x % A == 0) or ((B) <= (x % 24 != 0))

cnt = 0
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        cnt += 1
print(cnt)
'''


# № 16833 (Уровень: Базовый)
'''
def F(x, a1, a2):
    P = 25 <= x <= 73
    Q = 75 <= x <= 118
    A = a1 <= x <= a2
    return (A and (not Q)) <= (P or Q)

R = []
M = [x / 5 for x in range(20 * 5, 120 * 5)]
print(M)
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(max(R))  # 48.0 -> 48
'''


# № 12253 ЕГКР 16.12.23 (Уровень: Базовый)
# А. Прибавить 1
# В. Прибавить 3
# С. Возвести в квадрат
# Сколько существует программ, для которых при исходном
# числе 3 результатом является число 26, при этом траектория
# вычислений содержит число 20 и не содержит числа 16?


def F(a, b):
    if a > b or a == 16:
        return 0
    if a == b:
        return 1
    else:
        return F(a+1, b) + F(a+3, b) + F(a**2, b)

print(F(3, 20) * F(20, 26))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14, 15, 16, 23]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Роман 2/5 -> 14 вторичных баллов +[2, 12] -[5, 6, 8]
