# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 25512 (Уровень: Средний)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = (8**200 - ((2**4 - 7) * 2**(9 + 7)) + 11) // 3
print(oct(n)[2:].count('2'))
print(f'{n:o}'.count('2'))
print(convert(n, 8).count('2'))
'''


# № 20490 (Уровень: Средний)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for x in range(2005):
    n = 4**163 * 5 + 12 ** 62 - x
    s = convert(n, 5)
    if s.count('1') < s.count('4'):
        RES.append(x)
print(max(RES))
'''


# № 17973 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:24]:
    A = int(f'12{x}734', 24)
    B = int(f'8{x}95{x}3', 24)
    C = int(f'24{x}796', 24)
    if (A + B + C) % 23 == 0:
        print((A + B + C) // 23)
'''

# https://inf-ege.sdamgia.ru/problem?id=48392
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:9]:
    for y in alp[:9]:
        A = int(f'2{y}66{x}', 9)
        B = int(f'{x}0{y}1', 12)
        if (A + B) % 170 == 0:
            print((A + B) // 170)
'''

'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alp.index('O'))  # 24
for p in range(25, 36+1):
    A = int(f'BO', p)
    B = int(f'OM', p)
    C = int(f'BL4', p)
    D = int(f'CNG', p)
    if (A + B + C) == D:
        print(p)
'''


# № 13246 Открытый курс "Слово пацана" (Уровень: Средний)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for p in range(10, 36+1):
    for x in alp[:p]:
        for y in alp[:p]:
            A = int(f'24{x}9', p)
            B = int(y + x + y + '3', p)
            C = int(f'{x}4{y}0', p)
            if A +  B == C:
                print(int(x + y + y, p))
'''




# № 9783 Основная волна 20.06.23 (Уровень: Базовый)
# Операнды арифметического выражения записаны в системе счисления с основанием 22.
# 18x89957_22 + 80x33_22+521x6_22
# В записи чисел переменной x обозначена неизвестная цифра из алфавита 22-ричной
# системы счисления. Определите наименьшее значение x, при котором значение
# данного арифметического выражения кратно 21.
# Для найденного значения x вычислите частное от деления значения арифметического
# выражения на 21 и укажите его в ответе в десятичной системе счисления.
# Основание системы счисления указывать не нужно.

'''
alp = sorted("0123456789QWERTYUIOPASDFGHJKLZXCVBNM")
for x in alp[:22]:
    A = int(f"18{x}89957", 22)
    B = int(f"80{x}33", 22)
    C = int(f"521{x}6", 22)
    if (A + B + C) % 21 == 0:
        print((A + B + C) // 21)
'''

# № 18122 (Уровень: Базовый)

# (Д. Бахтиев) Значение арифметического выражения
# 5**150 + 5**135 − x, где x – целое положительное число, не превышающее 5555,
# записали в 5-ричной системе счисления. Определите наибольшее значение x,
# при котором в 5-ричной записи числа, являющегося значением данного
# арифметического выражения, содержится ровно 134 цифры 4.
# В ответе запишите число в десятичной системе счисления.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


for x in range(5555):
    n = 5 ** 150 + 5 ** 135 - x
    s = convert(n, 5)
    if s.count("4") == 134:
        print(x)
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 13, 14, 15, 16, 18, 19-21, 23, 25, 27.1]
# КЕГЭ = [5, 14]
# на следующем уроке:
