# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Статград номер 2
'''
print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (x <= y) <= (z <= x) or (not z)
                if F == 0:
                    print(x, y, z, w, int(F))
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (x <= y) <= (z <= x) or (not z)
                if F == 1:
                    print(x, y, z, w, int(F))
'''

# # Статград номер 13
# Адрес сети и широковещательный адрес
# не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 220.151.212.184
# и сетевой маской 255.255.192.0.
# Найдите наименьший в данной сети IP-адрес, содержащий в своей двоичной
# записи кратное 4 количество единиц, который может быть назначен
# компьютеру. В ответе укажите найденный IP-адрес без разделителей.
'''
from ipaddress import *
net = ip_network('220.151.212.184/255.255.192.0', 0)
for ip in net.hosts():
    s = f'{ip:b}'
    if s.count('1') % 4 == 0:
        print(ip) # 220.151.192.15 -> 2201519215
'''


# № 25354 (Уровень: Средний)
# Для какого наименьшего целого неотрицательного числа А логическое выражение
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?
'''
def F(x, y, A):
    return (78125 != y + 4 * x) or (A > x) and (A > y)

# 78125 != y + 4 * x
# y = 78125 - 4 * x
for A in range(0, 100000):
    if all(F(x, 78125 - 4 * x, A) for x in range(1, 78125 // 4)):
        print(A)
        break
'''


# Универсальная функция поиска делителей
'''
import time
start = time.time()

# def divisors(x):
#     d = []
#     for j in range(1, x+1):
#         if x % j == 0:
#             d.append(j)
#     return d


def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d.append(j)
            d.append(x // j)
    return sorted(set(d))


def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))


print(divisors(16))  # [1, 2, 4, 8, 16]
print(divisors(24))  # [1, 2, 3, 4, 6, 8, 12, 24]
print(divisors(300_000_000))

end = time.time()
print(end - start)  # 5.325 -> 0.00076
'''


# Функция поиска простых чисел
'''
def divisors(x):
    d = []
    for j in range(1, int(x**0.5)+1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

print([x for x in range(1, 100) if len(divisors(x)) == 2])  # Простые числа
# [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

print([x for x in range(1, 100) if len(divisors(x)) > 2])  # Составные числа
# [4, 6, 8, 9, 10, 12, 14, 15, 16, 18, 20, 21, 22, 24, 25, 26, 27, 28, 30, 32, 33, 34, 35, 36, 38, 39, 40, 42, 44, 45, 46, 48, 49, 50, 51, 52, 54, 55, 56, 57, 58, 60, 62, 63, 64, 65, 66, 68, 69, 70, 72, 74, 75, 76, 77, 78, 80, 81, 82, 84, 85, 86, 87, 88, 90, 91, 92, 93, 94, 95, 96, 98, 99]


def is_prime(x):
    if x <= 1:
        return False
    for j in range(2, int(x ** 0.5) + 1):
        if x % j == 0:
            return False
    return True

print([x for x in range(1, 100) if is_prime(x)])  # Простые числа
print([x for x in range(1, 100) if is_prime(x) == True])  # Простые числа
# [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

print([x for x in range(1, 100) if not is_prime(x)])  # Составные числа
print([x for x in range(1, 100) if is_prime(x) == False])  # Составные числа
# [4, 6, 8, 9, 10, 12, 14, 15, 16, 18, 20, 21, 22, 24, 25, 26, 27, 28, 30, 32, 33, 34, 35, 36, 38, 39, 40, 42, 44, 45, 46, 48, 49, 50, 51, 52, 54, 55, 56, 57, 58, 60, 62, 63, 64, 65, 66, 68, 69, 70, 72, 74, 75, 76, 77, 78, 80, 81, 82, 84, 85, 86, 87, 88, 90, 91, 92, 93, 94, 95, 96, 98, 99]
'''

# № 23282 Основная волна 11.06.25 (Уровень: Средний)
# Пусть М - сумма минимального и максимального простых натуральных
# делителей целого числа, не считая самого числа. Если таких делителей у числа нет,
# то значение М считается равным нулю.
# Напишите программу, которая перебирает целые числа, большие 5 400 000,
# в порядке возрастания и ищет среди них такие, для которых М больше 60 000
# и является палиндромом, т.е. одинаково читается слева направо и справа налево.
# В ответе запишите в первом столбце
# таблицы первые пять найденных чисел в порядке возрастания,
# а во втором столбце - соответствующие им значения М.
'''
def is_prime(x):
    if x <= 1:
        return False
    for j in range(2, int(x ** 0.5) + 1):
        if x % j == 0:
            return False
    return True

def divisors(x):
    d = []
    for j in range(2, int(x**0.5)+1):  # не считая самого числа
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

cnt = 0
for x in range(5_400_000+1, 10**10):
    d = [j for j in divisors(x) if is_prime(j)]
    if len(d) >= 2:
        M = min(d) + max(d)
        if M > 60_000:  # М больше 60 000
            if str(M) == str(M)[::-1]:  # и является палиндромом
                print(x, M)
                cnt += 1
                if cnt == 5:
                    break
'''

# Генераторы списков
'''
n = 5
M = []  # M = list()
for i in range(5):
    x = int(input('x: '))
    M.append(x)
print(M)


print([int(input('x: ')) for x in range(5)])
'''


# ГЕНЕРАТОР[что_кладем откуда_берем]
# ГЕНЕРАТОР[что_кладем откуда_берем при_каком_условии]
'''
M = [x for x in range(10)]  # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
M = [x**2 for x in range(10)]  # [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
M = [x**2 for x in range(10) if x % 2 == 0]  # [0, 4, 16, 36, 64]


# Пример использования из 5 номера
s = '102102012020'  # Какая сумма цифр троичной записи?
print(sum([int(x) for x in s]))  # 11

s = '102re102,.012 020'
print(sum([int(x) for x in s if x.isdigit()]))  # 11

# Пример использования из 15 номера
# № 17678 Пересдача 04.07.24 (Уровень: Базовый)
# Для какого наибольшего целого неотрицательного числа А формула (x+y≤24)∨(y≤x−2)∨(y≥A)
# тождественно истинно (т.е. принимает значение 1) при любых целых положительных x и y.

def F(x, y, A):
    return (x+y <= 24) or (y <= x - 2) or (y >= A)

R = []
for A in range(1, 1000):
    if all(F(x, y, A) for x in range(1, 100) for y in range(1, 100)):
        R.append(A)
print(max(R))

print(max([A for A in range(1, 1000) if all( ((x+y <= 24) or (y <= x - 2) or (y >= A)) for x in range(1, 100) for y in range(1, 100))]))


# Пример использования из 17 номера
# № 25356 (Уровень: Базовый)
# Определите количество троек элементов последовательности, в которых ни один из трёх
# элементов не является четырёхзначным числом, а сумма элементов тройки больше
# максимального элемента последовательности, оканчивающегося на 30

M = [int(s) for s in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in A if x > 0]
C = [x for x in M if abs(x) % 100 == 30]
print(M)  # [-46704, 74975, -51825, -94329, -70014, 27470, -16227, -19635, 71321, -67892
print(A)  # [1843, -2390, 1080, -1511, 9481, -4241, -6842, -8813, 5949, -6770, 7207, 
print(B)  # [1843, 1080, 9481, 5949, 7207, 6533, 5419, 9852, 6058, 9766, 9167, 742
print(C)  # [47430, -13430, 16630, 51230, 69030, -28930, -48830, -14030, 417
'''


# Метод строк .split() - разбивает строку на список строк
'''
print('11,16,18,32,35,40,22'.split(','))  # ['11', '16', '18', '32', '35', '40', '22']
print('11;16;18;32;35;40;22'.split(';'))  # ['11', '16', '18', '32', '35', '40', '22']
print('11 16 18 32 35 40 22'.split())  # ['11', '16', '18', '32', '35', '40', '22']

print(','.join(['11', '16', '18', '32', '35', '40', '22']))  # '11,16,18,32,35,40,22'
print(';'.join(['11', '16', '18', '32', '35', '40', '22']))  # '11;16;18;32;35;40;22'
print(' '.join(['11', '16', '18', '32', '35', '40', '22']))  # '11 16 18 32 35 40 22'


for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    print(M)
    # [68, 78, 67, 20, 16, 10, 54]
    # [52, 86, 39, 74, 32, 72, 30]
    # [76, 80, 35, 19, 16, 44, 24]

for s in open('files/27A.txt'):
    s = s.replace(',', '.')  #  '2,49081369
    x, y = [float(i) for i in s.split()]
    print(x, y, type(x))
    # 1.65115234 6.214693182 <class 'float'>
    # 1.51237711 6.336059273 <class 'float'>
    # 3.42423079 17.08911527 <class 'float'>
'''


print('x y z w F')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (w <= y) <= ((z <= x) or (not z))
                if F == 0:
                    print(x, y, z, w, int(F))

for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                F = (w <= y) <= ((z <= x) or (not z))
                if F == 1:
                    print(x, y, z, w, int(F))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 13, 14, 15, 16, 18, 19-21, 23, 25, 27.1]
# КЕГЭ = []
# на следующем уроке:
