# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Взятие различных систем счисления
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alp[:2])  # ['0', '1']
print(alp[:8])  # ['0', '1', '2', '3', '4', '5', '6', '7']
print(alp[:16])  # ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F']
'''

# № 23752 Демоверсия 2026 (Уровень: Базовый)
# Значение арифметического выражения записали в системе счисления с основанием 27.
#  Определите в 27-ричной записи числа количество цифр с числовым значением, превышающим 9.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


n = 2*2187**2020 + 729**2021 -2*243**2022 + 81**2023 -2*27**2024 - 6561
s = convert(n, 27)
print(s.count('0'))  # Найти кол-во значащих нулей 
print(len(s) - s.count('0'))  # Кол-во ненулевых символов 
print(len([x for x in s if x > '9']))  # Больших чем '9'
'''


# № 23754 Демоверсия 2026 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

RES = []
for x in range(1, 3000):
    n = 9 * 11**210 + 8*11**150 - x
    s = convert(n, 11)
    if s.count('0') == 60:
        RES.append(x)
print(max(RES))
'''

# Вариант 2
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


for x in range(3000, -1, -1):
    n = 9 * 11**210 + 8*11**150 - x
    s = convert(n, 11)
    if s.count('0') == 60:
        print(x)
        break
'''


# № 23560 Пересдача 03.07.25 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


for x in range(2400, -1, -1):
    n = 7 * 9**210 + 6*9**110 - x
    s = convert(n, 9)
    if s.count('0') == 100:
        print(x)
        break
'''


# № 14343(Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 5 * 343**2031 + 4*49**2142 -3*7**111 + 7**222
s = convert(n, 7)
print(s)


summa = 0
for x in s:
    summa += int(x)
print(summa)

print(sum([int(x) for x in s]))

print(sum(map(int, s)))
'''

# РоманВладимирович

# № 20808 Апробация 05.03.25 (Уровень: Средний)
# Значение арифметического выражения 7**170+7**100-х, где х - целое положительное число, не превышающее 2030, записали
# в 7-ричной системе счисления. Определите наибольшее значение х, при котором количество
# нулей в 7-ричной записи числа, являющегося значением данного арифметического выражения, максимально.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

m=[]
for x in range(1, 2031):
    n = 7**170+7**100 - x
    s = convert(n, 7)
    m.append([s.count('0'), x])

print(max(m))
'''

# № 16380 ЕГКР 27.04.24 (Уровень: Базовый)

# Определите в 25-ричной записи числа количество цифр с числовым значением, превышающим 10:
# 4*3125**2019 + 3**625**2020 - 2**125**2021 + 25**2022 - 4*5**2023 - 2024
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')


def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


n = 4 * 3125 ** 2019 + 3 ** 625 ** 2020 - 2 ** 125 ** 2021 + 25 ** 2022 - 4 * 5 ** 2023 - 2024
s = convert(n, 25)
print(len([x for x in s if x > 'A']))
'''

'''  Пример решения
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]


for x in range(3000, -1, -1):
    n = 9 * 11**210 + 8*11**150 - x
    s = convert(n, 11)
    if s.count('0') == 60:
        print(x)
        break
'''

# РоманСергеевич

# № 20904 Апробация 05.03.25 (Уровень: Базовый)
# Значение арифметического выражения 3**100 – x, где x – целое положительное число,
# не превышающее 2030, записали в троичной системе счисления.
# Определите наибольшее значение x, при котором в троичной записи числа,
# являющегося значением данного арифметического выражения, содержится ровно один нуль.
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

res = []    
for x in range(2030,0, -1):
    n = 3**100 - x
    s = convert(n, 3)
    if s.count("0") == 1:
        res.append(x)
print(max(res))'''

# № 19880 (Уровень: Базовый)

# (М. Попков) Значение арифметического выражения

# 15625**16 - 3125**3 * 25**19 + 625**4 - 2005
# записали в системе счисления с основанием 25. Сколько значащих нулей содержится в этой записи?

'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    r = ''
    while n > 0:
        r += alp[n % b]
        n //= b
    return r[::-1]

n = 15625**16 - 3125**3 * 25**19 + 625**4 - 2005
s = conver(n, 25)
print(s.count("0"))
'''


# № 23753 Демоверсия 2026 (Уровень: Базовый)
'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:29]:
    A = int(f'923{x}874', 29)
    B = int(f'524{x}6152', 29)
    if (A + B) % 28 == 0:
        print(x, (A + B) // 28)
'''

# № 20193 (Уровень: Базовый)
# (М. Попков) Операнды арифметического выражения записаны в системе счисления с основание 18:
# 11Hx05_18 + 3Fx54x8_18 + Gxxx9_18
# x — неизвестная цифра из алфавита 18-ричной системы счисления. Найдите наименьшее значение x,
# при котором результат выражения кратен 14.

# Для найденного x вычислите частное от
# деления значения арифметического выражения на 14 и укажите его в ответе в десятичной системе счисления.

'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alp[:18]:
    A = int(f'11H{x}05', 18)
    B = int(f'3F{x}54{x}8', 18)
    C = int(f'G{x}{x}{x}9', 18)
    if (A + B + C) % 14 == 0:
        print(x, (A + B + C) // 14)
        # 2 9600497
        # 9 9656243
        # G 9711989
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 14]
# КЕГЭ = []
# на следующем уроке:
