# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 11830 (Уровень: Средний)

'''
from math import prod
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    copit2 = [x for x in M if M.count(x) == 2]
    copit1 = [x for x in M if M.count(x) == 1]
    if len(copit2) == 4: #[3, 3, 5, 5]
        if len(copit1) == 3:
            if prod(copit2) > prod(copit1)*2:
                cnt += 1
print(cnt)
'''


# № 9696(Уровень: Средний)
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(';')]
    copid2 = [x for x in M if M.count(x) == 2]
    if len(copid2) == 2:
        M = sorted(M)
        if M[-1] + M[-2] > (M[0] + M[1]) * 2:
            if max(M) % min(M) != 0:
                cnt += 1
                print(cnt)
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27.1]
# КЕГЭ = [3, 5, 7, 8, 9, 12, 14, 15, 16, 17, 18, 19-21, 23, 25]
# на следующем уроке: 8


# region 📖 Пробник (Вариант 2)

# Студент #Влад
# Дата: #Четверг #12Марта2026
# ✅ Верно: 1, 2, 3, 4, 10, 14, 16, 18, 19, 20, 21, 23
# ⛔️ Неверно: 6, 7, 8
# ❔ Без ответа: 5, 9, 11, 12, 13, 15, 17, 22, 24, 25, 26, 27
# Итог: 12/29 первичных балла ~ 56 вторичных

# endregion 📖 Пробник (Вариант 2)
