# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 23189 Основная волна 10.06.25 (Уровень: Базовый)
# Укажите максимальное число N, после обработки которого с помощью
# этого алгоритма получается число R, меньшее 130.

'''
R = []
for n in range(1, 10000):
    x = f'{n:b}'  # x = bin(n)[2:]
    if n % 3 == 0:
        x = x + x[-3:]  # x = x + x[-3] + x[-2] + x[-1]
    else:
        x = x + f'{(n % 3) * 3:b}'
    r = int(x, 2)
    if r < 130:
        R.append(n)
print(max(R))
'''


# № 23375 Резервный день 19.06.25 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(50000)

def F(n):
    return G(n-1) + G(n-3)

def G(n):
    if n <= 9:
        return 3*n
    if n > 9:
        return G(n-4) + 2

print(F(42999))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке: Библиотеки перечислить, Условные операторы, Циклы


