# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 25364 ЕГКР 13.12.25 (Уровень: Базовый)
'''
from math import dist
clustersA = [[], []]
clustersB = [[], [], []]

for s in open('0. files/27A.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y > 10:
        clustersA[0].append([x, y])
    else:
        clustersA[1].append([x, y])

for s in open('0. files/27B.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y < 15:
        clustersB[0].append([x, y])
    if 15 < y < 23:
        clustersB[1].append([x, y])
    if y > 23:
        clustersB[2].append([x, y])


# from math import dist
# def d(A, B):
#     x1, y1 = A
#     x2, y2 = B
#     return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
#
# print(d([4, 5], [7, 8]))  # 4.2426
# print(dist([4, 5], [7, 8]))  # 4.2426

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        R.append([summa, p])
    return min(R)[1]


# Для файла А определите координаты центра каждого кластера, затем найдите два числа:
# P1 - минимальное расстояние от точки с координатами (1,0; 1,0) до центра кластера, и
# P2 - максимальное расстояние от этой же точки до центра кластера.

print(center(clustersA[0]))  # [7.0391548, 12.3587258]
print(center(clustersA[1]))  # [3.8471735, 6.1225014]

print(dist([1.0, 1.0], [7.0391548, 12.3587258]))  # 12.864371049450831 - P2
print(dist([1.0, 1.0], [3.8471735, 6.1225014]))  # 5.860581671822705 - P1

P1 = 5.860581671822705
P2 = 12.864371049450831

# сначала целую часть произведения P1 × 10000, затем целую часть произведения P2 × 10 000
print(int(P1 * 10000), int(P2 * 10000))  # 58605 128643




# Для файла Б определите координаты центра каждого кластера, затем найдите два числа:
# Q1 - в кластере с наибольшим количеством точек число таких точек,
# которые находятся на расстоянии не более 1,2 от центра кластера, и

# Q2 - в кластере с наибольшим количеством точек число таких точек,
# которые находятся на расстоянии не более 0,75 от центра кластера.

print(center(clustersB[0]))  # [26.6431823, 12.4121727]
print(center(clustersB[1]))  # [15.861917, 18.8540334]
print(center(clustersB[2]))  # [13.9823808, 26.4800432]

print(len(clustersB[0]))  # 451
print(len(clustersB[1]))  # 100
print(len(clustersB[2]))  # 74


def F(cl, center, length):
    cnt = 0
    for p in cl:
        if dist(center, p) <= length:
            cnt += 1
    return cnt

print(F(clustersB[0], [26.6431823, 12.4121727], 1.2))  # 358
print(F(clustersB[0], [26.6431823, 12.4121727], 0.75))  # 203

Q1, Q2 = 358, 203
# во второй строке - сначала Q1, затем Q2.

print(Q1, Q2)  # 358 203
'''


# № 23284 Основная волна 11.06.25 (Уровень: Базовый)
'''
from math import dist
clustersA = [[], []]
clustersB = [[], [], []]

for s in open('0. files/27A.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y > 15:
        clustersA[0].append([x, y])
    else:
        clustersA[1].append([x, y])

for s in open('0. files/27B.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if 0 < x < 10:
        clustersB[0].append([x, y])
    if 10 < x < 20:
        clustersB[1].append([x, y])
    if 20 < x < 25:
        clustersB[2].append([x, y])

def center(cl):
    R = []
    for p in cl:
        summa = 0
        for g in cl:
            summa += dist(p, g)
        R.append([summa, p])
    return min(R)[1]


# Для файла А определите координаты центра каждого кластера, затем найдите два числа:
# Px - сумму абсцисс центров кластеров, и
# Py - сумму ординат центров кластеров.

print(center(clustersA[0]))  # [7.0541856, 24.0926065]
print(center(clustersA[1]))  # [3.646085, 8.281527]

Px = (7.0541856 + 3.646085) * 10000
Py = (24.0926065 + 8.281527) * 10000

# сначала абсолютную величину целой части произведения
# Px × 10000, затем абсолютную величину целой части произведения Py × 10 000
print(int(abs(Px)), int(abs(Py)))  # 107002 323741


# Для файла Б определите координаты центра каждого кластера, затем найдите два числа:
# Q1 - минимальное расстояние между центрами различных кластеров, и
# Q2 - максимальное расстояние между центрами кластеров.

print(center(clustersB[0]))  # [7.1388191, 26.5557487]
print(center(clustersB[1]))  # [16.993709, 31.636538]
print(center(clustersB[2]))  # [22.1529783, 28.820322]

print(dist([7.1388191, 26.5557487], [16.993709, 31.636538]))  # 11.087527896339946
print(dist([7.1388191, 26.5557487], [22.1529783, 28.820322]))  # 15.183980661013027
print(dist([16.993709, 31.636538], [22.1529783, 28.820322]))  # 5.877850990674951

Q1 = 5.877850990674951 * 10000
Q2 = 15.183980661013027 * 10000
print(int(abs(Q1)), int(abs(Q2)))  # 58778 151839
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 3, 2, 4, 5, 6, 8, 13, 14, 15, 16, 18, 19-21, 23, 25, 27.1]
# КЕГЭ = []
# на следующем уроке:
