# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

cnt1 = 0
cnt2 = 0
cnt3 = 0
for s in open('0. files/27A.txt'):
    x, y = [float(i) for i in s.split()]
    if y > 6:
        cnt1 += 1
    if y < 2:
        cnt2 += 1
    if 2 < y < 6:
        cnt3 += 1
print(cnt1 + cnt2 + cnt3, sorted([cnt1, cnt2, cnt3]))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 3, 2, 4, 5, 6, 8, 13, 14, 15, 16, 18, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:
