# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 19882 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(2025)

def F(n):
    if n < 4:
        return 1
    if n >= 4:
        return F(n - 1) + n * 2

print(F(2025))
'''


# № 20906 Апробация 05.03.25 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n * F(n - 1)

print((F(2024) // 4 + F(2023)) // F(2022))
'''
# print((F(2024) / 4 + F(2023)) / F(2022))
# OverflowError: integer division result too large for a float


# № 23756 Демоверсия 2026 (Уровень: Базовый)
'''
import sys
sys.setrecursionlimit(10**8)

def F(n):
    return 2 * (G(n - 3) + 8)

def G(n):
    if n < 10:
        return 2 * n
    if n >= 10:
        return G(n - 2) + 1

print(F(15548))
'''


# № 12470 PRO100 ЕГЭ 29.12.23 (Уровень: Базовый)
'''
from functools import *

@lru_cache(None)
def F(n):
    if n < 3:
        return n
    if n > 2 and n % 2 != 0:
        return F(n - 1) + F(n - 2) + 1
    if n > 2 and n % 2 == 0:
        return sum([F(i) for i in range(1, n)])

for i in range(50):
    F(i)

print(F(38))
'''


# № 21716 ЕГКР 19.04.25 (Уровень: Базовый)
# A. Прибавь 3
# B. Прибавь 7
# C. Умножь на 3
# Сколько существует таких программ, которые исходное число 12 преобразуют
# в 89, и при этом траектория вычислений программы содержит
# числа 40 и 72 и не содержит 56?
'''
def F(a, b):
    if a == b:
        return 1
    elif a > b or a == 56:
        return 0
    else:
        return F(a + 3, b) + F(a + 7, b) + F(a * 3, b)

print(F(12, 40) * F(40, 72) * F(72, 89))


def F(a, b):
    if a >= b or a == 56:
        return a == b
    return F(a + 3, b) + F(a + 7, b) + F(a * 3, b)

print(F(12, 40) * F(40, 72) * F(72, 89))
'''


# № 19253 ЕГКР 21.12.14 (Уровень: Базовый)
# A. вычти 1
# B. вычти 6
# C. найди целую часть от деления на 2
# Сколько существует таких программ, которые исходное число 34 преобразуют
# в число 6, и при этом траектория вычислений содержит числа 19 и 29 и не содержит числа 24?

def F(a, b):
    if a == b:
        return 1
    elif a < b or a == 24:
        return 0
    else:
        return F(a - 1, b) + F(a - 6, b) + F(a // 2, b)
print(F(34, 29) * F(29, 19) * F(19, 6))



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 8, 13, 14, 15, 16, 18, 19-21, 23, 25, 27.1]
# КЕГЭ = [5, 8, 14, 15, 16, 23]
# на следующем уроке:
