# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21421 Досрочная волна 2025 (Уровень: Базовый)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([123456789AB][0-B]*[02468A])'
M = [x.group() for x in finditer(num, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''

# № 17878 Демоверсия 2025 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([6-9][06789]*|[0])'
reg = rf'{num}([-*]{num})*'
M = [x.group() for x in finditer(reg, s)]
maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''


# № 21597 (Уровень: Сложный)
'''
from re import *
s = open('0. files/24.txt').readline()
num = r'([1-5][0-5]*|[0])'
reg = rf'{num}([*]{num})*([-]{num})*'
reg = rf'(?=({reg}))'
M = [x.group(1) for x in finditer(reg, s)]
maxi = 0
for x in M:
    if len(x) == 51:
        print(x)
    maxi = max(maxi, len(x))
print(maxi)
'''
# 51 3021*1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1
# 46      1*1*1*1*2*3*3*4*2-25430-451-12-12-4431-0-0-0-1


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 24, 25]
# КЕГЭ = [22, 25]
# на следующем уроке: повторить 22, 19-21, разобрать 3 с пробника

# Второй пробник 28.02.25:
# Славик 16/25 -> 67 вторичных баллов +[1, 2, 4-14, 16, 17, 18] -[3, 15, 19-21, 22-25]