# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for p in range(8, 36+1):
    for x in alphabet[:p]:
        for y in alphabet[:p]:
            A = int(f'23{y}1{x}7', p)
            B = int(f'{y}26{x}2', p)
            if (A + B) % (alphabet.index(x) + alphabet.index(y)) == 0:
                print((A + B) // (alphabet.index(x) + alphabet.index(y)))


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 24, 25]
# КЕГЭ  = [25]
# на следующем уроке:
