# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


from itertools import *

cnt = 0
for n, p in enumerate(product("ЕЛОПРСТ", repeat=5), 1):
    a = ''.join(p)
    sogl = [x for x in a if x in "ЛПРСТ"]
    if (n % 2 != 0) and (a[-1] in "ЕО"):
        if len(sogl) <= 3:
            cnt += 1

print(cnt)
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 3, 5, 6, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 24, 25]
# КЕГЭ  = [25]
# на следующем уроке:
