# region Домашка: ******************************************************************

# № 23557 Пересдача 03.07.25 (Уровень: Базовый)
'''
alp = 500 + 26 * 2 + 10  # 562
i = 10  # 2 ** 10 >= 562


byte = 49 * 2**20 / 45_877
print(byte) # 1119.956 -> 1120 (требуется более 49 Мбайт)
bit = 1120 * 8

sym = bit / i
print(sym)  # 896.0
'''


# № 11230 (Уровень: Базовый)
'''
sym = 17
alp = 19 + 2  # 21
i = 5  # 2 ** 5 >= 21

bit = sym * i  # 85
print(bit / 8)  # 10.625 -> 11
byte = 11

user = byte + 485
print((user * 4096) / 2**10)
'''


# Статград вариант 2 от 23.10.2025 Номер 11
'''
sym = 128
# alp - ?
# i - ?

byte = 29 * 2 ** 20 / 335793
print(byte)  # 90.557 -> 90 (отведено не более 29 Мбайт)
bit = 90 * 8


i = bit / sym
print(i)  # 5.625 -> 5 (отведено не более 29 Мбайт)

i = 5
print(f'Максимальную мощность алфавита: {2**5}')  # 32
print(f'Минимальная мощность алфавита: {2**4+1}')  # 17


alp = 128  # i = 7 - максимальная мощность алфавита при i = 7

alp = 100  # i = 7


alp = 65  # i = 7 - минимальная мощность алфавита при i = 7
alp = 64  # i = 6 - максимальная мощность алфавита при i = 6

alp = 33  # i = 6 - минимальная мощность алфавита при i = 6


print([2**i for i in range(1, 14)])
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# V_photo = pixels * i
# colors = 2 ** i
# i - кол-во бит на один пиксель


# https://education.yandex.ru/ege/inf/task/3e56d20f-3710-4260-a6aa-4f73c37facec
'''
pixels = 320 * 480
V_photo = 40 * 2**13
i = V_photo / pixels
print(i)  # 2.133 -> 2

colors = 2 ** i
print(2 ** 2)
'''


# https://education.yandex.ru/ege/inf/task/9bad2f7e-3d65-46c8-97e1-7c0546979d97
# Цветное растровое изображение размером 1200 на 1800 пикселей,
# в котором цвет каждого пикселя кодируется 2 байтами, было
# передано по каналу связи ровно за 6 минут.
# Определите пропускную способность канала связи в бит/с.
# В ответе запишите только число.
'''
pixels = 1200 * 1800
i = 16
V_photo = pixels * i

T = 6 * 60

# V = U * T
# U = V / T
print(V_photo / T)  # 96000 бит
'''



# https://education.yandex.ru/ege/inf/task/c4adfb30-2b1d-4601-869e-d52ed7dab6cb
'''
pixels = 1024 * 768
# colors - ?

U = 1_638_400  # бит/с
T = 220
V_all = U * T

V_photo = V_all / 27
print(V_photo)

i = V_photo / pixels
print(i)  # 16.975
'''

# V_music =


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 13, 14, 15, 16, 17, 19-21, 23, 25, 27]
# КЕГЭ = []
# на следующем уроке: 7 номер музыка
