# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 16332 Открытый вариант 2024 (Уровень: Базовый)

'''
def F(a ,b):
    if a > b:
        return 0
    elif a == b:
        return 1
    h = [F(a +1,b), F(a +2,b), F(a * 2,b)]
    return sum(h)

print(F(4, 11) * F(11, 13) * F(13, 15))
'''

# s - это кол-во камней в куче
# n - это шаги нашей игры

# n = 1: Петя 1
# n = 2: Ваня 1
# n = 3: Петя 2
# n = 4: Ваня 2

# № 20126 (Уровень: Базовый)
# 1 куча: +3, +8, *2 | s >= 333 | 1 <= s <= 332
'''
def F(s, n):
    if s >= 333:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s+3, n-1), F(s+8, n-1), F(s*2, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)  # else any(h)

print(19, [s for s in range(1, 332+1) if F(s, n=2)])
print(20, [s for s in range(1, 332+1) if F(s, n=3) and not F(s, n=1)])
print(21, [s for s in range(1, 332+1) if F(s, n=4) and not F(s, n=2)])
'''


# № 23759 Демоверсия 2026 (Уровень: Базовый)
# 1 куча: -3, -5, /4 (вниз) | s <= 30 | s ≥ 31
'''
from math import ceil, floor
def F(s, n):
    if s <= 30:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s-3, n-1), F(s-5, n-1), F(floor(s/4), n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)  # else any(h)

print(19, [s for s in range(31, 1000) if F(s, n=2)])
print(20, [s for s in range(31, 1000) if F(s, n=3) and not F(s, n=1)])
print(21, [s for s in range(31, 1000) if F(s, n=4) and not F(s, n=2)])
'''


# № 22066 (Уровень: Базовый)
# 2 кучи: a+3, s+3, a*2, s*2 | a + s >= 100 | a = 17 | 1 <= s <= 82
'''
def F(a, s, n):
    if a + s >= 100:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(a+3, s, n-1), F(a, s+3, n-1), F(a*2, s, n-1), F(a, s*2, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)  # else any(h)

print(19, [s for s in range(1, 82+1) if F(17, s, n=2)])
print(20, [s for s in range(1, 82+1) if F(17, s, n=3) and not F(17, s, n=1)])
print(21, [s for s in range(1, 82+1) if F(17, s, n=4) and not F(17, s, n=2)])
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 13, 14, 15, 19-21, 23]
# КЕГЭ = []
# на следующем уроке: 16,
