# region Домашка: ******************************************************************

# Простые числа принадлежат натуральным
# P = [2, 3, 5, 7, 11, 13, 17, + inf]
# N = [1, 2, 3, 4, 5, ... + inf]
# Z = [-inf, -2, -1, 0, 1, 2, .., +inf]
# Натуральные числа принадлежат целым


# Поиск делителей числа:
'''
def divisors(n):
    div = []
    for j in range(1, n+1):
        if n % j == 0:
            div.append(j)
    return div


def prime(n):
    if n <= 1:
        return False
    for j in range(2, n):
        if n % j == 0:
            return False
    return True


for n in range(1, 50):
    # if len(divisors(n)) == 2:
    #     print(n, end=' ')  # 2 3 5 7 11 13 17 19 23 29 31 37 41 43 47
    if prime(n):
        print(n, end=' ')  # 2 3 5 7 11 13 17 19 23 29 31 37 41 43 47
'''
from runpy import run_path

# Простые числа
# https://stepik.org/lesson/1309435/step/12?unit=1324551
'''
a = int(input())
b = int(input())
for n in range(a, b+1):
    d = 0
    for j in range(1, n + 1):
        if n % j == 0:
            d += 1
    if d == 2:
        print(n)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Основные свойства списков list()
'''
# i   0    1    2    3    4
L = ['a', 'b', 'c', 'd', 'e']
# -i -5   -4   -3   -2   -1

# 1. Могут хранить неограниченное кол-во значений
# 2. Элементы списка могут принимать различные типа данных
# 3. Каждый элемент имеет свой порядковый номер: индекс
# 4. Считать индексы мы можем слева-направо начиная с 0 или справа-налево начиная с -1
# 5. В отличие от кортежей и строк в списках можно изменять элементы через индексы

print(f'Первый элемент списка L: {L[0]}') # a
print(f'Последний элемент списка L: {L[-1]}')  # e

L[0], L[-1] = L[-1], L[0]
print(L)  # ['e', 'b', 'c', 'd', 'a']

M = [2, 2.0, '2', True, [1, 2, 3], (1, 2, 3), {1, 2, 3}]
for x in M:
    print(type(x), x)
    # <class 'int'> 2
    # <class 'float'> 2.0
    # <class 'str'> 2
    # <class 'bool'> True
    # <class 'list'> [1, 2, 3]
    # <class 'tuple'> (1, 2, 3)
    # <class 'set'> {1, 2, 3}
'''

# Работа с циклами for
'''
# i   0    1    2    3    4
L = ['A', 'b', 'c', 'd', 'E']

for x in L:
    print(x, end=' ')  # A b c d E
print()

for x in L:
    if x.islower():
        print(x, end=' ')  # b c d
print()

print(len(L))  #  5 - Возвращает кол-во элементов в списке L

for i in range(len(L)):
    # print(i, end=' ')  # 0 1 2 3 4
    print(L[i], end=' ')  # A b c d E
print()

for i in range(len(L)):
    L[i] = L[i] * i
print(L)  # ['', 'b', 'cc', 'ddd', 'EEEE']
'''


# СРЕЗЫ списков, строк и других последовательностей
'''
# СРЕЗЫ[START : STOP-1 : STEP]

# i  01234
s = 'abcde'
print(s[1:4])  # 'bcd'

# i   0    1    2    3    4
L = ['a', 'b', 'c', 'd', 'e']

print(L[1:4])  # ['b', 'c', 'd']
print(L[:4])  # ['a', 'b', 'c', 'd'] - все элементы до 4 индекса (не включая конец)
print(L[2:])  # ['c', 'd', 'e'] - все элементы начиная с 2 индекса

print(L[2:])  # - Все элементы кроме первых двух
print(L[-3:])  # - Последние три элемента

print(L[:]) # - Все элементы слева-направо
print(L[::])  # ['a', 'b', 'c', 'd', 'e']

print(L[0::2])  # ['a', 'c', 'e'] - Все элементы с четными индексами
print(L[1::2])  # ['b', 'd'] - Все элементы с нечетными индексами

print(L[::-1])  # ['e', 'd', 'c', 'b', 'a'] - Все элеменыт в обратном порядке 
'''


# Функции списков
'''
L = [1, 2, 2, 3, 3, 3]

print(len(L))  # - Возвращает длину списка (кол-во элементов)
print(sum(L))  # - Возвращает сумму элементов списка
print(max(L), min(L))  # - Возвращает максимальны и минимальный элементы

print(sorted(L))  # [1, 2, 2, 3, 3, 3]
print(sorted(L, reverse=True))  # [3, 3, 3, 2, 2, 1]

print(reversed(L))  # <list_reverseiterator object at 0x100bee020>
print(list(reversed(L)))  # [3, 3, 3, 2, 2, 1] - Развернуть список

print(set(L))  # {1, 2, 3} - убирает повторяющиеся элементы 
'''


# 🖥 Все методы списков в Python, которые понадобятся на ЕГЭ

# .APPEND()
# Метод .append() используется для добавления элемента в конец списка. Пример:
'''
my_list = [1, 2, 3]
my_list.append(4)
my_list.append(5)
print(my_list)  # Вывод: [1, 2, 3, 4, 5]
'''
# Можно реализовать через конкатенацию (склеивание) списков:
'''
my_list = [1, 2, 3]
my_list = [0] + my_list + [4, 5]
print(my_list)  # Вывод: [0, 1, 2, 3, 4, 5]
'''


# .REVERSE()
# Метод .reverse() изменяет порядок элементов в списке на обратный. Пример:
'''
my_list = [1, 2, 3, 4]
my_list.reverse()
print(my_list)  # Вывод: [4, 3, 2, 1]
'''
# Можно записать по другому через срез:
'''
my_list = [1, 2, 3, 4]
my_list = my_list[::-1]
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# .COUNT()
# Метод .count() возвращает количество вхождений заданного элемента в список. Пример:
'''
my_list = [1, 2, 2, 3, 4, 2, '2', '2']
print(my_list.count(2))  # Вывод: 3
print(my_list.count('2'))  # Вывод: 2
'''


# .REMOVE()
# Метод .remove() удаляет первое вхождение указанного элемента из списка. Пример:
'''
my_list = [1, 2, 3, 2, 4]
my_list.remove(2)  # Первая найденная двойка
print(my_list)  # Вывод: [1, 3, 2, 4]

my_list = [1, 2, 3, 2, 4]
while 2 in my_list:
    my_list.remove(2)
print(my_list)  # [1, 3, 4]
'''
# Можно удалить элемент через его индекс используя del:
'''
my_list = [1, 2, 3, 2, 4]
del my_list[1]  # Индекс удаляемого элемента
print(my_list)  # Вывод: [1, 3, 2, 4]

my_list = [1, 2, 3, 2, 4]
del my_list[1::2]
print(my_list)  # [1, 3, 4]
'''

# .INDEX()
# Метод .index() возвращает индекс первого вхождения заданного элемента в списке. Пример:
'''
my_list = [1, 2, 3, 2, 4]
print(my_list.index(2))  # Вывод: 1
'''


# .SORT()
# Метод .sort() сортирует элементы списка по возрастанию (по умолчанию) или в обратном порядке, если передан аргумент reverse=True. Пример:
'''
my_list = [4, 1, 3, 2]
my_list.sort()
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list.sort(reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''
# Скажу честно я не любитель этого метода, считаю, что удобнее будет использовать функцию sorted():
'''
my_list = [4, 1, 3, 2]
my_list = sorted(my_list)
print(my_list)  # Вывод: [1, 2, 3, 4]

my_list = sorted(my_list, reverse=True)
print(my_list)  # Вывод: [4, 3, 2, 1]
'''


# Генераторы списков

# ГЕНЕРАТОР[что_кладем откуда_берем]
# ГЕНЕРАТОР[что_кладем откуда_берем при_каком_условии]

'''
n = int(input())
R = []
for i in range(n):
    x = int(input('x: '))
    R.append(x)
print(R)

print([int(input('x: ')) for x in range(int(input()))])
'''

# ГЕНЕРАТОР[что_кладем откуда_берем]
M = [x for x in range(10)]  # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# ГЕНЕРАТОР[что_кладем откуда_берем при_каком_условии]
M = [x for x in range(10) if x % 2 == 0]  # [0, 2, 4, 6, 8]

M = [x**2 for x in range(10) if x % 2 == 0]  # [0, 4, 16, 36, 64]

from random import randint
n = randint(10, 20)
M = [randint(0, 100) for x in range(n)]
print(M)  # [59, 78, 94, 29, 54, 92, 72, 75, 74, 15, 5, 20, 22, 49, 35]

chet = [x for x in M if x % 2 == 0]
print(chet)  # [78, 94, 54, 92, 72, 74, 20, 22]

nechet = [x for x in M if x not in chet]
print(nechet)  # [59, 29, 75, 15, 5, 49, 35]

copied = [x for x in M if M.count(x) > 1]
print(copied)  # []

not_copied = [x for x in M if M.count(x) == 1]
print(not_copied)  # [59, 78, 94, 29, 54, 92, 72, 75, 74, 15, 5, 20, 22, 49, 35]

A = [x for x in M if x % 10 == 5]
print(A)  # [75, 15, 5, 35]

B = [x for x in M if len(str(x)) == 2]
print(B)  # [59, 78, 94, 29, 54, 92, 72, 75, 74, 15, 20, 22, 49, 35]

AB = [x for x in M if x in A and x in B]
print(AB)  # [75, 15, 35]

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
