# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



'''
# =ВПР(C2;$A:$G;7;0)
# =ВПР(C2;$A:$I;9;0)
# =ВПР(C2;$A:$K;11;0)
'''
# https://education.yandex.ru/ege/inf/task/19c1aebb-cfc7-48e4-b910-1272a363da7e
# Определите минимальное время, через которое завершится выполнение всей
# совокупности процессов, при условии, что все независимые друг от друга
# процессы могут выполняться параллельно.

# Определите кол-во процессов, которые завершаться за первые 50 сек.

# Определите кол-во процессов, которые начинаются и завершаются в промежутоке [40:80]


'''
# =ЕСЛИ(И($H2<=I$1;I$1<=$G2);1;"")
# =ЕСЛИ(И($I2<=K$1;K$1<=$J2);1;"")
# =ЕСЛИ(И($K2<=M$1;M$1<=$L2);1;"")
'''
# Определите максимальную продолжительность отрезка времени (в мс),
# в течение которого возможно одновременное выполнение максимального
# количества процессов при условии и время окончания работы каждого процесса минимально.

# Определите максимальную продолжительность отрезка времени (в мс),
# в течение которого возможно одновременное выполнение пяти процессов

# https://education.yandex.ru/ege/inf/task/c1faf2ab-0ceb-416d-a848-66449ee138ba
# Определите максимальную продолжительность отрезка времени (в мс),
# в течение которого возможно одновременное выполнение максимального
# количества процессов при условии и время окончания работы всех процессов минимально.

# Определите максимальную продолжительность отрезка времени (в мс),
# в течение которого возможно одновременное выполнение максимального
# количества процессов



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 25, 27]
# КЕГЭ = [22, 6, 7, 10, 11, 12, 17]
# на следующем уроке: 22, 17 24 27 26


# region 📖 Пробник (Вариант 2)

# Студент #Софья
# Дата: #Пятница #27Февраля2026
# ✅ Верно: 1, 2, 3, 5, 7, 8, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 4, 6, 9, 10, 12, 14, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных

# Студент #Лиза
# Дата: #Понедельник #02Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 6, 8, 9, 10, 12, 14, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных

# endregion 📖 Пробник (Вариант 2)
