# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Номер 9 Досрочная волна (https://stepik.org/lesson/2320300/step/9?unit=2355309)
'''
from itertools import permutations
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    if max(M) < sum(M) - max(M):
        if all(P[0] + P[1] != P[2] + P[3] for P in permutations(M, r=4)):
            cnt += 1
print(cnt)
'''
# M = [1, 2, 3, 4]

# P = [1, 3, 2, 4]
# P = [1, 3, 4, 2]
# P = [1, 4, 3, 2]
# ...........


# Номер 16 Досрочная волна (https://stepik.org/lesson/2320302/step/6?unit=2355312)

# F(n) = (n + 4) * F(n - 5)
# F(257487) = (257487 + 4) * F(257482)
# F(257482) = (257482 + 4) * F(257477)
# F(257477) = (257477 + 4) * F(257472) / F(257472)
half1 = ((257487 + 4) * (257482 + 4) * (257477 + 4)) // 683

# F(257477) = (257477 + 4) * F(257472) / F(257472)
half2 = (257477 + 4) // 67
print(half1 + half2)  # 24994252796625


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19-21, 22, 23, 25, 27]
# КЕГЭ = [6, 7, 10, 11, 12, 17]
# на следующем уроке: 9 14 22 26 27


# region 📖 Пробник (Вариант 2)

# Студент #Софья
# Дата: #Пятница #27Февраля2026
# ✅ Верно: 1, 2, 3, 5, 7, 8, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 4, 6, 9, 10, 12, 14, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных

# Студент #Лиза
# Дата: #Понедельник #02Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 6, 8, 9, 10, 12, 14, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных

# endregion 📖 Пробник (Вариант 2)
