# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# НОМЕР 11
'''
sym = 15
alp = 12
i = 4  # alp <= 2 ** i

bit = sym * i
print( bit / 8) # 7.5 => 8
byte = 8

user = 400 / 20
# user = byte + dop
dop = user - byte
print(dop)
'''
# ответ: 12


# НОМЕР 9
'''
cnt = 0
for i in open('files/9.csv'):
    M = [int(x) for x in i.split(';')]
    # В строке есть только 2 равных числа, остальные 4 различны
    copied2 = [x for x in M if M.count(x) == 2]
    copied1 = [x for x in M if M.count(x) == 1]
    if len(copied2) == 2 and len(copied1) == 4:
        # Среднее арифметическое повторяющихся чисел меньше среднего арифметического остальных.
        if sum(copied2) / 2 < sum(copied1) / 4:
            cnt += 1
print(cnt)
'''

# НОМЕР 8
# Сколько существует девятеричных пятизначных чисел,
# которые содержат в своей записи ровно две цифры 3,
# в которых нечетная цифра не стоит рядом с цифрой 2?
'''
cnt = 0
from itertools import product
for p in product('0123456789', repeat=5):
    num = ''.join(p)
    if num[0] != '0':
        if int(num) % 4 == 0:
            for x in '02468':
                num = num.replace(x, '*')
            if '**' not in num:
                cnt += 1
print(cnt)
'''


# НОМЕР 16
'''
import sys
sys.setrecursionlimit(10**8)
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n - 1 + F(n - 1)
print(F(2028)-F(2024))
'''

'''
from functools import *

@lru_cache(None)
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n - 1 + F(n - 1)

for n in range(0, 2050):
    F(n)

print(F(2028)-F(2024))
'''

'''
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return n - 1 + F(n - 1)

print(F(2028)-F(2024))
'''
# F(n) = n - 1 + F(n - 1)  при n > 1
# F(2028) = 2028 - 1 + F(2027)
# F(2027) = 2027 - 1 + F(2026)
# F(2026) = 2026 - 1 + F(2025)
# F(2025) = 2025 - 1 + F(2024) - F(2024)
'''
print(2027 + 2026 + 2025 + 2024)
'''


'''
alp = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
print(alp[:24])
s = open('files/24.txt').readline()
for x in alp[24:]:
    s = s.replace(x, ' ')
print(max(len(x) for x in s.split() if x[0] != '0'))


from re import *
s = open('files/24.txt').readline()
pat = '[1-N][0-N]*'
M = [x.group(0) for x in finditer(pat, s)]
print(max(len(x) for x in M))
'''


# Определите количество троек элементов последовательности,
# в которых из трёх элементов тройки пятизначными числами
# являются только два, а сумма элементов тройки не больше
# максимального элемента последовательности, оканчивающегося на 22.
# В ответе запишите кол-во найденных троек чисел, затем максимальную
# из сумм элементов таких троек. Под тройкой подразумевается три
# идущих подряд элемента последовательности.

RES = []
M = [int(x) for x in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5]
B = [x for x in M if abs(x) % 100 == 22]
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 2:
        if (x + y + z) <= max(B):
            RES.append(x + y + z)
print(len(RES), max(RES))



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19-21, 22, 23, 25, 27]
# КЕГЭ = [6, 7, 10, 11, 12, 17]
# на следующем уроке: 9 17 24 27 26


# region 📖 Пробник (Вариант 2)

# Студент #Софья
# Дата: #Пятница #27Февраля2026
# ✅ Верно: 1, 2, 3, 5, 7, 8, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 4, 6, 9, 10, 12, 14, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных

# Студент #Лиза
# Дата: #Понедельник #02Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 7, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25
# ⛔️ Неверно: 6, 8, 9, 10, 12, 14, 17, 22, 24, 26, 27
# ❔ Без ответа: Нет
# Итог: 16/29 первичных балла ~ 67 вторичных

# endregion 📖 Пробник (Вариант 2)
