# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 20813 Апробация 05.03.25 (Уровень: Сложный)

from re import *
s = open('0. files/24.txt').readline()
num = r'([789][0789]*[0]|[0])'
reg = rf'{num}([-*]{num})*'

M = [x.group() for x in finditer(reg, s)]

maxi = 0
for x in M:
    print(x)
    maxi = max(maxi, len(x))
print(maxi)

print(max([len(x.group()) for x in finditer(reg, s)]))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ = []
# на следующем уроке: 27 номера

# Первый пробник 21.12.24:
# Стас 9/29 -> 48 вторичных баллов +[2, 3-5, 7, 10, 12, 16, 22] -[1, 6, 8, 9, 11, 13, 14, 15, 17-21, 24-25]

# Второй пробник 28.02.25:
# Стас 18/29 -> 72 вторичных баллов +[1-5, 7, 8, 10, 11, 13-16, 18-21, 23] -[6, 9, 12, 17, 22, 24, 25]
