# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
from ipaddress import *
cnt = 0
for mask in range(32+1):
    net1 = ip_network(f'201.44.240.33/{mask}', 0)
    net2 = ip_network(f'201.44.240.107/{mask}', 0)
    if net1 == net2:
        if f'{net2.network_address:b}'.count('1') >= 5:
            cnt += 1
print(cnt)
'''

'''
from ipaddress import *
cnt = 0
for mask in range(32+1):
    net = ip_network(f'201.44.240.33/{mask}', 0)
    print(net.num_addresses)


    # 201.44.240.33 - узел
    # mask - кол-во единиц в двоичной записи маски сети
    # 32 - mask - кол-во нулей в двоичной записи маски сети
    # net = 201.44.240.32/28 (адрес сети / кол-во единиц в маске)
    # net.network_address - адреса сети
    # net.netmask - маска сети в десятичной записи
    # net.num_addresses - это кол-во айпи адресов в сети
'''


# № 19249 ЕГКР 21.12.24 (Уровень: Базовый)

M = [int(x) for x in open('0. files/17.txt')]
D = [x for x in M if abs(x) % 100 == 43 and len(str(abs(x))) == 5]
R = []
for i in range(len(M)-2):
    x, y, z = M[i:i+3]
    if (x in D) + (y in D) + (z in D) >= 1:
        if (x**2 + y**2 + z**2) <= max(D)**2:
            R.append(x**2 + y**2 + z**2)
print(len(R), min(R))







# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 9, 8, 11, 12, 13, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:  8, 9, 7, 11, 17, 24

# Первый пробник 21.12.24:
# Стас 9/21 -> 48 вторичных баллов +[2, 3-5, 7, 10, 12, 16, 22] -[1, 6, 8, 9, 11, 13, 14, 15, 17-21, 24-25]
