# region Домашка: ******************************************************************

'''
print('x y z w')
for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            for w in 0, 1:
                f = ((x == z) or (not (x == w))) and ((y <= x) or (not z))
                if f == 0:
                    print(x, y, z, w)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# https://education.yandex.ru/ege/task/5b359b5d-e6d1-4701-9d12-c1b1db50e775

symbols = 116
alphabet = 16 + 2035
print(alphabet)   # 2 ** i >= alphabet
print(2**12)
i = 12  # бит на один символ
bit = symbols * i
print(bit / 8)  # 174
byte = 174

print((65536 * byte) / 2**20)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 6, 9, 8, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
