# region Домашка: ******************************************************************

# КЕГЭ № 6985 (Уровень: Средний)
# (Д. Статный) Все шестибуквенные слова, в составе которых могут быть только русские буквы М, А, Р, К, С, Л
# записаны в алфавитном порядке и пронумерованы начиная с 1.
#
# 1. АААААА
#  2. АААААК
#  3. АААААЛ
#  4. АААААМ
#  5. АААААР
#  6. АААААС
#
# Под каким последним номером идёт слово, в котором буквы К не стоят рядом
# с буквой С и одна буква повторяется трижды, а остальные не повторяются?
'''
from itertools import *
n = 0
sp = []
for i in product(sorted('МАРКСЛ'), repeat=6):
    s = ''.join(i)
    n += 1
    if 'КС' not in s or 'СК' not in s:
        # if len(set(s)) == 4 and any(s.count(x) == 3 for x in s):
        copied = [x for x in s if s.count(x) == 3]
        not_copied = [x for x in s if s.count(x) == 1]
        if len(copied) == 3 and len(not_copied) == 3:
            sp.append(n)

print(max(sp))
'''

'''
from itertools import *

sp = []  # БАААА
n = 0
for i in product(sorted('БАРШ'), repeat=5):
    s = ''.join(i)
    n += 1
    if s.count('А') >= 2:
        alp = [s.count(a) for a in s]
        if alp.count(2) == 2 and alp.count(1) == 3:
            sp.append(n)

print(max(sp))
'''

'''
from itertools import product
a0 = '2468'
a1 = '1357'
k = 0
for x in product(a1,a0,a1 ,a0,a1,a0,a1,a0,a1):
    s = ''.join(x)
    if all(s.count(x) <= 3 for x in s):
        k += 1
print(k*2)
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 14]
# КЕГЭ  = []
# на следующем уроке: 13, 25
