# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Задание 7 https://education.yandex.ru/ege/task/935e9e59-a795-4e5b-bad5-013dfefb5a5a
'''
pixels = 1280 * 1024
# V = 800 * 1024 * 8
# V = 800 * 2**10 * 2**3
V = 800 * 2**13  # бит


# V = pixels * i , где i - это кол-во бит на один пиксель
# colors = 2 ** i  # цветов: 64 -> i = 6 бит, цветов: 68 -> i = 7 бит

i = V / pixels
i = i - 1  # 5.0
print(2 ** i)
'''


# Задание 7 https://education.yandex.ru/ege/task/7ca1cc68-b078-47db-b54a-e21af25f782d
'''
pixels = 1280 * 960
V = 320 * 2**13  # бит
i = V / pixels
print(i)  # 2.1333 -> 2 так как если мы возьмем 3, то объем сильно увеличится, а превышать 320 Кбайт мы не можем
print(2 ** int(i))
'''


# Задание 7 https://education.yandex.ru/ege/task/ceddc23d-72f7-4523-87fc-761db29eff27
'''
pixels = 640 * 860
V = 500 * 2 ** 13  # бит -> 77% так как файл сжат
V_origenal = V * 1.23  # бит -> 100%
print(V_origenal / pixels)  # 9.153488 -> i = 9
print(2 ** 9)
'''

# Задание 7 https://education.yandex.ru/ege/task/d5d28bd5-14b2-4087-86d2-8e093fc949e4
'''
pixels = 1024 * 768
t = 288  # c
U = 65536  # бит / с
V = U * t
i = V / pixels  # 24 бит
print(2 ** i)
'''


# Задание 7 https://education.yandex.ru/ege/task/69f7445f-bff9-4586-bd5b-1bbfa80ff30d

# V (бит) = a (шт) * b (Гц) * c (бит) * t (сек)
'''
t = 90
a = 2
c = 16
b = 48000
V = a * b * c * t

U = 3200  # бит / с

print(V / U)  # 43200 сек
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 9, 8, 11, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
