# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 12 №10477
# Какая строка получится в результате применения приведённой ниже программы к строке,
# состоящей из 1000 идущих подряд цифр 8? В ответе запишите полученную строку.
#
# ПОКА нашлось (999) ИЛИ нашлось (888)
#   ЕСЛИ нашлось (888)
#     ТО заменить (888, 9)
#   ИНАЧЕ заменить (999, 8)
'''
s = '8' * 1000
while '999' in s or '888' in s:
    if '888' in s:
        s = s.replace('888', '9', 1)
    else:
        s = s.replace('999', '8', 1)
print(s)
'''


# Тип 12 №59717
'''
for n in range(4, 10000):
    s = '5' + '2' * n
    while '52' in s or '1122' in s or '2222' in s:
        if '52' in s:
            s = s.replace('52', '11', 1)
        if '2222' in s:
            s = s.replace('2222', '5', 1)
        if '1122' in s:
            s = s.replace('1122', '25', 1)
    # summa = sum(map(int, s))
    summa = sum([int(x) for x in s])
    if summa == 64:
        print(n)
        break
'''


# Тип 12 №27240
# ПОКА нашлось (11)
#     ЕСЛИ нашлось (112)
#         ТО заменить (112, 6)
#         ИНАЧЕ заменить (11, 3)

# Исходная строка содержит десять единиц и три двойки, других цифр нет,
# точный порядок расположения единиц и двоек неизвестен.
# Какую наибольшую сумму цифр может иметь строка,
# которая получится после выполнения программы?
'''
from itertools import permutations, product
R = []
for per in product('12', repeat=13):
    if per.count('2') == 3:
        s = ''.join(per)
        while '11' in s:
            if '112' in s:
                s = s.replace('112', '6', 1)
            else:
                s = s.replace('11', '3', 1)
        summa = sum(map(int, s))
        R.append(summa)
print(max(R))
'''

'''
def prime(x):
    for j in range(2, int(x**0.5)+1):
        if x % j == 0:
            return False
    return True


for n in range(100, 200):
    s = '0' + '1' * n + '2' * n + '0'
    while '00' not in s:
        s = s.replace('02', '101', 1)
        s = s.replace('11', '2', 1)
        s = s.replace('12', '21', 1)
        s = s.replace('010', '00', 1)
    summa = sum([int(x) for x in s])
    if prime(summa):
        print(n)
        break
'''




# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 12, 14]
# КЕГЭ  = []
# на следующем уроке:
