# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
cnt = 0
for s in open('files/9.csv'):

    m = sorted([int(x) for x in s.split(';')])
    flag = 0
    if len(m) != set(m):
        flag += 1

    if len([i for i in m if i % 2 == 0]) == 1:
        flag += 1

    if flag == 1:
        cnt += 1
print(cnt)
'''


# Определите количество пятизначных чисел в шестнадцатеричной
# системе счисления, которые не
# оканчиваются чётными цифрами и не начинаются с цифры 1.
'''
from itertools import *
cnt = 0
for i in product('0123456789abcdef', repeat=5):
    s = ''.join(i)
    # if s[0] != '1' and s[0] != '0':
    if s[0] not in '01':
        if s[-1] not in '02468ace':
            cnt += 1
print(cnt)
'''

# Определите количество пятизначных чисел в шестнадцатеричной системе счисления, которые не
# оканчиваются чётными цифрами и не начинаются с цифры 1.
'''
from itertools import *
cnt = 0
for i in product(sorted('0123456789abcdef'), repeat=5):
    s = ''.join(i)
    if s[0] not in '10':
        if s[4] == '0' or s[4] == '2' or s[4] == '4' or s[4] == '6' or s[4] == '8' or s[4] == 'a' or s[4] == 'c' or s[4] == 'e':
            cnt += 1
print(cnt)
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 9, 8, 11, 12, 13, 14, 15, 16, 17, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:  8, 19-21, 9, 7, 11, 17, 24

# Первый пробник 21.12.24:
# Стас 9/21 -> 48 вторичных баллов +[2, 3-5, 7, 10, 12, 16, 22] -[1, 6, 8, 9, 11, 13, 14, 15, 17-21, 24-25]
