# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 15 №33485
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа А формула
# ДЕЛ(120, A) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 18) → ¬ДЕЛ(x, 24)))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной x)?

# Вариант 1
'''
def F(x, A):
    # return ДЕЛ(120, A) and (¬ДЕЛ(x, А) <= (ДЕЛ(x, 18) <= ¬ДЕЛ(x, 24)))
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


R = []
for A in range(1, 10000):
    flag = True
    for x in range(1, 10000):
        if not F(x, A):
            flag = False
            break
    if flag:
        R.append(A)

print(max(R))


# Вариант 2
def F(x, A):
    # return ДЕЛ(120, A) and (¬ДЕЛ(x, А) <= (ДЕЛ(x, 18) <= ¬ДЕЛ(x, 24)))
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


R = []
for A in range(1, 10000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A):
            cnt += 1
    if cnt == 9999:
        R.append(A)

print(max(R))
'''


# Вариант 3
'''
def F(x, A):
    # return ДЕЛ(120, A) and (¬ДЕЛ(x, А) <= (ДЕЛ(x, 18) <= ¬ДЕЛ(x, 24)))
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


R = []
for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        R.append(A)

print(max(R))


# Вариант 4
def F(x, A):
    # return ДЕЛ(120, A) and (¬ДЕЛ(x, А) <= (ДЕЛ(x, 18) <= ¬ДЕЛ(x, 24)))
    return (120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))


for A in range(10000, 0, -1):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)
        break


# Вариант 5
print(max([A for A in range(1, 1000) if all( ((120 % A == 0) and ((x % A != 0) <= ((x % 18 == 0) <= (x % 24 != 0)))) for x in range(1, 10000))]))
'''

# Тип 15 №47012
# На числовой прямой даны два отрезка: P=[69;91] и Q=[77;114].
# Укажите наименьшую возможную длину такого отрезка A, для которого формула
# (x∈P)→(¬((x∈P)≡(x∈Q))∨((x∈Q)→(x∈A)))
# тождественно истинна (то есть принимает значение 1 при любом значении переменной х).

'''
def F(a1, a2, x):
    P = 69 <= x <= 91
    Q = 77 <= x <= 114
    A = a1 <= x <= a2
    return P <= ((not(P == Q)) or (Q <= A))

R = []
M = [x / 4 for x in range(50 * 4, 120 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(a1, a2, x) for x in M):
            R.append(a2 - a1)

print(min(R))
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 12, 13, 14, 15, 16, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
