# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 18115 (Уровень: Базовый)
'''
from itertools import *
table = '14 15 17 24 26 35 36 37 41 42 51 53 56 62 63 65 71 73'
graph = 'EF FE EC CE CG GC GF FG FD DF GD DG DB BD BA AB AC CA'

print('1 2 3 4 5 6 7')
for p in permutations('ABCDEFG'):
    new_table = table
    for i in range(1, 7+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 6, 9, 8, 12, 13, 14, 15, 16, 17, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:
