# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Вариант Бахтиев и Шастин номер 8

# Номер 9
'''
n = 0
summa = 0
for i in open('0. files/9.csv'):
    n += 1
    M = sorted([int(x) for x in i.split(';')])
    if len(set(M)) == len(M):
        if (M[0] + M[3])**2 > M[1]**3 + M[2]**3:
            summa += n
print(summa)
'''
# Ответ: 58398


# Номер 11
'''
from math import *
k1 = 17
N1 = 26
i1 = ceil(log2(N1))
I1 = k1*i1

k2 = 1
N2 = 365
i2 = ceil(log2(N2))
I2 = k2*i2

I = ceil((I1 + I2) / 8)
print(I)  # 12

for dop in range(0, 100000):
    if 50*(I+dop) == 2500:
        print(dop)
'''


# Номер 13
'''
from ipaddress import *
net = ip_network('158.214.121.40/255.255.255.224', 0)
for ip in net:
    print(ip)
    # 158.214.121.33
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 9, 8, 11, 12, 13, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = []
# на следующем уроке:  8, 9, 7, 11, 17, 24

# Первый пробник 21.12.24:
# Стас 9/21 -> 48 вторичных баллов +[2, 3-5, 7, 10, 12, 16, 22] -[1, 6, 8, 9, 11, 13, 14, 15, 17-21, 24-25]
