# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 21425 Досрочная волна 2025 (Уровень: Базовый)

clusterA = [[], []]
clusterB = [[], [], []]

for s in open('0. files/27_A.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if y < 0:
        clusterA[0].append([x, y])
    else:
        clusterA[1].append([x, y])


for s in open('0. files/27_B.txt'):
    s = s.replace(',', '.')
    x, y = [float(i) for i in s.split()]
    if x > 0 and  y > 0:
        clusterB[0].append([x, y])
    elif x > 0 and y < 0:
        clusterB[1].append([x, y])
    else:
        clusterB[2].append([x, y])


def d(A, B):
    """
    Расстояние между двумя точками на плоскости вычисляется по формуле ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    """
    x1, y1 = A
    x2, y2 = B
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5


def center(cl):
    """
    Будем называть центром кластера точку этого кластера,
    сумма расстояний от которой до всех остальных точек кластера минимальна
    """
    R = []
    for p in cl:
        summa = sum([d(p, g) for g in cl])
        R.append([summa, p])
    return min(R)[1]

centersA = [center(cl) for cl in clusterA]
pxA = sum([x for x, y in centersA]) / 2 * 10000
pyA = sum([y for x, y in centersA]) / 2 * 10000
print(int(pxA), int(pyA))


centersB = [center(cl) for cl in clusterB]
pxB = sum([x for x, y in centersB]) / 3 * 10000
pyB = sum([y for x, y in centersB]) / 3 * 10000
print(int(pxB), int(pyB))


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.2, 25, 26]
# КЕГЭ = []
# на следующем уроке:

# Первый пробник 21.12.24:
# Стас 9/29 -> 48 вторичных баллов +[2, 3-5, 7, 10, 12, 16, 22] -[1, 6, 8, 9, 11, 13, 14, 15, 17-21, 24-25]

# Второй пробник 28.02.25:
# Стас 18/29 -> 72 вторичных баллов +[1-5, 7, 8, 10, 11, 13-16, 18-21, 23] -[6, 9, 12, 17, 22, 24, 25]
