# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 31361 Пересдача 08.07.26(Уровень: Базовый)
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(х,33) → (¬ДЕЛ(х, А) → ¬ДЕЛ(х,242))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?

# Вариант 1
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(1, 5000):
    flag = True
    for x in range(1, 10000):
        if F(x, A) == False:
            flag = False
            break
    if flag == True:
        print(A)
'''

# Вариант 2
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

for A in range(1, 5000):
    cnt = 0
    for x in range(1, 10000):
        if F(x, A) == True:
            cnt += 1
    if cnt == 9999:
        print(A)
'''

# Вариант 3
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''

# Вариант 4.1
'''
def F(x, A):
    return (x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))

print(max([A for A in range(1, 5000) if all(F(x, A) for x in range(1, 10000))]))
'''

# Вариант 4.2
'''
print(max([A for A in range(1, 5000) if all( ((x % 33 == 0) <= ((x % A != 0) <= (x % 242 != 0))) for x in range(1, 10000))]))
'''


# № 31122 Основная волна 18.06.26(Уровень: Базовый)
# пусть на числовой прямой дан отрезок B = [70; 90].
# Для какого наибольшего натурального числа А логическое выражение
# ДЕЛ(х,А) ∨ ( (х∈В) →¬ДЕЛ(х,16))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?
'''
def F(x, A):
    B = 70 <= x <= 90
    return (x % A == 0) or ((B) <= (x % 16 != 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(max(RES))
'''


# № 20823 (Уровень: Базовый)
# (Д. Бахтиев) Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
# Так, например, 14&5 = 1110_2 & 0101_2 = 0100_2 = 4.
# Найдите минимальное натуральное значение А, при котором значение выражения
# (x&A=0) → ((x&77=0) ∧ (x&44=0))
# тождественно истинно, то есть принимает значение 1 при любом натуральном значении х.
'''
def F(x, A):
    return (x & A == 0) <= ((x & 77 == 0) and (x & 44 == 0))

RES = []
for A in range(1, 5000):
    if all(F(x, A) for x in range(1, 10000)):
        RES.append(A)
print(min(RES))
'''


# № 21414 Досрочная волна 2025(Уровень: Базовый)
# Для какого наименьшего целого неотрицательного числа А логическое выражение
# (5<y)∨(x>32)∨(x+2y<A)
# тождественно истинно (т.е. принимает значение 1) при любых целых неотрицательных x и y?
'''
def F(x, y, A):
    return (5<y) or (x>32) or (x+2*y<A)

RES = []
for A in range(0, 5000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        RES.append(A)
print(min(RES))  # 43
'''


# № 29347 Открытый вариант 2026(Уровень: Базовый)
# На числовой прямой даны два отрезка: B = [22; 40] и C = [32; 50].
# Укажите наименьшую возможную длину такого отрезка A, для которого
# логическое выражение
# ¬(x ∈ A) → ((x ∈ B) ≡ (x ∈ C))
# истинно (т. е. принимает значение 1) при любом значении переменной х.
'''
def F(x, a1, a2):
    B = 22 <= x <= 40
    C = 32 <= x <= 50
    A = a1 <= x <= a2
    return (not A) <= ((B) == (C))


RES = []
M = [x for x in range(10, 60)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))
'''


# № 21710 ЕГКР 19.04.25(Уровень: Базовый)
# На числовой прямой даны два отрезка: B = [36; 75] и C = [60; 110].
# Укажите наименьшую возможную длину такого отрезка A, что логическое
# выражение
# ¬(x∈A)→((x∈B)≡(x∈C))
#  истинно (т.е. принимает значение 1) при любом значении переменной х.
'''
def F(x, a1, a2):
    B = 36 <= x <= 75
    C = 60 <= x <= 110
    A = a1 <= x <= a2
    return (not A) <= ((B) == (C))
RES = []
M = [x / 4 for x in range(30*4, 120*4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            RES.append(a2 - a1)
print(min(RES))
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [2, 5, 8, 14, 15]
# КЕГЭ = []
# на следующем уроке:

