# region Домашка: ******************************************************************



# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 863 (Уровень: Базовый)
'''
s = open('files/24.txt').readline()
cnt = 1
maxi = 0
for i in range(len(s) - 1):
    if s[i] != s[i+1]:
        cnt += 1
        maxi = max(maxi, cnt)
    else:
        cnt = 1
print(maxi)
'''


# Тип 24 №37159
# Найдите максимальную длину подстроки,
# в которой символы a и d не стоят рядом.
'''
s = open('files/24.txt').readline()
s = s.replace('ad', 'a d').replace('da', 'd a')
print(max([len(x) for x in s.split()]))
'''


# Тип 24 №40740
# Определите максимальное количество идущих подряд символов,
# среди которых нет ни одной буквы A и при этом не менее трёх букв E.
'''
s = open('files/24.txt').readline()
s = s.replace('A', ' ')
print(max([len(x) for x in s.split() if x.count('E') >= 3]))
'''


# Тип 24 №45258
# Искомая подпоследовательность должна состоять только из пар AB,
# или только из пар CB, или только из пар AB и CB в произвольном
# порядке следования этих пар.
'''
s = open('files/24.txt').readline()
s = s.replace('CB', '*').replace('AB', '*')
for x in 'ABC':
    s = s.replace(x, ' ')
print(s)
print(max([len(x) for x in s.split()]))
'''


# Тип 24 №55820
# Определите максимальное количество идущих подряд символов,
# среди которых символы Q, R, S в различных комбинациях
# (с учётом повторений) не стоят рядом.

s = open('files/24.txt').readline()
s = s.replace('Q', 'R').replace('R', 'S')
while 'SS' in s:
    s = s.replace('SS', 'S S')
print(max([len(x) for x in s.split()]))


# S SS SS SS S

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [19-21]
# на следующем уроке: 10, (26)  + 10 минут