# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Тип 25 № 36880 🌶
'''
R = []
for n in range(1, 20, 2):
    for m in range(0, 30, 2):
        N = 2**m * 3**n
        if 400_000_000 <= N <= 600_000_000:
            R.append(N)
R = sorted(R)
for x in R:
    print(x)
'''



# https://stepik.org/lesson/1228668/step/4?unit=1242201
'''
def convert(n, b):
    r = ''
    while n > 0:
        r = r + str(n % b)
        n //= b
    return r[::-1]


L = []
for n in range(1, 1000):
    s = convert(n, 4)
    if (len(s) % 2) == 0:
        s = s[:(len(s) // 2)] + '0' + s[(len(s) // 2):]
    r = int(s, 4)
    if r <= 180:
        L.append(n)
print(max(L))
'''

def convert(n, b):
    r = ''
    while n > 0:
        r = r + str(n % b)
        n //= b
    return r[::-1]

L = []
for n in range(1, 10000):
    s = convert(n, 7)
    if s.count('2') % 2 == 0:
        s = s + '555'
    else:
        s = '1' + s
    r = int(s, 7)
    if r < 3799:
        L.append(n)
print(max(L))



# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [5, 11, 19-21, 25]
# на следующем уроке: (26)


# region 📖 Пробник (Вариант 2)

# Студент #Татьяна
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 3, 4, 6, 7, 10, 11, 14, 16, 17, 19, 20, 21, 22, 23, 25
# ⛔️ Неверно: 5, 8, 12
# ❔ Без ответа: 9, 13, 15, 18, 24, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных


# Студент #Анна
# Дата: #Суббота #28Февраля2026
# ✅ Верно: 1, 2, 4, 7, 8, 11, 12, 14, 15, 16, 17, 18, 23, 25
# ⛔️ Неверно: 3, 5, 6, 10, 19, 20, 21, 27
# ❔ Без ответа: 9, 13, 22, 24, 26
# Итог: 14/29 первичных балла ~ 62 вторичных

# endregion 📖 Пробник (Вариант 2)


