# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 12240 ЕГКР 16.12.23 (Уровень: Базовый)
'''
cnt = 0
from itertools import product
for p in product('012345678', repeat=5):
    num = ''.join(p)
    if num[0] != '0':
        if num.count('5')==1:
            if all(num[i] != num[i+1] for i in range(len(num)-1)):
                cnt += 1
print(cnt)
'''


# № 11299 (Уровень: Базовый)
'''
L = []
n = 0
s = sorted('БМЮРН')
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        word = a + b + c + d + e + f
                        n += 1
                        if word[0] != 'М':
                            if word.count('Р') >= 2:
                                if word.count('Ю') == 0:
                                    if n % 2 != 0:
                                        L.append(n)
print(max(L))
'''


# № 27286 (Уровень: Базовый)
'''
n = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    n += 1
    copied1 = [x for x in M if M.count(x) == 1]
    copied2 = [x for x in M if M.count(x) == 2]
    copied3 = [x for x in M if M.count(x) == 3]
    if len(copied3) == 3 and len(copied2) == 2 and len(copied1) == 1:
        if copied1[0] <= min(copied2 + copied3):
            print(n, abs(min(copied2 + copied3)))
'''


#
# № 24360 (Уровень: Сложный)
#
# (А. Ходарин) Откройте файл электронной таблицы, содержащей
# в каждой строке восемь натуральных чисел.
# Определите минимальную сумму чисел в строке таблицы,
# содержащей числа, для которой выполнено ровно одно условие:
# – квадрат минимального числа присутствует в строке;
# – из чисел строки можно получить три пары одинаковых чисел

'''
R = []
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    flag = 0
    if min(M) ** 2 in M:
        flag += 1
    copied2 = [x for x in M if M.count(x) == 2]
    if len(copied2) == 6:
        flag += 1
    if flag == 1:
        R.append(sum(M))
print(min(R))
'''

# № 20070 (Уровень: Средний)

# (Д. Бахтиев) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел.
# Определите количество строк таблицы, для чисел которых выполняется только одно из условий:
# — все элементы строки являются двузначными числами;
# — в строке нет чисел, кратных 5.
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    flag = 0
    if all(len(str(abs(x))) == 2 for x in M):
        flag += 1
    if all(int(x) % 5 != 0 for x in M):
        flag += 1
    if flag == 1:
        cnt += 1
print(cnt)
'''


# № 8467 (Уровень: Средний)

# (В. Рыбальченко) В каждой строке файла содержится 5 натуральных чисел.
# Необходимо посчитать количество строк, в которых выполняется только одно условие из:
# – Все числа различны;
# – Удвоенная сумма максимального и минимального меньше суммы трех оставшихся чисел.
'''
cnt = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    M = sorted(M)
    flag = 0
    if len(M) == len(set(M)): 
        flag += 1
    if 2 * (M[0] + M[-1]) < sum(M) - (M[0] + M[-1]):
        flag += 1
    if flag == 1:
        cnt += 1
print(cnt)
'''

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [8, 9, 11, 19-21]
# на следующем уроке: