# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
s = '11001100'
s = s.replace(s[0], '2')
s = s.replace(s[1], '2')
print(s)  # 22002200

s = '11001100'
s = '22' + s[2:]
print(s)  # 22001100
'''

'''
L = []
for n in range(1, 10000):
    s = bin(n)[2:]
    if s.count('1') % 2 == 0:
        s = '10' + s[2:] + '0'
    else:
        s = '11' + s[2:] + '1'
    r = int(s, 2)
    if r <= 19:
        L.append(n)
print(max(L))
'''

'''
R = []
M = [int(s) for s in open('files/17 (1).txt')]
A = [x for x in M if len(str(abs(x))) == 5]
B = [x for x in M if abs(x) % 100 == 22]
for i in range(len(M) - 2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 2:
        if (x + y + z) < max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''



# № 21990 (Уровень: Средний)
# (Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать
# целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности,
# в которых модуль суммы отрицательных чисел не больше суммы положительных, а произведение элементов тройки
# оканчивается на ту же цифру, что и максимальный элемент в последовательности. Если в тройке отсутствуют
# положительные или отрицательные числа, то сумма чисел соответствующего знака считается равной нулю.
# В ответе запишите количество найденных троек чисел, затем максимальное значение из модулей произведений
# элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.
'''
R = []
M = [int(s) for s in open('files/17.txt')]
for i in range(len(M) - 2):
    x, y, z = M[i], M[i+1], M[i+2]
    if abs(sum(i for i in [x, y, z] if i < 0)) <= sum(i for i in [x, y, z] if i > 0):
        if abs(x * y * z) % 10 == abs(max(M)) % 10:
            R.append(abs(x * y * z))
print(len(R), max(R))
'''

R = []
M = [int(s) for s in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 3]
B = [x for x in A if abs(x) % 100 == 15]
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x > 0 and y > 0 and z > 0) or (x < 0 and y < 0 and z < 0):
        if (min(x, y, z) * max(x, y, z)) > min(B) ** 2:
            R.append(min(x, y, z) * max(x, y, z))
print(len(R), min(R))


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [5, 11, 19-21, 25]
# на следующем уроке: (26)


# region 📖 Пробник (Вариант 2)

# Студент #Татьяна
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 3, 4, 6, 7, 10, 11, 14, 16, 17, 19, 20, 21, 22, 23, 25
# ⛔️ Неверно: 5, 8, 12
# ❔ Без ответа: 9, 13, 15, 18, 24, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных


# Студент #Анна
# Дата: #Суббота #28Февраля2026
# ✅ Верно: 1, 2, 4, 7, 8, 11, 12, 14, 15, 16, 17, 18, 23, 25
# ⛔️ Неверно: 3, 5, 6, 10, 19, 20, 21, 27
# ❔ Без ответа: 9, 13, 22, 24, 26
# Итог: 14/29 первичных балла ~ 62 вторичных

# endregion 📖 Пробник (Вариант 2)


