# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Администратор/Грузоперевозки: =ЕСЛИ(B2<$E$1;1;"")
# Задачи: 24 2944 1275 1395 27636 1304 1207 788 225

# Коржи/Коробки: =ЕСЛИ(B1-A2>=8;A2;B1)
# Задачи: 27779 21910 16335 21424 7096 4712 4604

# Магазин
# Задачи: 17643

# Распределение мест  =ЕСЛИ(И(A2=A1;B2-B1=3);B2-2;"")
# Задачи: 1868, 2613, 7274, 3664, 3586, 3230, 4205

# Очередь в кассу
# Задачи: 6759  4629

# Организация сортировки
# Задачи:



file = open('files/26.txt')
N = int(file.readline())

A, B, C = [], [], []
for n, s in enumerate(file.readlines(), 1):
    x, y = [int(i) for i in s.split()]
    A.append(n)
    B.append(x)
    C.append(y)

M = sorted(B + C)


R1, R2 = [], []
for x in M:
    if x in B:
        n = B.index(x) + 1
        if n not in R1 + R2:
            R1.append(n)
            print(n)

    elif x in C:
        n = C.index(x) + 1
        if n not in R1 + R2:
            R2 = [n] + R2
            print(n)

# Ответ: 564
R = R1 + R2
print(R.index(564))  # 521  -> 522    966  966-522 = 444
print(966 - 522)  # 444





# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [5, 11, 19-21, 25]
# на следующем уроке: (26)


# region 📖 Пробник (Вариант 2)

# Студент #Татьяна
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 3, 4, 6, 7, 10, 11, 14, 16, 17, 19, 20, 21, 22, 23, 25
# ⛔️ Неверно: 5, 8, 12
# ❔ Без ответа: 9, 13, 15, 18, 24, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных


# Студент #Анна
# Дата: #Суббота #28Февраля2026
# ✅ Верно: 1, 2, 4, 7, 8, 11, 12, 14, 15, 16, 17, 18, 23, 25
# ⛔️ Неверно: 3, 5, 6, 10, 19, 20, 21, 27
# ❔ Без ответа: 9, 13, 22, 24, 26
# Итог: 14/29 первичных балла ~ 62 вторичных

# endregion 📖 Пробник (Вариант 2)


