# region Домашка: ******************************************************************

# https://stepik.org/lesson/1309434/step/8?unit=1324550
'''
n = int(input())  # n = 42365
maxi = 0
mini = 10**10
while n > 0:
    x = n % 10

    # if maxi < x:
    #     maxi = x
    maxi = max(maxi, x)

    if mini > x:
        mini = x

    n //= 10
print(maxi)
print(mini)
'''


# https://stepik.org/lesson/1309434/step/9?unit=1324550
'''
a = int(input())
b = 0
c = 0
d = 1
while a > 0:
    x = a % 10

    b += x
    c += 1
    d *= x

    a //= 10

print(b)
print(c)
print(d)
'''


n = int(input())
cnt_1 = 0
cnt_2 = 0
for i in range(n):
    x = int(input())


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
