# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 23282 Основная волна 11.06.25 (Уровень: Средний)
'''
def divisors(x):
    d = []
    for j in range(2, int(x ** 0.5)+1):
        if x % j == 0:
            d += [j, x//j]
    return sorted(set(d))

cnt = 0
for x in range(5_400_000+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) >= 2:
        M = min(d) + max(d)
        if M > 60000 and str(M) == str(M)[::-1]:
            print(x, M)
            cnt += 1
            if cnt == 5:
                break
'''
from codecs import backslashreplace_errors


# № 23207 Основная волна 10.06.25 (Уровень: Средний)
'''
def divisors(x):
    d = []
    for j in range(2, int(x ** 0.5)+1):
        if x % j == 0:
            d += [j, x//j]
    return sorted(set(d))

def F(x):
    return str(x).count('5') == 1

cnt = 0
from itertools import product
for x in range(1_324_727+1, 10**10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) > 0:
        if any(p[0] * p[1] == x and F(p[0]) and F(p[1]) for p in product(d, repeat=2)):
            print(x, max(d))
            cnt += 1
            if cnt == 5:
                break
'''


# № 28710 (Уровень: Базовый)
# Напишите программу, которая перебирает целые числа, большие 3 600 000, в порядке возрастания
# и ищет среди них числа, представимые в виде произведения ровно трёх простых множителей, необязательно
# различных, каждый из которых содержит в своей записи одновременно цифры 3 и 5. В ответе запишите
# первые пять чисел в порядке возрастания, справа от каждого числа запишите его наибольший простой делитель.
'''
def divisors(x):
    d = []
    for j in range(2, int(x ** 0.5) + 1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

def F(x):
    return '3' in str(x) and '5' in str(x)  # содержит в своей записи одновременно цифры 3 и 5
    # return str(x).count('3') + str(x).count('5') >= 1  # хотя бы одну цифру 3 или 5

cnt = 0
from itertools import product
for x in range(4_080_000 + 1, 10 ** 10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) > 0:
        if any(p[0] * p[1] * p[2] == x and F(p[0]) and F(p[1]) and F(p[2]) for p in product(d, repeat=3)):
            print(x, max(d))
            cnt += 1
            if cnt == 5:
                break
'''


# № 28711 (Уровень: Базовый)
# Напишите программу, которая перебирает целые числа, большие 2 400 000, в порядке возрастания
# и ищет среди них числа, представимые в виде произведения ровно трёх различных простых множителей,
# каждый из которых содержит в своей записи хотя бы одну цифру 4 или 7. В ответе запишите первые
# пять чисел в порядке возрастания, справа от каждого числа запишите его наибольший простой делитель.


def divisors(x):
    d = []
    for j in range(2, int(x ** 0.5) + 1):
        if x % j == 0:
            d += [j, x // j]
    return sorted(set(d))

# содержит в своей записи хотя бы одну цифру 4 или 7
def F(x):
    # return str(x).count('4') >= 1 or str(x).count('7') >= 1
    # return str(x).count('4') + str(x).count('7') >= 1
    return (str(x).count('4') >= 1) + (str(x).count('7') >= 1) >= 1

cnt = 0
from itertools import permutations
for x in range(2_400_000 + 1, 10 ** 10):
    d = [j for j in divisors(x) if len(divisors(j)) == 0]
    if len(d) > 0:
        if any(p[0] * p[1] * p[2] == x and F(p[0]) and F(p[1]) and F(p[2]) for p in permutations(d, r=3)):
            print(x, max(d))
            cnt += 1
            if cnt == 5:
                break

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [5, 11, 19-21, 25]
# на следующем уроке: (26)


# region 📖 Пробник (Вариант 2)

# Студент #Татьяна
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 3, 4, 6, 7, 10, 11, 14, 16, 17, 19, 20, 21, 22, 23, 25
# ⛔️ Неверно: 5, 8, 12
# ❔ Без ответа: 9, 13, 15, 18, 24, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных


# Студент #Анна
# Дата: #Суббота #28Февраля2026
# ✅ Верно: 1, 2, 4, 7, 8, 11, 12, 14, 15, 16, 17, 18, 23, 25
# ⛔️ Неверно: 3, 5, 6, 10, 19, 20, 21, 27
# ❔ Без ответа: 9, 13, 22, 24, 26
# Итог: 14/29 первичных балла ~ 62 вторичных

# endregion 📖 Пробник (Вариант 2)


