# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Задание 5
'''
L = []
for n in range(1, 10000):
    s = bin(n)[2:]
    if n % 3 == 0:
        s = s + s[-3:]
    else:
        x = (n % 3) * 3
        s = s + bin(x)[2:]

    r = int(s, 2)
    if 125 <= r <= 135:
        print(r, n)
'''

# Задание 7
'''
pixels = 192 * 960
I = 90 * 2**13  # бит - сжатое изображение (85%)
I = (I / 85) * 100  # (100%)
# I = pixels * i
i = I / pixels
print(i)  # 4.705 -> 4
# colors = 2 ** i
print(2 ** 4)  # 16
'''

# Задание 9
'''
n = 0
for s in open('files/9.csv'):
    M = [int(x) for x in s.split(',')]
    n += 1
    # copied1 = [x for x in M if M.count(x) == 1]
    # if len(copied1) == 5:
    # if len(set(M)) == 5:
    if len(set(M)) == len(M):
        if max(M) - min(M) == sum(M) - max(M) - min(M):
            print(n)
            break
'''

# Задание 15
'''
def F(x, A):
    return (x % 25 == 0) <= ((x % A != 0) <= (x % 60 != 0))

for A in range(1, 10000):
    if all(F(x, A) for x in range(1, 10000)):
        print(A)


# Вариант 2
for A in range(1, 10000):
    if all( ((x % 25 == 0) <= ((x % A != 0) <= (x % 60 != 0))) for x in range(1, 10000)):
        print(A)
'''

# Задание 17
'''
M = [int(s) for s in open('files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in A if abs(x) % 100 == 43]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) >= 1:
        if ((x + y) ** 2) < max(B) ** 2:
            R.append((x + y) ** 2)
print(len(R), max(R))
'''


# Задание 24
'''
# Определите в прилагаемом файле МИНИМАЛЬНОЕ количество идущих
# подряд символов (длину непрерывной подпоследовательности), среди
# которых символ Z встречается не менее 270 раз.
s = open('files/24.txt').readline()
s = s.split('Z')
RES = []
for i in range(len(s)-268):
    r = 'Z' + 'Z'.join(s[i:i+269]) + 'Z'
    RES.append(len(r))
print(min(RES))


# Определите в прилагаемом файле МАКСИМАЛЬНОЕ количество идущих
# подряд символов (длину непрерывной подпоследовательности), среди
# которых символ Z встречается не менее 270 раз.
s = open('files/24.txt').readline()
s = s.split('Z')
RES = []
for i in range(len(s)-270):
    r = 'Z'.join(s[i:i+271])
    RES.append(len(r))
print(max(RES))
'''


print(bin(415)[2:])
print(int('1111111001100000', 2))


print(bin(992)[2:])
print(int('1111101011', 2))

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [11, 19-21]
# на следующем уроке: 10, (26)


# region 📖 Пробник (Вариант 2)

# Студент #Татьяна
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 3, 4, 6, 7, 10, 11, 14, 16, 17, 19, 20, 21, 22, 23, 25
# ⛔️ Неверно: 5, 8, 12
# ❔ Без ответа: 9, 13, 15, 18, 24, 26, 27
# Итог: 17/29 первичных балла ~ 70 вторичных


# Студент #Анна
# Дата: #Суббота #28Февраля2026
# ✅ Верно: 1, 2, 4, 7, 8, 11, 12, 14, 15, 16, 17, 18, 23, 25
# ⛔️ Неверно: 3, 5, 6, 10, 19, 20, 21, 27
# ❔ Без ответа: 9, 13, 22, 24, 26
# Итог: 14/29 первичных балла ~ 62 вторичных

# endregion 📖 Пробник (Вариант 2)


