# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Способ открытия файла для 17 номера
'''
M = [int(x) for x in open('0. files/17.txt')]
'''

# Рассмотрим три типа 17 номеров:
'''
# i  0  1  2  3  4
M = [1, 2, 3, 4, 5]

# 1. Под парой подразумевается два идущих подряд элемента последовательности
# 12 23 34 45
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]

# 2. Под тройкой подразумевается три идущих подряд элемента последовательности
# 123 234 345
for i in range(len(M) - 2):
    x, y, z = M[i], M[i+1], M[i+2]

# 3. Под парой подразумевается два различных элемента последовательности
# 12 13 14 15
# 23 24 25
# 34 35
# 45
for i in range(len(M)):
    for j in range(i+1, len(M)):
        x, y = M[i], M[j]


# Начало любой программы 17 номера примерно:
M = [int(x) for x in open('files/17.txt')]
RES = []
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]
'''


# № 23201 Основная волна 10.06.25 (Уровень: Базовый)
'''
R = []
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 3]
B = [x for x in A if abs(x) % 10 == 7]
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y)  % min(B) == 0:
            R.append(x + y)
print(len(R), min(R))
'''


# № 22468 (Уровень: Базовый)
'''
R = []
M = [int(x) for x in open('0. files/17.txt')]
avg = sum(M) / len(M)
for i in range(len(M) - 1):
    x, y = M[i], M[i+1]
    if abs(x + y) > avg:
        R.append(x + y)
print(len(R), abs(min(R)))
'''


# № 21712 ЕГКР 19.04.25 (Уровень: Базовый)
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4 and abs(x) % 10 == 6]
B = [x for x in A if x > 0]
R = []
for i in range(len(M) - 2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) == 1:
        if (x + y + z) <= min(B):
            R.append(x + y + z)
print(len(R), max(R))
'''

'''
M = [int(x) for x in open('0. files/17.txt')]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x % 16 == min(M)) or (y % 16 == min(M)):
        R.append(x + y)
print(len(R), max(R))
'''

'''
M = [int(x) for x in open('0. files/17.txt')]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x % 55 == min(M)) or (y % 55 == min(M)):
        R.append(x + y)
print(len(R), min(R))
'''


# № 23376 Резервный день 19.06.25 (Уровень: Базовый)

# В файле содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от -100 000 до 100 000 включительно.
# Определите количество пар последовательности, в которых только один из элементов
# является пятизначным числом, a квадрат суммы элементов пары превышает квадрат
# максимального пятизначного элемента последовательности, оканчивающегося на 37.
# В ответе запишите количество найденных пар, затем максимальную из сумм элементов
# таких пар.
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 5 ]
B = [x for x in M if len(str(abs(x))) == 5 and abs(x) % 100 == 37]
R = []
for i in range(len(M)-1):
    x, y = M[i], M[i+1]
    if (x in A) + (y in A) == 1:
        if (x + y) ** 2 > max(B)**2:
            R.append(x + y)
print(len(R), max(R))
'''


# № 23276 Основная волна 11.06.25 (Уровень: Базовый)
# В файле содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от -100 000 до 100 000 включительно.
# Определите количество троек элементов последовательности, в которых не более двух
# из трёх элементов являются четырёхзначными числами, а сумма элементов тройки не
# больше максимального элемента последовательности, оканчивающегося на 25.
# В ответе запишите количество найденных троек чисел, затем максимальную из сумм
# элементов таких троек.
'''
M = [int(x) for x in open('0. files/17.txt')]
A = [x for x in M if len(str(abs(x))) == 4]
B = [x for x in M if abs(x) % 100 == 25]
R = []
for i in range(len(M)-2):
    x, y, z = M[i], M[i+1], M[i+2]
    if (x in A) + (y in A) + (z in A) <= 2:
        if (x + y + z) <= max(B):
            R.append(x + y + z)
print(len(R), max(R))
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 8, 9, 13, 14, 15, 16, 17, 19-21, 23, 25]
# КЕГЭ = []
# на следующем уроке:
