# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 21703 ЕГКР 19.04.25 (Уровень: Базовый)
'''
from itertools import *
n = 0
for p in product(sorted('ПОБЕДА'), repeat=6):
    word = ''.join(p)
    n += 1
    if n % 2 == 0:
        if word[0] in 'О':
            if len(word) == len(set(word)):
                print(n)
'''


#
# № 21407 Досрочная волна 2025 (Уровень: Базовый)
'''
from itertools import *
cnt = 0
for p in product('ДГИАШЭ', repeat=5):
    word = ''.join(p)
    if word[0] not in 'ИАЭ':
        if word[-1] not in 'ДГШ':
            cnt += 1
print(cnt)
'''


#
# № 21894 Открытый вариант 2025 (Уровень: Базовый)

from itertools import *
cnt = 0
for p in permutations('0123456789', r=4):
    num = ''.join(p)
    if num[0] != '0':
        for x in '02468':
            num = num.replace(x, '2')
        for x in '13579':
            num = num.replace(x, '1')
        if '22' not in num and '11' not in num:
            cnt += 1
print(cnt)



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19-21, 22, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 8, 17


# Первый пробник 21.12.24:
# Тимур 6/29 -> 40 вторичных баллов +[12, 14, 16, 19, 23, 25] -[4, 5, 6, 7, 8, 10, 11, 13]

# Второй пробник 28.02.25:
# Тимур 9/29 -> 48 вторичных баллов +[1, 2, 7, 16, 19-21, 23, 25] -[5, 6, 8, 9, 13, 14, 17]
