# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
def F(a, b):
    if a >= b or a == 35:
        return a == b  # True / False
    h = [F(a+1, b), F(a+2, b), F(a*2, b)]
    return sum(h)

print(F(7 , 13) * F(13, 15) * F(15, 51))
'''

# s - это кол-во камней в кучи
# n - это шаг нашей игры

# n = 1: Петя первый шаг
# n = 2: Ваня первый шаг
# n = 3: Петя второй шаг
# n = 4: Ваня второй шаг

# № 20811 Апробация 05.03.25 (Уровень: Базовый)
# 1 куча: +1, +4, *2 | >= 51 | 1 ≤ s ≤ 50
'''
def F(s, n):
    if s >= 51:
        return n % 2 == 0  # True - если победил Ване, False - если победил Петя
    if n == 0:
        return 0
    h = [F(s+1, n-1), F(s+4, n-1), F(s*2, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)
                # при любом ходе Пети: else all(h)
                # после неудачного хода Пети: else any(h)
                # ТОЛЬКО для 19 номера 

print([s for s in range(1, 51) if F(s, n=2)])
print([s for s in range(1, 51) if F(s, n=3) and not F(s, n=1)])
print([s for s in range(1, 51) if F(s, n=4) and not F(s, n=2)])
'''


# № 21418 Досрочная волна 2025 (Уровень: Базовый)
# 1 куча: -2, /2 вниз | <= 87 | S > 88
'''
from math import ceil, floor
def F(s, n):
    if s <= 87:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(s-2, n-1), F(floor(s/2), n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)


print([s for s in range(89, 1000) if F(s, n=2)])
print([s for s in range(89, 1000) if F(s, n=3) and not F(s, n=1)])
print([s for s in range(89, 1000) if F(s, n=4) and not F(s, n=2)])
'''


# № 20907 Апробация 05.03.25 (Уровень: Базовый)
# 2 кучи: a+1, s+1, a*2, s*2 | a + s >= 81 | 1 ≤ S ≤ 73 | a = 7
'''
def F(a, s, n):
    if a + s >= 81:
        return n % 2 == 0
    if n == 0:
        return 0
    h = [F(a+1, s, n-1), F(a, s+1, n-1), F(a*2, s, n-1), F(a, s*2, n-1)]
    return any(h) if (n - 1) % 2 == 0 else all(h)


print([s for s in range(1, 74) if F(7, s, n=2)])
print([s for s in range(1, 74) if F(7, s, n=3) and not F(7, s, n=1)])
print([s for s in range(1, 74) if F(7, s, n=4) and not F(7, s, n=2)])
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 6, 7, 8, 9, 11, 12, 13, 14, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 5, 8, 9, 13, 14, 17


# Первый пробник 21.12.24:
# Тимур 6/29 -> 40 вторичных баллов +[12, 14, 16, 19, 23, 25] -[4, 5, 6, 7, 8, 10, 11, 13]

# Второй пробник 28.02.25:
# Тимур 9/29 -> 48 вторичных баллов +[1, 2, 7, 16, 19-21, 23, 25] -[5, 6, 8, 9, 13, 14, 17]
