# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 19410 (Уровень: Базовый)
'''
from itertools import *
print('1 2 3 4 5 6')
table = '12 14 15 21 23 26 32 35 41 45 51 53 54 62'
graph = 'ГБ БГ БА АБ БВ ВБ АД ДА ДВ ВД ДЕ ЕД ЕВ ВЕ'
for p in permutations('АБВГДЕ'):
    new_table = table
    for i in range(1, 6+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)
'''
#   0    1    2    3    4    5
# ('Е', 'Д', 'Г', 'Б', 'В', 'А')
# 12 14 15 21 23 26 32 35 41 45 51 53 54 62


# № 19233 ЕГКР 21.12.24 (Уровень: Базовый)

from itertools import *
print('1 2 3 4 5 6 7 8')
table = '12 13 14 21 25 27 31 34 37 41 43 48 52 56 58 65 68 72 73 84 85 86'
graph = 'AF FA AG GA FG GF FH HF HE EH HC CH CB BC BE EB BD DB DE ED DG GD'
for p in permutations('ABCDEFGH'):
    new_table = table
    for i in range(1, 8+1):
        new_table = new_table.replace(str(i), p[i-1])
    if set(new_table.split()) == set(graph.split()):
        print(*p)



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 6, 8, 9, 12, 13, 14, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Тимур 6/14 -> 40 вторичных баллов +[12, 14, 16, 19, 23, 25] -[4, 5, 6, 7, 8, 10, 11, 13]
