# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# colors = 2 ** i, где i - это кол-во бит на один пиксель
# alp = 2 ** i, где i - это кол-во бит на один символ

# https://education.yandex.ru/ege/task/a966c079-3007-446e-86e0-f30cd55477df
'''
from math import ceil
sym = 33  # символов в идентификаторе (пароле)
alp = 257   # 2 ** i >= 257 (alp) -> i = 9
i = 9  # кол-во бит на один символ

bit = sym * i  # бит на один идентификатор
print(bit / 8)  # 37.125 -> 38 (тут всегда округляем вверх)

# byte = 38
byte = ceil(bit / 8)  # эта функция всегда округляет вверх

print((byte * 2**20) / 2**20)
'''


# https://education.yandex.ru/ege/task/d60b216e-85cb-45b3-9ebd-ef508c14c5db
'''
sym = 48
alp = 8
i = 3

bit = sym * i
print(bit / 8)  # 18.0
byte = 18

# user = pas + dop

user = 5750 / 250
print(user)
dop = user - byte
print(dop)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 5, 6, 7, 8, 9, 11, 12, 13, 14, 16, 17, 19-21, 23, 25]
# КЕГЭ  = []
# на следующем уроке: 5, 8, 9, 13, 14, 17


# Первый пробник 21.12.24:
# Тимур 6/29 -> 40 вторичных баллов +[12, 14, 16, 19, 23, 25] -[4, 5, 6, 7, 8, 10, 11, 13]

# Второй пробник 28.02.25:
# Тимур 9/29 -> 48 вторичных баллов +[1, 2, 7, 16, 19-21, 23, 25] -[5, 6, 8, 9, 13, 14, 17]
