# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Задание 12 https://education.yandex.ru/ege/task/99da765f-ae28-4087-9286-3b636b34b035

# На вход приведённой выше программе поступает строка,
# начинающаяся с цифры «2», а затем содержащая n цифр «5» (n > 3).
#
# Определите наименьшее значение n, при котором в строке, получившейся
# в результате выполнения программы, количество цифр «3» равно 2.

# ПОКА нашлось (25) ИЛИ нашлось (355) ИЛИ нашлось (555)
#     ЕСЛИ нашлось (25)
#         ТО заменить (25, 5)
#     ЕСЛИ нашлось (355)
#         ТО заменить (355, 52)
#     ЕСЛИ нашлось (555)
#         ТО заменить (555, 3)
'''
for n in range(4, 100):
    s = '2' + '5' * n  # исходно строка

    while '25' in s or '355' in s or '555' in s:
        if '25' in s:
            s = s.replace('25', '5', 1)
        if '355' in s:
            s = s.replace('355', '52', 1)
        if '555' in s:
            s = s.replace('555', '3', 1)
    if s.count('3') == 2:
        print(n, s)  # получившаяся строка
        break
'''


# Задание 12 https://education.yandex.ru/ege/task/284b3237-5a54-46f9-87d9-cc13ced58bec
'''
s = '1' * 81
while '11111' in s or '888' in s:
    if '11111' in s:
        s = s.replace('11111', '88', 1)
    else:
        s = s.replace('888', '8', 1)
print(s)
'''


# Задание 12 https://education.yandex.ru/ege/task/7317cf27-c322-4f0e-96e2-feb9deb1bb12
'''
for n in range(4, 10000):
    s = '8' + '5' * n

    while '8858' in s or '555' in s:
        if '8858' in s:
            s = s.replace('8858', '4', 1)
        else:
            s = s.replace('555', '58', 1)
        if '5858' in s:
            s = s.replace('5858', '85', 1)

    summa = sum([int(x) for x in s])
    if summa == 66:
        print(n)
'''


# Задание 12 https://education.yandex.ru/ege/task/cb3913cb-3918-414d-9797-ad7cd3242e6e
'''
for x in range(100):
    for y in range(50):
        for z in range(50):
            s = '0' + '1' * x + '2' * y + '3' * z + '0'
            while '00' not in s:
                s = s.replace('01', '220', 1)
                s = s.replace('02', '1013', 1)
                s = s.replace('03', '120', 1)
            if s.count('1') == 13 and s.count('2') == 18:
                print(2 + x + y + z)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [2, 5, 6, 12, 14]
# КЕГЭ  = []
# на следующем уроке:
