# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Тип 24 №27696
# Текстовый файл состоит не более чем из 10**6 символов L, D и R.
# Определите длину самой длинной последовательности, состоящей из символов L.
# Хотя бы один символ L находится в последовательности.

# Вариант 1
s = open('24.txt').readline()
count = 1
R = []
maxi = 0
for i in range(0, len(s)-1, 1):
    # if s[i] == 'L' and s[i+1] == 'L':
    if s[i:i+2] == 'LL':
        count += 1
        R.append(count)
        maxi = max(maxi, count)
    else:
        count = 1
print(maxi)
print(max(R))

# Вариант 2
s = open('24.txt').readline()
s = s.replace('D', ' ').replace('R', ' ')
print(max([len(x) for x in s.split()]))


# endregion Урок: ******************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ= [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 14, 17]
# на следующем уроке: 22 и 24 с новых вариантов и 25 номер на отрезки.
