# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# № 28709 (Уровень: Базовый)
'''
def divisors(n):
    m = []
    for j in range(2, int(n ** 0.5)+1):
        if n % j == 0:
            m += [j, n // j]
    return sorted(set(m))

cnt = 0
from itertools import product
for n in range(6_300_000 + 1, 10 ** 10):
    m = [j for j in divisors(n) if len(divisors(j)) == 0 if str(j).count('3') >= 1 or str(j).count('4') >= 1]
    if len(m) > 0:
        if any(p[0] * p[1] * p[2] == n for p in product(m, repeat=3)):
            print(n, max(m))
            cnt += 1
            if cnt == 5:
                break
'''


# № 24166 (Уровень: Средний)
# (Е. Ширшев) Напишите программу, которая перебирает целые числа, большие 7 305 678,
# в порядке возрастания и ищет среди них числа, представленные в виде произведения
# ровно четырех простых множителей, не обязательно различных, сумма которых является числом палиндромом.
# В ответе в первом столбце таблицы запишите первые 5 найденных чисел в порядке
# возрастания, а во втором столбце - для каждого из чисел соответствующую ему сумму множителей.
'''
def divisors(n):
    m = []
    for j in range(2, int(n ** 0.5)+1):
        if n % j == 0:
            m += [j, n // j]
    return sorted(set(m))

cnt = 0
from math import prod
from itertools import product
for n in range(7_305_678 + 1, 10 ** 10):
    m = [j for j in divisors(n) if len(divisors(j)) == 0]
    if len(m) > 0:
        for p in product(m, repeat=4):
            if prod(p) == n and str(sum(p)) == str(sum(p))[::-1]:
                print(n, sum(p))
                cnt += 1
                break
        if cnt == 5:
            break
'''


# № 2934 Апробация 19.02.2022 (Уровень: Базовый)
# Значение арифметического выражения: 6*512**180 + 7*64**181 + 3*8**184 + 5*8**125 - 65
#  записали в системе счисления с основанием 64. Сколько значащих нулей содержится в этой записи?
'''
n = 6*512**180 + 7*64**181 + 3*8**184 + 5*8**125 - 65
cnt = 0
while n > 0:
    if n % 64 == 0:
        cnt += 1
    n //= 64
print(cnt)
'''
# print(int('89357', 40))
# ValueError: int() base must be >= 2 and <= 36, or 0
'''
def convert(n, b):
    r = []
    while n > 0:
        r.append(n % b)
        n //= b
    return r[::-1]

n = 6*512**180 + 7*64**181 + 3*8**184 + 5*8**125 - 65
print(convert(n, 64).count(0))
'''


# № 4937 (Уровень: Средний)
# Операнды арифметического выражения записаны в системе счисления с основанием 80.
# 3x75_80 + 14x0_80
# В записи чисел переменной x обозначена неизвестная цифра из алфавита 80-ричной
# системы счисления. Определите наибольшее значение x, при котором значение
# данного арифметического выражения кратно 17. Для найденного значения x вычислите
# частное от деления значения арифметического выражения на 17 и укажите его в ответе
# в десятичной системе счисления.
'''
def my_int(L, b):
    return sum([x * b ** n for n, x in enumerate(L[::-1], 0)])

for x in range(0, 80):
    A = my_int([3, x, 7, 5], 80)
    B = my_int([1, 4, x, 0], 80)
    if (A + B) % 17 == 0:
        print((A + B) // 17)
'''

'''
def my_convert(n, b):
    r = []
    while n > 0:
        r.append(n % b)
        n //= b
    return r[::-1]

def my_int(L, b):
    return sum([x * b ** n for n, x in enumerate(L[::-1], 0)])

r = my_convert(8, 2)
print(r)  # [1, 0, 0, 0]
print(my_int(r, 2))  # 8
'''


# № 28936 ЕГКР 18.04.26 (Уровень: Базовый)
# Для какого наименьшего целого неотрицательного числа А выражение
# (x⋅y < A) ∨ (5⋅x < y) ∨ (486 ≤ x)
# истинно (т.е. принимает значение 1) при любых целых неотрицательных х и у?
'''
def F(x, y, A):
    return (x * y < A) or (5 * x < y) or (486 <= x)

for A in range(1000000, 2000000):
    if all(F(x, 5*x, A) for x in range(0, 486 * 5)):
        print(A)
        break
'''


file = open('files/26.txt')
S, N = [int(x) for x in file.readline().split()]
M = sorted([int(x) for x in file.readlines()])

R = []
for x in M:
    if sum(R) < S:
        R.append(x)
    else:
        del R[-1]
        print(N - len(R))
        print(sum(M) - sum(R))
        break






# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [6, 7, 9, 11, 14, 16, 25]
# на следующем уроке:  15 номера руками


# region 📖 Пробник (Вариант 2)

# Студент #Дарья
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 4, 5, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 27
# ⛔️ Неверно: 3, 6, 7, 10, 24, 26
# ❔ Без ответа: Нет
# Итог: 22/29 первичных балла ~ 83 вторичных

# Студент #Маша
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 21, 23
# ⛔️ Неверно: 10, 18
# ❔ Без ответа: 9, 17, 22, 24, 25, 26, 27
# Итог: 18/29 первичных балла ~ 72 вторичных

# Студент #Вика
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 6, 7, 8, 13, 14, 16, 17, 19, 20, 21, 25, 27
# ⛔️ Неверно: 5, 9, 12, 15, 23
# ❔ Без ответа: 3, 4, 10, 11, 18, 22, 24, 26
# Итог: 15/29 первичных балла ~ 65 вторичных

# endregion 📖 Пробник (Вариант 2)

