# region Домашка: ******************************************************************
from runpy import run_path

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Алгоритм вычисления функций F(n) и G(n) задан следующими соотношениями:
# F(n) = G(n) = 1 при n = 1
# F(n) = F(n − 1) + 3*G(n − 1) при n > 1
# G(n) = F(n − 1) − 2*G(n − 1) при n > 1
# Чему равна сумма цифр значения функции F(18)?
'''
from functools import *

@lru_cache(None)
def f(n):
    if n == 1:
        return 1
    return f(n-1) + 3 * g(n-1)

@lru_cache(None)
def g(n):
    if n == 1:
        return 1
    return f(n-1) - 2 * g(n-1)

for n in range(1, 20):
    f(n)
    g(n)

print(sum([int(x) for x in str(f(18))]))
print(sum(map(int, str(f(18)))))

# 18298549 -> 46
print(sum([int(x) for x in '18298549']))
'''


# № 8953 (Уровень: Базовый)
'''
from functools import *

@lru_cache(None)
def F(n):
    if n >= 10000:
        return 1
    if n < 10000 and n % 2 == 0:
        return F(n + 3) + 7
    return F(n + 1) - 3

for n in range(11000-1, -1, -1):
    F(n)

print(F(50) - F(57))
'''


# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [6, 7, 9, 11, 16, 25]
# на следующем уроке:


# region 📖 Пробник (Вариант 2)

# Студент #Дарья
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 4, 5, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 27
# ⛔️ Неверно: 3, 6, 7, 10, 24, 26
# ❔ Без ответа: Нет
# Итог: 22/29 первичных балла ~ 83 вторичных

# Студент #Маша
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 21, 23
# ⛔️ Неверно: 10, 18
# ❔ Без ответа: 9, 17, 22, 24, 25, 26, 27
# Итог: 18/29 первичных балла ~ 72 вторичных

# Студент #Вика
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 6, 7, 8, 13, 14, 16, 17, 19, 20, 21, 25, 27
# ⛔️ Неверно: 5, 9, 12, 15, 23
# ❔ Без ответа: 3, 4, 10, 11, 18, 22, 24, 26
# Итог: 15/29 первичных балла ~ 65 вторичных

# endregion 📖 Пробник (Вариант 2)

