# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# Номер 15 Статград 16.12.25 вариант 1 (https://disk.yandex.ru/i/7gymEvqmFLHL8g)'
'''
def F(x, a1, a2):
    S = 212 <= x <= 314  # x ∈ S
    T = 287 <= x <= 411
    A = a1 <= x <= a2
    return (not A) <= (T == S)

R = []
M = [x / 4 for x in range(200 * 4, 420 * 4)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) for x in M):
            R.append(a2 - a1)
print(min(R))
'''



# Составить список из 27 номер в порядке: от легкого к сложному
# 19-21, 23, 16, 15, ...., 5, 8, 24, 26















print(bin(2025)[2:])
print(f'{2025:b}')  # 11111101001

print(int('1111110100100', 2))  # 8100










# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [6, 7, 9, 11, 25]
# на следующем уроке:
# 22, 24
# Разбирать задачи 24 номера по типу арифметика и символ X 80 раз (как 51993 решу егэ)
