# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************



# № 11813 (Уровень: Базовый)
'''
s = open('files/24.txt').readline()
for x in 'AEYUIO':
    s = s.replace(x, '*')
for x in 'QWRTPSDFGHJKLZXCVBNM':
    s = s.replace(x, '+')
while '**' in s or '++' in s:
    s = s.replace('**', '* *').replace('++', '+ +')

print(max(len(x) for x in s.split()))

# Вариант 2
s = open('files/24.txt').readline()
print(len(s))
for x in s:
    if x in 'AEYUIO':
        s = s.replace(x, '*')
    else:
        s = s.replace(x, '+')

while '**' in s or '++' in s:
    s = s.replace('**', '* *').replace('++', '+ +')

print(max(len(x) for x in s.split()))
'''



# № 21 Демоверсия 2021 (Уровень: Базовый)
# Определите максимальное количество идущих подряд символов,
# среди которых каждые два соседних различны.
'''
# Вариант 1
s = open('files/24.txt').readline()
while 'XX' in s or 'YY' in s or 'ZZ' in s:
    # for x in 'XX YY ZZ'.split():
    for x in 'XYZ':
        s = s.replace(2*x, f'{x} {x}')
print(max(len(x) for x in s.split()))
'''

# Вариант 2
'''
from re import *
s = open('files/24.txt').readline()
pat = '(XY|XZ|YX|ZX)*'
M = [x.group(0) for x in finditer(pat, s)]
print(M)
print(max([len(x) for x in M]))
'''

# Вариант 3
'''
s = open('files/24.txt').readline()
cnt = 1
maxi = 0
for i in range(len(s)-1):
    if s[i] != s[i+1]:
        cnt += 1
    else:
        maxi = max(maxi, cnt)
        cnt = 1
print(maxi)
'''
# s = 'XYXYXYXYXYYY




# № 66 Джобс 31.08.2020 (Уровень: Базовый)
# Текстовый файл состоит не более чем из 106 латинских символов К, О, Т.
# Определите максимальное количество подряд идущих комбинаций КОТ.
'''
s = open('files/24.txt').readline()
print(s)
cnt = 2
maxi = 0
for i in range(len(s)-2):
    if s[i:i+3] in ('KOT', 'OTK', 'TKO'):
        cnt += 1
    else:
        maxi = max(maxi, cnt)
        cnt = 2
print(maxi / 3)
'''




# № 1273 (Уровень: Базовый)
# Текстовый файл состоит не более чем из 1200000 символов,
# которые являются прописными буквами латинского алфавита.
# Определите максимальное количество идущих подряд символов,
# среди которых нет подстроки XYZ.
'''
s = open('files/24.txt').readline()
cnt = 2
maxi = 0
for i in range(len(s)-2):
    if s[i:i+3] == 'XYZ':
        maxi = max(maxi, cnt)
        cnt = 2
    else:
        cnt += 1
print(maxi)
'''





# № 1428 (Уровень: Базовый)
# Текстовый файл состоит не более чем из 1200000 символов, которые являются прописными
# буквами латинского алфавита. Определите максимальное количество идущих подряд символов,
# среди которых нет подстроки XY и подстроки XZ.
'''
s = open('files/24.txt').readline()
cnt = 1
maxi = 0
for i in range(len(s)-1):
    if s[i:i+2] in ('XY', 'XZ'):
        maxi = max(maxi, cnt)
        cnt = 1
    else:
        cnt += 1
print(maxi)
'''


# № 2422 (Уровень: Базовый)
# Текстовый файл состоит не более чем из 106 символов X, Y, Z.
# Определите максимальное количество идущих подряд символов, расположенных
# в алфавитном порядке (возможно с повторением символов).

s = open('files/24.txt').readline()
cnt = 1
maxi = 0
for i in range(len(s)-1):
    if s[i]!=s[i+1]:
        if s[i]=='Z':
            maxi = max(maxi, cnt)
            cnt = 1
        elif s[i]=='X':
            cnt+=1
        elif s[i]=='Y' and s[i+1]=='Z':
            cnt += 1
        else:
            maxi = max(maxi, cnt)
            cnt = 1
    else:
        cnt += 1
print(maxi)


s = open('files/24.txt').readline()
cnt = 1
maxi = 0
for i in range(len(s) - 1):
    if s[i] <= s[i+1]:  # сортировать буквы можно (сравнивать их)
        cnt += 1
    else:
        maxi = max(maxi, cnt)
        cnt = 1
print(maxi)

# endregion Урок: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24.1, 25, 27]
# КЕГЭ = [6, 7, 9, 11, 25]
# на следующем уроке:


# region 📖 Пробник (Вариант 2)

# Студент #Дарья
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 4, 5, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 27
# ⛔️ Неверно: 3, 6, 7, 10, 24, 26
# ❔ Без ответа: Нет
# Итог: 22/29 первичных балла ~ 83 вторичных

# Студент #Маша
# Дата: #Четверг #05Марта2026
# ✅ Верно: 1, 2, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 21, 23
# ⛔️ Неверно: 10, 18
# ❔ Без ответа: 9, 17, 22, 24, 25, 26, 27
# Итог: 18/29 первичных балла ~ 72 вторичных

# Студент #Вика
# Дата: #Суббота #07Марта2026
# ✅ Верно: 1, 2, 6, 7, 8, 13, 14, 16, 17, 19, 20, 21, 25, 27
# ⛔️ Неверно: 5, 9, 12, 15, 23
# ❔ Без ответа: 3, 4, 10, 11, 18, 22, 24, 26
# Итог: 15/29 первичных балла ~ 65 вторичных

# endregion 📖 Пробник (Вариант 2)

