# region Домашка: ************************************************************


# endregion Домашка: *********************************************************
# #
# #
# region Урок: ************************************************************

'''
n = int(input('n: '))
if n > 0:
    print('Положительное')
elif n < 0:
    print('Отрицательное')
else:
    print('Это число нуль')
'''





# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
