# region Домашка: ************************************************************
'''
a = int(input())
if a % 2 == 0:
    print("Чётное")
else:
    print("Нечётное")
'''


# endregion Домашка: *********************************************************
# #
# #
# region Урок: ************************************************************

'''
a = int(input())
b = int(input())
c = int(input())
d = int(input())

prodd = 1
if a > 0:
    prodd *= a
if b > 0:
'''
'''
a = int(input())
if a % 13 == 0 or (a % 5 == 0 and 100 <= a <= 999):
    print('Да')
else:
    print('Нет')
'''


a = int(input())
summa = 0
if a % 160 == 0 or (a % 5 == 0 and a % 20 != 0):
    summa += a

# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
