# region Домашка: ************************************************************

'''
а = 7 ** 2  # 49
b = 10  # 10
с = а - b  # 39
а = 5  # 5
print(а)  # 5
'''

'''
print(23 // 5)  # 4 * 5 = 20, 23 - 20 = 3
x = 28 // (23 % 5)  # 28 // 3 = 9, 28 % 3 = 1, x = 9
y = 27 % x * 3 - 30 % 4 * 2  # y = -4
print(x + y)  # 9 + (-4) <=> 9 - 4 = 5
'''

# Два числа - четыре действия
'''
a = int(input())
b = int(input())
print(a + b)  # сложение
print()  # вычитание
print()  # умножение
print()  # деление (обычное вещественное)


a = int(input())
b = int(input())
print(a + b)
print()  # (a - b)
print()  # (a * b)
print()  # (a / b)


a = int(input())
b = int(input())
print(f'Куб суммы:', (a+b) ** 3)
print(f'Куб разности:', (a-b) ** 3)
'''

# endregion Домашка: *********************************************************
# #
# #
# region Урок: ************************************************************


# endregion Урок: ************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# ФИПИ = []
# КЕГЭ = []
# на следующем уроке:
