# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


X = 5  # переменная - это удобный способ взаимодействия с данными хранящимися в ячейках памяти
print(X, type(X))   # 5 <class 'int'>


# Типы данных переменных

a = 5  # int (integer) - целочисленные значения
b: int = 4
print(a + b, type(a + b))  # 9 <class 'int'>

b = 5.0  # float (число с плавающей точкой) - вещественные значения (дроби)
print(4/2, type(4/2))  # 2.0 <class 'float'>
print(4//2, type(4//2))  # 2 <class 'int'>
print(3.9999999 // 3)  # 1.0

x = 5, 0, 8, 9
print(x)  # (5, 0, 8, 9)
print(type(x))  # <class 'tuple'>

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
