# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
from math import *
R = []
for l in range(1, 1000):
    alphabet= 10 + 52 + 458
    i = ceil(log2(alphabet))#Автоматическое нахождение «i» и округление в большую сторону
    cnt = 862
    one_byte = ceil(l * i / 2**3)
    if one_byte * cnt <= 276 * 2**10:
        R.append(l)
print(max(R))
'''

# № 17524 Основная волна 07.06.24 (Уровень: Средний)
'''
from math import *
alp = 10 + 52 + 458
i = 10
cnt_byte = 862
all_byte = 276 * 2**10
byte = floor(all_byte / cnt_byte)  # floor - "не более 276 Кбайт памяти"
print(byte)  # 327 - байт на один пароль
bit = byte * 8
# bit = sym * i
sym = bit / i
print(sym)  # 261.6
'''


# https://education.yandex.ru/ege/task/658ead8e-8e85-4ad1-a74d-075f3e9f8bf0
'''
from math import *
sym1 = 10
alp1 = 33
i1 = 6
bit1 = sym1 * i1

sym2 = 1
alp2 = 1000
i2 = 10
bit2 = sym2 * i2

bit = bit2 + bit1
byte = ceil(bit / 8)

print(byte * 52)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:


# Первый пробник 21.12.24:
# Женя 5/7 -> 34 вторичных баллов +[2, 5, 8, 12, 14] -[6, 10]
# Ярослав 2/7 -> 14 вторичных баллов +[2, 12] -[5, 6, 8, 10, 14]

# Второй пробник 28.02.25:
# Женя 10/29 -> 51 вторичных баллов +[2, 5, 6, 10, 13, 14, 15, 16, 23, 25] -[8, 12]
# Ярослав 10/29 -> 51 вторичных баллов +[2, 5, 6, 10, 12, 13, 14, 15, 16, 23] -[8, 25]
