# region Домашка: ******************************************************************

'''
def convert(n, b):
    res = ''
    while n != 0:
        res += str(n % b)
        n //= b
    return res[::-1]


# n = 3 * 3125**9 + 2 * 625**8 - 4 * 625**7 + 3 * 125**6 - 2 * 25**5 - 2024
n = 10**9
# '000010'.count('0') == 5
print(convert(n, 25).count('0'))



from string import *
alphabet = digits + ascii_uppercase
print(alphabet)  # 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ

alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')

def convert(n, b):
    res = ''
    while n != 0:
        res += alphabet[n % b]
        n //= b
    return res[::-1]


n = 10**9
# '0000A'.count('0') == 4
print(convert(n, 25).count('0'))


def for15_convert(n, b):
    res = []
    while n != 0:
        res.append(n % b)
        n //= b
    return res[::-1]


n = 10**9
# [0, 0, 0, 0, 10].count(0) == 4
print(for15_convert(n, 25).count(0))
'''


# № 12468 (Уровень: Базовый)
'''
s1 = '78x79643'
s2 = '25x43'
s3 = '63x5'

for x in '0123456789ABCDEFGHI':

    res = int(s1.replace('x', x), 19) + int(s2.replace('x', x), 19) + int(s3.replace('x', x), 19)

    if res % 18 == 0:
        print(res // 18)
        break


alphabet = sorted('0123456789QWERTYUIOPASDFGHJKLZXCVBNM')
for x in alphabet[:19]:
    A = int(f'78{x}79643', 19)
    B = int(f'25{x}43', 19)
    C = int(f'63{x}5', 19)
    if (A + B + C) % 18 == 0:
        print((A + B + C) // 18)
        break
'''
# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 18166 (Уровень: Средний)

# (К. Багдасарян) Значение арифметического выражения 5**2025 + 5**200 - x
# где х – натуральное число в диапазоне от 2 до 2025, записали в системе счисления с основанием 5.
# Определите максимальное значение x, при котором данная запись содержит наибольшее количество цифр «4».
'''
def convert(n, b):
    r = ''
    while n != 0:
        r = str(n % b) + r
        n //= b
    return r

maxi = 0
last = 0
for x in range(2, 2025+1):
    n = 5**2025 + 5**200 - x
    b = convert(n, 5)
    if maxi <= b.count('4'):
        maxi = b.count('4')
        last = x
print(last)
'''


# № 7346 (Уровень: Средний)
#
# (Д. Статный) Дано арифметическое выражение:
# В записи чисел переменной x обозначена неизвестная цифра из допустимого алфавита для указанных систем счисления.
# Определите наибольшее значение x, при котором значение данного арифметического выражения кратно 35.
# Для найденного значения x вычислите частное от деления значения арифметического выражения на 35
# и укажите его в ответе в десятичной системе счисления.
'''
def my_int(r: list, b):
    return sum(x*b**i for i, x in enumerate(r[::-1], 0))

print(my_int([1, 0, 0, 0], 2))  # 8
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 14, 17, 25]
# КЕГЭ  = []
# на следующем уроке: 16, 23
