# region Домашка: ******************************************************************
'''
s = open('0. files/24.txt').readline().split('WWF')
print(s)
m = 0

for i in range(len(s) - 120):
    r = 'WF' + 'WWF'.join(s[i:i+121]) + 'WW'
    if 'WSFWW' in r:
        r = r.replace('WSFWW', 'WSFW SFWW')
        m = max(m, max([len(x) for x in r.split()]))
print(m)
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 13, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 14, 17, 22, 23, 24]
# на следующем уроке:


# Первый пробник 21.12.24:
# Yegor 21/27 -> 80 вторичных баллов +[1-5, 7, 9-12, 14-16, 18-24, 27] -[6, 8, 13, 25, 26]
