# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

def is_divisible_by_6_in_base12(number_str):
    # Переводим 12-ричное число в 10-ричное
    num = int(number_str, 12)
    return num % 6 == 0

print(is_divisible_by_6_in_base12("10"))  # True (12₁₀)
print(is_divisible_by_6_in_base12("16"))  # True (18₁₀)
print(is_divisible_by_6_in_base12("20"))  # True (24₁₀)
print(is_divisible_by_6_in_base12("13"))  # False (15₁₀)



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 13, 14, 17, 22, 23, 24]
# на следующем уроке:


# Первый пробник 21.12.24:
# Yegor 21/29 -> 80 вторичных баллов +[1-5, 7, 9-12, 14-16, 18-24, 27] -[6, 8, 13, 25, 26]

# Второй пробник 28.02.25:
# Yegor 26/29 -> 92 вторичных баллов +[1-5, 7-21, 23, 25, 26.1, 26.2, 27.1, 27.2] -[6, 22, 24]
