# region Домашка: ******************************************************************
'''
s = open('0. files/24.txt').readline().split('WWF')
print(s)
m = 0

for i in range(len(s) - 120):
    r = 'WF' + 'WWF'.join(s[i:i+121]) + 'WW'
    if 'WSFWW' in r:
        r = r.replace('WSFWW', 'WSFW SFWW')
        m = max(m, max([len(x) for x in r.split()]))
print(m)
'''


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

'''
from turtle import *

tracer(0)

k = 40
down()
for i in range(4):
    fd(10*k)
    rt(270)

up()

fd(3*k)
rt(270)
fd(5*k)
rt(90)

down()

for i in range(2):
    fd(10)
    rt(270)
    fd(12)
    rt(270)
up()
for x in range(-40, 40):
    for y in range(-40, 40):
        goto(x*k, y*k)
        dot(3, 'red')

done()
'''

'''
s = open('0. files/24.txt').readline()
m = 10000000
s = s.split('T')
for i in range(len(s) - 208):
    b = 'T' + 'T'.join(s[i:i+209]) + 'T'
    m = min(m, len(b))
print(m)
'''

# № 18138 (Уровень: Базовый)

M = []
s = ''
for i in range(0, 8+1):
    s = '1' * i + '0' * (8 - i)
    M.append(int(s, 2))
print(M)
# [0, 128, 192, 224, 240, 248, 252, 254, 255]

from ipaddress import *
for x in [0, 128, 192, 224, 240, 248, 252, 254, 255]:
    net = ip_network(f'172.16.168.0/255.255.255.{x}', 0)
    cnt = 0
    for ip in net:
        s = f'{ip:b}'
        if s.count('0') % 7 == 0:
            cnt += 1
    if cnt == 35:
        print(x)


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 13, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 13, 14, 17, 22, 23, 24]
# на следующем уроке:


# Первый пробник 21.12.24:
# Yegor 21/29 -> 80 вторичных баллов +[1-5, 7, 9-12, 14-16, 18-24, 27] -[6, 8, 13, 25, 26]

# Второй пробник 28.02.25:
# Yegor 26/29 -> 92 вторичных баллов +[1-5, 7-21, 23, 25, 26.1, 26.2, 27.1, 27.2] -[6, 22, 24]
