# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# print(eval('(4 + 2) * 03'))
'''
f = open('0. files/24.txt').readline()
for x in ('--', '**', '-*', '*-', ' -', '- ', '* ', ' *'):
    f = f.replace(x, ' ')
f = f.replace('-00-', '-0 ')
maxi = 0
for s in f.split():
    try:
        eval(s)
        if maxi < len(s):
            maxi = len(s)
            # print(len(s), s)
    except:
        if '*0' in s and s[-2:] != '*0':
            s = s.replace('*0', ' ')
        if '-0' in s and s[-2:] != '-0':
            s = s.replace('-0', ' ')
        s = s.split()  *0
        continue
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 13, 14, 15, 16, 17, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 13, 14, 17, 22, 23, 24]
# на следующем уроке:


# Первый пробник 21.12.24:
# Yegor 21/29 -> 80 вторичных баллов +[1-5, 7, 9-12, 14-16, 18-24, 27] -[6, 8, 13, 25, 26]

# Второй пробник 28.02.25:
# Yegor 26/29 -> 92 вторичных баллов +[1-5, 7-21, 23, 25, 26.1, 26.2, 27.1, 27.2] -[6, 22, 24]
