# region Домашка: ******************************************************************
'''
from ipaddress import *
for mask in range(33):
    net1 = ip_network(f'151.172.115.121/{mask}', 0)
    net2 = ip_network(f'151.172.115.156/{mask}', 0)
    if net1 != net2:
        print(mask)
        break
'''
# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

def F(x, a1, a2):
    B = 23 <= x <= 37
    C = 41 <= x <= 73
    A = a1 <= x <= a2
    return (not(((not B) <= C) <= A))


R = []
M = [x for x in range(10, 80)]
for a1 in M:
    for a2 in M:
        if all(F(x, a1, a2) == False for x in M):
            R.append(a2 - a1)
print(min(R))

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************

# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 13, 14, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:
