# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# 8 статград
'''
from itertools import *

alph = '0123456789ABC'
cnt = 0
for i in product(alph, repeat=6):
    s = ''.join(i)
    if s[0] != '0' and s.count('1') == 2:
        for k in '02468':
            s = s.replace(k, '*')
        # for k in 'ABC':
        #     s = s.replace(k, '#')
        # if '#*' not in s and '*#' not in s and '##' not in s:
        if all(p not in s for p in 'A* *A B* *B C* *C AA CC AC CA BA AB CB BC'.split()):
            cnt += 1

print(cnt)
'''

'''
for n in range(1, 10000):
    s = '>' + '7' * n + '5' * 11 + '2' * 28

    while '>5' in s or '>7' in s or '>2' in s:
        if '>5' in s:
            s = s.replace('>5', '77>', 1)
        if '>7' in s:
            s = s.replace('>7', '222>', 1)
        if '>2' in s:
            s = s.replace('>2', '55>', 1)

    summa = sum([int(x) for x in s if x.isdigit()])
    if summa % 20 == 0 and summa > 1000:
        print(n)
        break
'''

'''
from ipaddress import *
net = ip_network('112.208.0.0/255.255.224.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b[-3:] == '111' or b[-3:] == '000':
        cnt += 1

print(cnt)
'''


# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [5, 8, 9, 13, 14, 15, 16, 17, 18, 19-21, 22, 23, 24, 25]
# КЕГЭ  = [5, 8, 9, 13, 14, 17, 22, 23, 24]
# на следующем уроке:


# Первый пробник 21.12.24:
# Yegor 21/29 -> 80 вторичных баллов +[1-5, 7, 9-12, 14-16, 18-24, 27] -[6, 8, 13, 25, 26]

# Второй пробник 28.02.25:
# Yegor 26/29 -> 92 вторичных баллов +[1-5, 7-21, 23, 25, 26.1, 26.2, 27.1, 27.2] -[6, 22, 24]
