# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Единицы измерения информации
# 1 бит - минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит


# bit = a * b * c * t - вес аудио файла

# a - кол-во каналов (шт)
# b - частота дискретизации (Гц)
# с - глубина кодирования (бит)
# t - временной промежуток записи (сек)


# https://education.yandex.ru/ege/task/7407e7ee-2ca4-4372-b173-b39bffa2d1d9
'''
a = 2
b = 44000
c = 16
t = 60

bit = a * b * c * t

bit_32 = bit * 32  # бит

u = 1_802_240  # бит / с
print(bit_32 / u)  # 1500.0
'''


# https://education.yandex.ru/ege/task/97232e31-d97b-4f20-badf-1c38458126c4
'''
a = 2
b = 48000
c = 10
# t - ?

u = 256_000  # бит / с
T = 18 * 60
bit = u * T  # 60%
bit = (bit / 60) * 100  # файл до сжатия
t = bit / (a * b * c)
print(t / 60)
'''

# https://education.yandex.ru/ege/task/79f258a0-f83f-4f92-9d8f-a5400b888821
'''
a = 2
b = 11000
c = 16  # 2 ** c >= 65536
# print(2 ** 16)  # 65536
t = 4*60 + 16
Kbyte = (a * b * c * t) / (2**13)  # Кбайт
print(Kbyte)


a = 2
b = 44000
c = 10
t = 4*60 + 16
Kbyte = (a * b * c * t) / (2**13)  # Кбайт
print(Kbyte)


print(27500.0 - 11000.0)
'''


# https://education.yandex.ru/ege/task/6ecda92d-9696-4d5b-8434-0d3638b2160e
'''
a = 4
b = 48000
c = 16
t = 180
bit = a * b * c * t
bit = bit * 0.5

u = 4800  # бит/с
print((bit / u) / 60)
'''

# https://education.yandex.ru/ege/task/5eb03c97-3887-48dd-8145-55039b7a4d03
'''
sym = 11
alp = 10 + 26  # alp = 2 ** i
i = 6  # 2 ** 6 >= 36 (alp)
# i - это кол-во бит на один символ
bit = sym * i

print(bit / 8)  # 8.25
byte = 9

# user = byte + dop
user = 750 / 30  # вес одного пользователя
print(user - byte)
'''


# https://education.yandex.ru/ege/task/5b359b5d-e6d1-4701-9d12-c1b1db50e775
'''
sym = 116
alp = 16 + 2035  # 2**12 >= alp
i = 12
bit = sym * i

print(bit / 8)  # 174.0
byte = 174

print((65536 * byte) / 2**20)
'''


# https://education.yandex.ru/ege/task/7d47d6e9-3b01-44d0-83dd-2b280b962cef
'''
sym = 15
alp = 10 + 12
i = 5
bit = sym * i

print(bit / 8)  # 9.375
byte = 10

user = 12 + byte
print(user * 40)
'''


# https://education.yandex.ru/ege/task/a1beb780-b471-41fe-a815-b22e0ec632dc
'''
# sym - ?
alp = 10 + 52 + 458
print(alp, 2 ** 10)
i = 10
# bit = sym * i

byte = 276 * 2 ** 10 / 862
print(byte)  # 327.87

byte = 327
bit = byte * 8
print(bit / i)

# sym = 261.6 -> 261
'''


# https://education.yandex.ru/ege/task/96f79e32-9433-4b33-a931-1b2f12d675b1
'''
sym = 34
# alp - ?
# i - ?

byte = 124 * 2**10 / 2000
print(byte)
byte = 63 - 28

bit = byte * 8
i = bit / sym
print(i)  # 8.2352
i = 8


# пределите максимально возможную мощность алфавита, из которого составляются серийные номера.
alp = 2**8
print(alp)

i = 7  # [65:128]
i = 8  # [129:256]
'''
# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 23, 25]
# КЕГЭ  = []
# на следующем уроке:

# Первый пробник 21.12.24:
# Захар 4/6 -> 27 вторичных баллов +[2, 8, 12, 14] -[5, 6]
# Kirill 3/6 -> 20 вторичных баллов +[8, 12, 14] -[2, 5, 6]

# Второй пробник 28.02.25:
# Захар 7/13 -> 43 вторичных баллов +[1, 2, 10, 12, 14, 15, 16] -[4, 5, 6, 8, 13, 17, 23, 25]
# Kirill 6/13 -> 40 вторичных баллов +[2, 10, 13, 14, 15, 16] -[5, 6, 8, 12, 17, 23, 25]