# region Домашка: ******************************************************************

# Монетный размен: количество и остаток

# ctrl + alt + L: форматирование кода в соответствии с PEP8
'''
a = int(input())
b = int(input())
print(a // b)
print(a % b)
'''

# ((y ∨ z) <= (z ∧ w)) == ¬ ((x ∧ z) → (w ∨ y))


# Произведение и сумма цифр пятизначного числа
'''
n = int(input())
a = n // 10000
b = (n // 1000) % 10
c = (n // 100) % 10
d = (n // 10) % 10
e = n % 10
print(a * b * c * d * e)
print(a + b + c + d + e)

n = 123
print(n // 10)  # 12
print(n % 10)  # 3
'''

# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# Условные операторы (ветвление): if, elif, else

# if - если
# elif - иначе если
# else - иначе

'''
n = int(input('n: '))
if n % 2 == 0:
    print('Четное')
else:
    print('Нечетное')
'''

# x = int(input('x: '))
# y = int(input('y: '))
'''
x, y = -5, 0

if x > 0 and y > 0:
    print('Первая четверть')
elif x < 0 and y > 0:
    print('Вторая четверть')
elif x < 0 and y < 0:
    print('Третья четверть')
elif x > 0 and y < 0:
    print('Четвертая четверть')
else:
    print('Лежит на осях')

print('Продолжение программы')
'''


# Каскадные условные операторы
'''
x, y = 5, -6
if x > 0:
    if y > 0:  # x > 0, y > 0
        print('Первая четверть')
    else:  # x > 0, y <= 0
        print('Четвертая четверть')
else:
    if y > 0:  # x <= 0, y > 0
        print('Вторая четверть')
    else:  # x <= 0, y <= 0
        print('Третья четверть')
'''


# Логические связки: and, or, not, in, ==, !=, ^
'''
flag = True
print(not flag)  # False
print(not(not flag))  # True

M = [2, 3, 4, 8, 9, 3, 2, 4, 7, 3, 2, 8]
for x in M:
    if x % 2 == 0:  # == - Сравнение "если элементы равняются друг-другу"
        print(x, end=' ')  # 2 4 8 2 4 2 8
print()

M = [2, 3, 4, 8, 9, 3, 2, 4, 7, 3, 2, 8]
for x in M:
    if x % 2 != 0:  # != - Сравнение "если элементы не равняются друг-другу"
        print(x, end=' ')  # 3 9 3 7 3
print()

s = '234893247328'
for x in s:
    if x in '02468':  # Если х лежит в наборе четных цифр
        print(x, end=' ')  # 2 4 8 2 4 2 8
print()


s = '234893247328'
for x in s:
    if x not in '13579':  # Если х не лежит в наборе нечетных цифр
        print(x, end=' ')  # 2 4 8 2 4 2 8
print()

a, b, c, = 4, -5, 6
if a > 0 and b > 0:
    print('and')  # and - Гарантирует, что все условия выполняются
if a > 0 or b > 0:
    print('or')  # or - Говорит о том, что хотя бы одно условие выполянется
if (a > 0) ^ (b > 0):
    print('^')  # ^, != - Гарантируют, что только одно условие выполянется
if (a > 0) != (b > 0):
    print('!=')


print(a > 0)  # True
print(True + False + True)  # 2
if (a > 0) + (b > 0) + (c > 0) == 2:
    print('Только два условия выполняются')


# Функции all() и any()

a, b, c, = 4, 5, 6
print(all(p > 0 for p in (a, b, c)))  # True
# Все элементы a, b, c - больше нуля


a, b, c, = 4, -5, 6
print(any(p <= 0 for p in (a, b, c)))  # True
'''

# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = []
# КЕГЭ  = []
# на следующем уроке:
