# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************


# № 7087 OpenFIPI (Уровень: Базовый)
'''
sym = 250
alp = 1650+10  # alp = 2 ** i  / colors = 2 ** i
i = 11  # кол-во бит на один символ

bit = sym * i  # бит выделяемых на один серийный номер/ID/пароль
print(bit / 8)  # 343.75 -> 344
byte = 344  # байт выделяемых на один серийный номер/ID/пароль

print((byte * 65_536) / 2**10)
'''

# № 7261 OpenFIPI (Уровень: Базовый)
'''
sym = 25
alp = 7  # 2**3 >= 7
i = 3

bit = sym * i
print(bit / 8)  # 9.375 -> 10
byte = 10


user = 4800 / 200
print(user - byte)
'''

# № 6746 Апробация 10.03.23 (Уровень: Базовый)
'''
sym = 318
alp = 5000 + 10
i = 13  #  2**13 >= 5010

bit = sym * i
print(bit / 8)  # 516.75 -> 517
byte = 517

print((8192 * byte) / 2**10)
'''


# Единицы измерения информации
# 1 бит - минимальная единица измерения
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**10 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**10 Мбайт - 2**30 байт - 2**33 бит

# Из большего в меньшее - умножаем
# 7 Мбайт = 7 * 2**23 бит
# 7 Мбайт = 7 * 2**20 байт

# 13 Кбайт = 13 * 2**10 байт

# Из меньшего в больше - деление
# 215600 байт = 215600 / 2**10 Кбайт


# № 21897 Открытый вариант 2025 (Уровень: Базовый)
# Известно, что для хранения 703 569 серийных номеров
# доступно не более 77 Мбайт памяти.
'''
sym = 246
# alp - ?
# i - ?
# i = bit / sym
# bit - ?
# byte - ?

byte = 77*2**20 / 703_569
print(byte)  # 114.758 -> 114

bit = 114 * 8
print(bit / sym)  # 3.707 -> 3
i = 3


print(f'Максимально возможную мощность алфавита: {2**3}')
print(f'Минимальная возможную мощность алфавита: {2**2+1}')

# i = 3 [5:8]
# i = 4 [9:16]
# i = 5 [17:32]
# i = 6 [33:64]
# i = 7 [65:128]


alp = 18  # alp = 2 ** i
i = 5

alp = 89
i = 7

alp = 33
i = 6

alp = 63
i = 6
alp = 64   # 2 ** 6

alp = 65
i = 7

alp = 135
i = 8
'''


# № 21706 ЕГКР 19.04.25 (Уровень: Базовый)
# Известно, 125 300 серийных номеров занимают более 23 Мбайт памяти.
'''
sym = 119
byte = 23 * 2 ** 20 / 125_300
print(byte)  # 192.4760 -> 193

bit = 193 * 8
print(bit / sym)  # 12.974 -> 13
i = 13

print(f'Максимально возможную мощность алфавита: {2**13}')
print(f'Минимальная возможную мощность алфавита: {2**12+1}')
'''



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = [13, 14, 15, 16, 23]
# на следующем уроке:

# Первый пробник 21.12.24:
# Захар 4/6 -> 27 вторичных баллов +[2, 8, 12, 14] -[5, 6]
# Kirill 3/6 -> 20 вторичных баллов +[8, 12, 14] -[2, 5, 6]

# Второй пробник 28.02.25:
# Захар 7/13 -> 43 вторичных баллов +[1, 2, 10, 12, 14, 15, 16] -[4, 5, 6, 8, 13, 17, 23, 25]
# Kirill 6/13 -> 40 вторичных баллов +[2, 10, 13, 14, 15, 16] -[5, 6, 8, 12, 17, 23, 25]