# region Домашка: ******************************************************************


# endregion Домашка: ******************************************************************
# #
# #
# region Урок: ********************************************************************

# № 21899 Открытый вариант 2025 (Уровень: Базовый)
'''
from ipaddress import *
net = ip_network('98.81.154.195/255.252.0.0', 0)
for ip in net:
    print(ip)
'''


# 20959
'''
from ipaddress import *
net = ip_network('203.68.128.0/255.255.192.0', 0)
cnt = 0
for ip in net:
    b = f'{ip:b}'
    if b.count('1') % 7 != 0:
        cnt += 1
print(cnt)
'''


# 21747
# Для узла с IP адресом 84.23.84.23 адрес сети
# равен 84.23.84.0. Чему равно наибольшее значение суммы
# третьего и четвёртого слева байтов маски?
'''
from ipaddress import *
for mask in range(32+1):
    net = ip_network(f'84.23.84.23/{mask}', 0)
    if '84.23.84.0' in str(net):
        print(net.netmask)
'''

from ipaddress import *
maxi = 0
for mask in range(32+1):
    net1 = ip_network(f'95.24.2.9/{mask}', 0)
    net2 = ip_network(f'95.24.3.10/{mask}', 0)
    if net1 != net2:
        cnt = 0
        for ip in net1.hosts() :
            b = f'{ip:b}'
            if b[-1] == '0':
                cnt += 1
        maxi = max(maxi, cnt)
print(maxi)



# endregion Урок: *************************************************************
# #
# #
# region Разобрать: *************************************************************


# endregion Разобрать: *************************************************************
# #
# #
# ФИПИ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19-21, 23, 25]
# КЕГЭ  = [13]
# на следующем уроке:

# Первый пробник 21.12.24:
# Захар 4/6 -> 27 вторичных баллов +[2, 8, 12, 14] -[5, 6]
# Kirill 3/6 -> 20 вторичных баллов +[8, 12, 14] -[2, 5, 6]

# Второй пробник 28.02.25:
# Захар 7/13 -> 43 вторичных баллов +[1, 2, 10, 12, 14, 15, 16] -[4, 5, 6, 8, 13, 17, 23, 25]
# Kirill 6/13 -> 40 вторичных баллов +[2, 10, 13, 14, 15, 16] -[5, 6, 8, 12, 17, 23, 25]